Функция ОстаткиТоваров(Склад, Дата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА Остатки.КоличествоОстаток > 0
	|			ТОГДА ""В наличии""
	|		ИНАЧЕ ""Нет""
	|	КОНЕЦ КАК Статус
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад) КАК Остатки
	|ГДЕ
	|	Остатки.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Товар)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";

	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Дата", Дата);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
