#Область ОписаниеПеременных

Перем ВалютаУчета;
Перем АдресПоддержки;

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Тест(Параметр)

    Справочники.Справочник1.ТестЭкспортная(); // Ошибка: Обращение через менеджер избыточно
    ТестЭкспортная();

КонецПроцедуры

Процедура ТестЭкспортная() Экспорт

КонецПроцедуры

#КонецОбласти


#Region EventHandlers
// Enter code here.
#EndRegion

#Region Internal
// Enter code here.
#EndRegion

#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИмяТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Region Initialize

SupportEmail = "v8@1c.ru";
Ctor();

Для Каждого Справочник1 Из ДанныеДляКоллекции() Цикл

    Справочник1.Поле = Справочник1.Поле2;

КонецЦикла;

#EndRegion