Перем А Экспорт;

Функция Б() Экспорт

	С = Новый Структура("А,Б,В,Г", 0, 0, 0, 0);

КонецФункции

Функция В(Условие)

	Если Условие = "1" Тогда

		Результат = 1;

	ИначеЕсли Условие = "2" Тогда

		Результат = 2;

	ИначеЕсли Условие = "1" Тогда

		Результат = 3;

	Иначе

		Результат = 4;

	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция Д(Условие)

	Если Условие = "1" Тогда

		Результат = 1;

	ИначеЕсли Условие = "2" Тогда

		Результат = 2;

	ИначеЕсли Условие = "3" Тогда

		Результат = 3;

	КонецЕсли;

	Возврат Результат;

КонецФункции

// В строке несколько срабатываний одной диагностики, код экшен должен быть один
СложениеБезОтступов=1+2+3+4+5;

// В строке несколько срабатываний разных диагностик
СложениеБезОтступов = (1=2) или (3=4); // Тут уже есть какой-то комментарий