
Структура = Новый Структура("а, б, в", а, б, в);

    Структура = Новый Структура("а, б, в", а, б, в);

СтруктураПолей = Новый Структура("Измерения, Реквизиты, Ресурсы",
    Новый Структура("СтрокаПолей", ""),
    Новый Структура("СтрокаПолей", ""),
    Новый Структура("СтрокаПолей", ""));

СтрокиВопроса = СтрокаДерева.СоставКомплексногоВопроса.НайтиСтроки(Новый Структура("ЭлементарныйВопрос", ВыборкаВопрос.ЭлементарныйВопрос));

Структура = Новый Массив();
Структура = Новый Структура;
Структура = Новый Структура();
Структура = Новый Структура(Идентификатор);

Чтото.Поле = Новый Структура("а, б, в", а, б, в);
