// Описание функции.
// Многострочное.
//
// Параметры:
//  П1 - Дата, Число - Описание даты/числа
//  П2 - Число - Описание числа
//  П3 - Структура - Описание строки
//  * Поле1 - Число - Описание поле1
// продолжается на следующей строкке
//  * Поле2 - Строка - Описание поле2
//  * Поле3 - Структура:
//      ** Поле31 - строка
//      ** Поле32 - Структура:
//          *** Поле321 - Число - Описание поля 321
//      ** Поле33 - строка
//  * Поле4 - строка
//  П4 - Массив - Описание Массива
//   - СписокЗначений - Описание списка
//  ПДата - См. ОбщийМодуль.СуперМетод()
//
// Возвращаемое значение:
//   - Строка - вернувшаяся строка
//   - Структура - Описание строки
//  * Поле1 - Число - Описание поле1
// продолжается на следующей строкке
//  * Поле2 - Строка - Описание поле2
//  * Поле3 - Структура:
//      ** Поле31 - строка
//      ** Поле32 - Структура:
//
Функция ИмяФункции(Знач П1, П2 = -10, П2_5, Знач П3 = "", П4, ПДата = '20100101', ПДатаВремя = '20110101121212', П6 = Ложь, П7 = Истина, П8 = Неопределено, П9 = NULL) Экспорт
    Сообщить("");
КонецФункции

ИмяФункции();

Справочники.Справочник1.ТестЭкспортная();

ПервыйОбщийМодуль.УстаревшаяПроцедура();

ПервыйОбщийМодуль.РегистрацияИзмененийПередУдалением(); // не должен найти

ПроцедураМодуляПриложения();
