Перем ИмяБезОписания;

Перем Имя_ОписаниеСправаОднойСтрокой; // описание

 // описание
Перем Имя_ОписаниеСверхуОднойСтрокой;

// описание 1 строка
// 2 строка
Перем Имя_ОписаниеСверхуДвеСтроки;

// описание 1 строка
// 2 строка
//
Перем Имя_ОписаниеСверхуТриСтрокиПоследняяПустая;

Функция ИмяФункции()

    Перем ИмяБезОписания_Функция;

    Перем Имя_ОписаниеСправаОднойСтрокой_Функция; // описание

     // описание
    Перем Имя_ОписаниеСверхуОднойСтрокой_Функция;

    // описание 1 строка
    // 2 строка
    Перем Имя_ОписаниеСверхуДвеСтроки_Функция;

    // описание 1 строка
    // 2 строка
    //
    Перем Имя_ОписаниеСверхуТриСтрокиПоследняяПустая_Функция;

КонецФункции

ИмяФункции();
