// Вызывается перед добавлением команд.
//
// Параметры:
//   Команды - ТаблицаЗначений - сформированные команды:
//     * Представление - Строка - представление команды.
//     * Порядок - Число - порядок команды.
//
Процедура ПередДобавлением(Команды) Экспорт
	
КонецПроцедуры

// Новый результат добавления.
//
// Возвращаемое значение:
//   Структура - результат:
//     * Команды - Массив - добавленные команды.
//
Функция НовыйРезультат() Экспорт
	Возврат Новый Структура("Команды", Новый Массив);
КонецФункции
