// Обрабатывает команды.
//
// Параметры:
//   Команды - см. Источник.ПередДобавлением.Команды
//   Настройки - см. Источник.НовыеНастройки
//
Процедура Обработать(Команды, Настройки) Экспорт
	Команда = Команды.Добавить();
	Команда.Представление = "";
	ИмяНастройки = Настройки.Имя;
КонецПроцедуры

// Параметры:
//   Процедурой - см. Источник.ПередДобавлением
//   БезПараметра - см. Источник.ПередДобавлением.НетТакого
//   ПоКругу - см. Источник.Цикл.ПоКругу
//
Процедура Крайние(Процедурой, БезПараметра, ПоКругу) Экспорт
	ТипПроцедурой = Процедурой;
	ТипБезПараметра = БезПараметра;
	ТипПоКругу = ПоКругу;
КонецПроцедуры
