// Добавляет команду.
//
// Параметры:
//   Команды - см. Переопределяемый.ПередДобавлением.Команды
//   Добавлять - Булево - добавлять ли команду.
//
// Возвращаемое значение:
//   Неопределено - команда не добавлена.
//
Функция ДобавитьКоманду(Команды, Добавлять) Экспорт
	Если Добавлять Тогда
		Команда = Команды.Добавить();
		Возврат Команда;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

// См. Переопределяемый.ПередДобавлением
Функция ДобавитьКомандуПоИнтерфейсу(Команды, Добавлять) Экспорт
	Если Добавлять Тогда
		Команда = Команды.Добавить();
		Возврат Команда;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

// См. Интерфейс.ПередДобавлением
Функция ДобавитьКомандуЧерезИнтерфейс(Команды, Добавлять) Экспорт
	Если Добавлять Тогда
		Команда = Команды.Добавить();
		Возврат Команда;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

// Результат добавления.
//
// Возвращаемое значение:
//   см. Переопределяемый.НовыйРезультат
//
Функция Результат() Экспорт
	Возврат Неопределено;
КонецФункции

Функция РезультатЧерезВызов() Экспорт
	Возврат Результат();
КонецФункции

// Результат через функцию своего модуля.
//
// Возвращаемое значение:
//   см. ЛокальныйРезультат
//
Функция РезультатЧерезЛокальную() Экспорт
	Возврат Неопределено;
КонецФункции

// Возвращаемое значение:
//   см. Переопределяемый.НовыйРезультат
//
Функция ЛокальныйРезультат()
	Возврат Неопределено;
КонецФункции

Функция РезультатЧерезЛокальнуюВызов() Экспорт
	Возврат РезультатЧерезЛокальную();
КонецФункции
