// Вызывается перед добавлением команд.
//
// Параметры:
//   Команды - ТаблицаЗначений - сформированные команды:
//     * Представление - Строка - представление команды.
//
Процедура ПередДобавлением(Команды) Экспорт
	
КонецПроцедуры

// Новые настройки.
//
// Возвращаемое значение:
//   Структура - настройки:
//     * Имя - Строка - имя настройки.
//
Функция НовыеНастройки() Экспорт
	Возврат Новый Структура("Имя", "");
КонецФункции

// Параметры:
//   ПоКругу - см. Потребитель.Крайние.ПоКругу
//
Процедура Цикл(ПоКругу) Экспорт
	
КонецПроцедуры
