Функция ОпределитьСтавкуНДС(Знач Ставка)
    Если Ставка = Перечисления.СтавкиНДС.НДС20 Тогда
        Возврат 20;
    ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС10 Тогда
        Возврат 10;
    ИначеЕсли Не ЗначениеЗаполнено(Ставка) Тогда
        Возврат Константы.СтавкаНДСПоУмолчанию.Получить();
    КонецЕсли;

    // здесь будет неявный возврат Неопределено
КонецФункции

Функция ОпределитьСтавкуНДС(Знач Ставка)
    Если Ставка = Перечисления.СтавкиНДС.НДС20 Тогда
        Возврат 20;
    ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС10 Тогда
        Возврат 10;
    ИначеЕсли Не ЗначениеЗаполнено(Ставка) Тогда
        Возврат Константы.СтавкаНДСПоУмолчанию.Получить();
    КонецЕсли;

    // Явно декларируем намерение вернуть Неопределено
    Возврат Неопределено;
КонецФункции

Функция СуммаСкидки(Знач КорзинаЗаказа)
    Если КорзинаЗаказа.Строки.Количество() > 10 Тогда
        Возврат Скидки.СкидкаНаКрупнуюКорзину(КорзинаЗаказа);
    ИначеЕсли КорзинаЗаказа.ЕстьКартаЛояльности Тогда
        // функция возвращает непредусмотренное значение Неопределено
        Скидки.СкидкаПоКартеЛояльности(КорзинаЗаказа);
    Иначе
        Возврат 0;
    КонецЕсли;
КонецФункции

Функция ЦиклДляПроверки(Коллекция, Поиск)

    // если assumeLoopsAreExecutedOnce=true - то не будет срабатывания
    // по ветке Для..Цикл -> КонецФункции
    Для Каждого Элемент Из Коллекция Цикл
        Если Элемент = Поиск Тогда
            Возврат 1;
        КонецЕсли; // будет срабатывание на выход из КонецЕсли->КонецФункции
    КонецЦикла;

КонецЦикла;