Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	Валюты.Ссылка, // Неправильно
	|	Валюты.Ссылка КАК ПсевдонимПоляСсылка, // Правильно
	|	Валюты.Код Код // Неправильно
	|ИЗ
	|	Справочник.Валюты КАК Валюты // Игнорируется
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Валюты.Ссылка, // Игнорируется
	|	Валюты.Ссылка, // Игнорируется
	|	Валюты.Код // Игнорируется
	|ИЗ
	|	Справочник.Валюты КАК Валюты // Игнорируется
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Валюты.Ссылка, // Неправильно
	|	Валюты.Ссылка КАК ПсевдонимПоляСсылка, // Правильно
	|	Валюты.Код Код // Неправильно
	|ИЗ
	|	Справочник.Валюты КАК Валюты // Игнорируется
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Валюты.Ссылка, // Игнорируется
	|	Валюты.Ссылка, // Игнорируется
	|	Валюты.Код // Игнорируется
	|ИЗ
	|	Справочник.Валюты КАК Валюты"; // Игнорируется

Запрос1 = Новый Запрос;
Запрос1.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка // Правильно
	|ИЗ
	|	(ВЫБРАТЬ
	|		Валюты.Ссылка // Не правильно
	|	ИЗ
	|		Справочник.Валюты КАК Валюты) КАК ВложенныйЗапрос"; // Игнорируется

// неполный запрос
Текст = "ВЫБРАТЬ
        |	ВложенныйЗапрос.Номенклатура КАК Номенклатура
        |ИЗ
        |	(ВЫБРАТЬ
        |		Таблица.Номенклатура КАК Номенклатура,
        |		Таблица."+?(Тип = "тип","Поле1","Поле2")+" КАК Остаток,
        |		Таблица."+?(Тип = "тип","Поле1","Поле2")+" КАК КонечныйОстаток,
        |		Таблица.МестоХранения КАК МестоХранения
        |	ИЗ
        |		РегистрНакопления.ПартииНоменклатуры.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, ДвиженияИГраницыПериода, ";

// Битый запрос с npe на полях
ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВТ_ТЧ.НомерСтроки
	|ИЗ
	|	&ВТ_Цены КАК ВТ_Цены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + ПоляТЧДокумента + "
	|ИЗ
	|	&ВТ_ТЧ КАК Товары";