
&НаКлиенте
Процедура НайтиСтрокуСОшибкой(Команда)

    Если ПустаяСтрока(СтрокаПоиска) Тогда
        ТекущийЭлемент = Элементы.СтрокаПоиска;
        Возврат;
    КонецЕсли;

    ПодключитьОбработчикОжидания("НеизвестныйПоиск", 0.1, Истина); //bad

КонецПроцедуры

&НаКлиенте
Процедура НайтиСтроку(Команда)

    Если ПустаяСтрока(СтрокаПоиска) Тогда
        ТекущийЭлемент = Элементы.СтрокаПоиска;
        Возврат;
    КонецЕсли;

    ПодключитьОбработчикОжидания("ВыполнитьПоиск", 0.1, Истина); //good

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоиск()

    НичегоНеНашли = Ложь;
    ИскатьСтрокуНаСервере(НичегоНеНашли);

    Если НичегоНеНашли Тогда
        Предупреждение(НСтр("ru = 'Строка не найдена'"));
    КонецЕсли;

КонецПроцедуры


ОтключитьОбработчикОжидания("НеизвестныйПоиск"); //bad

ОтключитьОбработчикОжидания("ВыполнитьПоиск"); //good

ПодключитьОбработчикОжидания("НайтиСтроку", 0.1, Истина); //bad

ПодключитьОбработчикОжидания("ВыполнитьПоиск", 0.1, Ложь); //bad

ПодключитьОбработчикОжидания("ВыполнитьПоиск", 0.1, Истина); //good

ПодключитьОбработчикОжидания("ВыполнитьПоиск", 1, Ложь); //good

ПодключитьОбработчикОжидания("ВыполнитьПоиск", 0.1, Переменная); //good