Процедура Тест()

    // Корректные вызовы
    ВызватьИсключение("Текст");
    ВызватьИсключение("Текст", КатегорияОшибки.ОшибкаКонфигурации);
    Raise("Text", ErrorCategory.ConfigurationError);

    // Ошибочные вызовы на русском
    ВызватьИсключение("Текст", КатегорияОшибки.ВсеОшибки);
    ВызватьИсключение("Текст", КатегорияОшибки.ПрочаяОшибка);
    ВызватьИсключение("Текст", КатегорияОшибки . ОшибкаКомпиляцииВстроенногоЯзыка);
    ВызватьИсключение("Текст", КатегорияОшибки.ОшибкаВоВремяВыполненияВстроенногоЯзыка);
    ВызватьИсключение("Текст", КатегорияОшибки.ИсключениеВызванноеИзВстроенногоЯзыка);

    // Ошибочные вызовы на английском
    Raise("Text", ErrorCategory.AllErrors);
    Raise("Text", ErrorCategory.ScriptCompilationError);

КонецПроцедуры
