Процедура Тест()
    Перем КатегорияСети;
    Перем МояВсеОшибкиКоллекция;
    Перем МойОбъект;
    Перем MyAllErrorsVar;

    // Корректные вызовы на русском
    ВызватьИсключение("Текст");
    ВызватьИсключение("Текст", КатегорияОшибки.ОшибкаКонфигурации);
    КатегорияСети = КатегорияОшибки.Сеть;
    ВызватьИсключение("Ошибка", КатегорияСети);
    МояВсеОшибкиКоллекция = КатегорияОшибки.Сеть;
    ВызватьИсключение("Ошибка", МояВсеОшибкиКоллекция);
    ВызватьИсключение();
    ВызватьИсключение("Текст", МойОбъект.ВсеОшибки);

    // Корректные вызовы на английском
    Raise();
    Raise("Text", MyObject.AllErrors);
    Raise("Text", ErrorCategory.ConfigurationError);
    MyAllErrorsVar = ErrorCategory.NetworkError;
    Raise("Error", MyAllErrorsVar);

    // Ошибочные вызовы на русском
    ВызватьИсключение("Текст", КатегорияОшибки.ВсеОшибки);
    ВызватьИсключение("Текст", КатегорияОшибки.ПрочаяОшибка);
    ВызватьИсключение("Текст", КатегорияОшибки.ОшибкаКомпиляцииВстроенногоЯзыка);
    ВызватьИсключение("Текст", КатегорияОшибки.ОшибкаВоВремяВыполненияВстроенногоЯзыка);
    ВызватьИсключение("Текст", КатегорияОшибки.ИсключениеВызванноеИзВстроенногоЯзыка);

    // Ошибочные вызовы на английском
    Raise("Text", ErrorCategory.AllErrors);
    Raise("Text", ErrorCategory.ScriptCompileError);

КонецПроцедуры