Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда

		ЗапросПоКонтрагенту = Новый Запрос("выбрать РаЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
		                                   |	Контрагенты.ЭтоГруппа КАК НеГруппа,
		                                   |	Оплата.Ссылка,
		                                   |	сумма(Оплата.Сумма) КАК СуммаК,
		                                   |	Оплата.Организация КАК ОрганизацияД,
		                                   |	Оплата.Представление,
		                                   |	ПриходТовара.Организация КАК Организация1,
		                                   |	КОЛИЧЕСТВО(РасходТовара.ВерсияДанных) КАК ВерсияДанных,
		                                   |	РасходТовара.Проведен КАК Проведен,
		                                   |	РасходТовара.Склад,
		                                   |	NULL КАК Поле1
		                                   |из
		                                   |	Документ.ПриходТовара КАК ПриходТовара
		                                   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		                                   |			ПРАВОЕ СОЕДИНЕНИЕ Документ.РасходТовара КАК РасходТовара
		                                   |			ПО РасходТовара.Организация = Контрагенты.Ссылка
		                                   |		ПО ПриходТовара.Поставщик = Контрагенты.Ссылка,
		                                   |	Документ.Оплата КАК Оплата
		                                   |Где
		                                   |	Контрагенты.Ссылка = &КонтрагентСсылка
		                                   |	И Контрагенты.Дом = &Дом
		                                   |	И Контрагенты.ВидЦен в(&ВидЦен)
		                                   |	И Контрагенты.Регион В ИЕРАРХИи(&Регион)
		                                   |
		                                   |СГРУППИрОВАТЬ пО гРУППИРУЮЩИМ нАБОРАМ
		                                   |(
		                                   |(	ПриходТовара.Организация,
		                                   |	Оплата.Организация,
		                                   |	Контрагенты.ЭтоГруппа,
		                                   |	РасходТовара.Проведен,
		                                   |	РасходТовара.Склад),
		                                   |(	Оплата.Организация,
		                                   |	Оплата.Представление,
		                                   |	Оплата.Ссылка)
		                                   |
		                                   |)
		                                   |
		                                   |
		                                   |ОБЪЕДИНИТЬ ВСЕ
		                                   |
		                                   |ВЫБРАТЬ
		                                   |	null,
		                                   |	Заказ.Ссылка,
		                                   |	NULL,
		                                   |	NULL,
		                                   |	NULL,
		                                   |	NULL,
		                                   |	NULL,
		                                   |	NULL,
		                                   |	NULL,
		                                   |	NULL
		                                   |ИЗ
		                                   |	Документ.Заказ КАК Заказ
		                                   |
		                                   |уПОРЯДОЧИТЬ пО
		                                   |	НеГруппа вОЗР,
		                                   |	ВерсияДанных уБЫВ
		                                   |иТОГИ
		                                   |	СУММА(СуммаК)
		                                   |пО
		                                   |	оБЩИЕ,
		                                   |	Проведен");
		ЗапросПоКонтрагенту.УстановитьПараметр("КонтрагентСсылка", ДанныеЗаполнения);
		Выборка = ЗапросПоКонтрагенту.Выполнить().Выбрать();
		Если Выборка.Следующий() И Выборка.ЭтоГруппа Тогда
			Возврат;
		КонецЕсли;

		Поставщик = ДанныеЗаполнения.Ссылка;
	КонецЕсли;

КонецПроцедуры
