Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

    // FP на этой строке Литерал = "Выбрать первые 10 полей и засеять пшеницей";

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда

		ЗапросПоКонтрагенту = Новый Запрос("выбрать РаЗРЕШЕННЫЕ рАЗЛИЧНЫЕ пЕРВЫЕ 10 //4 ошибки
		                                   |	Контрагенты.ЭтоГруппа КАК НеГруппа,
		                                   |	Оплата.Ссылка,
		                                   |	сумма(Оплата.Сумма) как СуммаК, // 2 ошибки
		                                   |	Оплата.Организация КАК ОрганизацияД,
		                                   |	Оплата.Представление,
		                                   |	ПриходТовара.Организация КАК Организация1,
		                                   |	КОЛИЧЕсТВО(РасходТовара.ВерсияДанных) КАК ВерсияДанных, // 1 ошибка
		                                   |	РасходТовара.Проведен КАК Проведен,
		                                   |	РасходТовара.Склад,
		                                   |	NULL КАК Поле1
		                                   |из // 1 ошибка
		                                   |	Документ.ПриходТовара КАК ПриходТовара
		                                   |		левое СОЕДИНЕНИе Справочник.Контрагенты КАК Контрагенты // 2 ошибки
		                                   |			ПрАВОЕ СОЕДИНЕНИЕ Документ.РасходТовара КАК РасходТовара // 1 ошибки
		                                   |			По РасходТовара.Организация = Контрагенты.Ссылка
		                                   |		ПО ПриходТовара.Поставщик = Контрагенты.Ссылка,
		                                   |	Документ.Оплата КАК Оплата
		                                   |Где // 1 ошибка
		                                   |	Контрагенты.Ссылка = &КонтрагентСсылка
		                                   |	и Контрагенты.Дом = &Дом
		                                   |	И Контрагенты.ВидЦен в(&ВидЦен) // 1 ошибка
		                                   |	И Контрагенты.Регион В ИЕРАРХИи(&Регион) // 1 ошибка
		                                   |
		                                   |СГРУППИрОВАТЬ пО гРУППИРУЮЩИМ нАБОРАМ // 4 ошибки
		                                   |(
		                                   |(	ПриходТовара.Организация,
		                                   |	Оплата.Организация,
		                                   |	Контрагенты.ЭтоГруппа,
		                                   |	РасходТовара.Проведен,
		                                   |	РасходТовара.Склад),
		                                   |(	Оплата.Организация,
		                                   |	Оплата.Представление,
		                                   |	Оплата.Ссылка)
		                                   |
		                                   |)
		                                   |
		                                   |
		                                   |ОБЪЕДиНИТЬ ВСе // 2 ошибки
		                                   |
		                                   |ВЫБРАТЬ
		                                   |	null, // 1 ошибка
		                                   |	Заказ.Ссылка,
		                                   |	NULL,
		                                   |	NULL,
		                                   |	NULL,
		                                   |	NULL,
		                                   |	NULL,
		                                   |	NULL,
		                                   |	NULL,
		                                   |	NULL
		                                   |ИЗ
		                                   |	Документ.Заказ КАК Заказ
		                                   |
		                                   |уПОРЯДОЧИТЬ пО // 2 ошибки
		                                   |	НеГруппа вОЗР, // 1 ошибка
		                                   |	ВерсияДанных уБЫВ // 1 ошибка
		                                   |иТОГИ // 1 ошибка
		                                   |	СУММА(СуммаК)
		                                   |пО // 1 ошибка
		                                   |	оБЩИЕ, // 1 ошибка
		                                   |	Проведен");
		ЗапросПоКонтрагенту.УстановитьПараметр("КонтрагентСсылка", ДанныеЗаполнения);
		Выборка = ЗапросПоКонтрагенту.Выполнить().Выбрать();
		Если Выборка.Следующий() И Выборка.ЭтоГруппа Тогда
			Возврат;
		КонецЕсли;

		Поставщик = ДанныеЗаполнения.Ссылка;
	ИначеЕсли Ложь // точно такой же запрос
				ЗапросПоКонтрагенту = Новый Запрос("выбрать РаЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
        		                                   |	Контрагенты.ЭтоГруппа КАК НеГруппа,
        		                                   |	Оплата.Ссылка,
        		                                   |	сумма(Оплата.Сумма) КАК СуммаК,
        		                                   |	Оплата.Организация КАК ОрганизацияД,
        		                                   |	Оплата.Представление,
        		                                   |	ПриходТовара.Организация КАК Организация1,
        		                                   |	КОЛИЧЕСТВО(РасходТовара.ВерсияДанных) КАК ВерсияДанных,
        		                                   |	РасходТовара.Проведен КАК Проведен,
        		                                   |	РасходТовара.Склад,
        		                                   |	NULL КАК Поле1
        		                                   |из
        		                                   |	Документ.ПриходТовара КАК ПриходТовара
        		                                   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
        		                                   |			ПРАВОЕ СОЕДИНЕНИЕ Документ.РасходТовара КАК РасходТовара
        		                                   |			ПО РасходТовара.Организация = Контрагенты.Ссылка
        		                                   |		ПО ПриходТовара.Поставщик = Контрагенты.Ссылка,
        		                                   |	Документ.Оплата КАК Оплата
        		                                   |Где
        		                                   |	Контрагенты.Ссылка = &КонтрагентСсылка
        		                                   |	И Контрагенты.Дом = &Дом
        		                                   |	И Контрагенты.ВидЦен в(&ВидЦен)
        		                                   |	И Контрагенты.Регион В ИЕРАРХИи(&Регион)
        		                                   |
        		                                   |СГРУППИрОВАТЬ пО гРУППИРУЮЩИМ нАБОРАМ
        		                                   |(
        		                                   |(	ПриходТовара.Организация,
        		                                   |	Оплата.Организация,
        		                                   |	Контрагенты.ЭтоГруппа,
        		                                   |	РасходТовара.Проведен,
        		                                   |	РасходТовара.Склад),
        		                                   |(	Оплата.Организация,
        		                                   |	Оплата.Представление,
        		                                   |	Оплата.Ссылка)
        		                                   |
        		                                   |)
        		                                   |
        		                                   |
        		                                   |ОБЪЕДИНИТЬ ВСЕ
        		                                   |
        		                                   |ВЫБРАТЬ
        		                                   |	null,
        		                                   |	Заказ.Ссылка,
        		                                   |	NULL,
        		                                   |	NULL,
        		                                   |	NULL,
        		                                   |	NULL,
        		                                   |	NULL,
        		                                   |	NULL,
        		                                   |	NULL,
        		                                   |	NULL
        		                                   |ИЗ
        		                                   |	Документ.Заказ КАК Заказ
        		                                   |
        		                                   |уПОРЯДОЧИТЬ пО
        		                                   |	НеГруппа вОЗР,
        		                                   |	ВерсияДанных уБЫВ
        		                                   |иТОГИ
        		                                   |	СУММА(СуммаК)
        		                                   |пО
        		                                   |	оБЩИЕ,
        		                                   |	Проведен");
        		ЗапросПоКонтрагенту.УстановитьПараметр("КонтрагентСсылка", ДанныеЗаполнения);
        		Выборка = ЗапросПоКонтрагенту.Выполнить().Выбрать();
        		Если Выборка.Следующий() И Выборка.ЭтоГруппа Тогда
        			Возврат;
        		КонецЕсли;

        		Поставщик = ДанныеЗаполнения.Ссылка;
    Иначе
        		ЗапросПоКонтрагенту = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ первые 10
                        		                                   |	Контрагенты.ЭтоГруппа КАК НеГруппа,
                        		                                   |	Оплата.Ссылка,
                        		                                   |	СУММА(Оплата.Сумма) КАК СуммаК,
                        		                                   |	Оплата.Организация КАК ОрганизацияД,
                        		                                   |	Оплата.Представление,
                        		                                   |	ПриходТовара.Организация КАК Организация1,
                        		                                   |	КОЛИЧЕСТВО(РасходТовара.ВерсияДанных) КАК ВерсияДанных,
                        		                                   |	РасходТовара.Проведен КАК Проведен,
                        		                                   |	РасходТовара.Склад,
                        		                                   |	NULL КАК Поле1");

	КонецЕсли;

КонецПроцедуры
