&НаКлиенте
Процедура Команда1(Команда)
    ДополнительныеПараметры = Новый Структура("Результат", 10);
    Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
    ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);

    Сообщить("Введенное количество равно " + ДополнительныеПараметры.Результат); // ошибка, т.к. всегда будет 10
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКоличества1(Число, ДополнительныеПараметры) Экспорт
    Если Число <> Неопределено Тогда
         ДополнительныеПараметры.Результат = Число;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
    Если Условие Тогда
        ДополнительныеПараметры = Новый Структура("Результат", 10);
        Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
        ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
        Сообщить("Введенное количество равно " + ДополнительныеПараметры.Результат); // ошибка, т.к. всегда будет 10
    Иначе
        ДругаяВетка();
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Команда3(Команда)
    Если Условие Тогда
        ДополнительныеПараметры = Новый Структура("Результат", 10);
        Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
        ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
    Иначе
        ДругаяВетка(); // не ошибка
    КонецЕсли;

    Сообщить("Введенное количество равно " + ДополнительныеПараметры.Результат); // ошибка, т.к. всегда будет 10
КонецПроцедуры

&НаКлиенте
Процедура Команда4(Команда)
    Если Условие Тогда
        ДополнительныеПараметры = Новый Структура("Результат", 10);
        Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
        Если Условие Тогда
            ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
        КонецЕсли;
    Иначе
        ДругаяВетка(); // не ошибка
    КонецЕсли;

    Сообщить("Введенное количество равно " + ДополнительныеПараметры.Результат); // ошибка, т.к. всегда будет 10
КонецПроцедуры

&НаКлиенте
Процедура КодПослеКонецЕсли(Команда)
    Если Условие Тогда
        ДополнительныеПараметры = Новый Структура("Результат", 10);
        Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
        Если Условие Тогда
            ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
        КонецЕсли;
        Сообщить("Введенное количество равно " + ДополнительныеПараметры.Результат); // ошибка, т.к. всегда будет 10
    Иначе
        ДругаяВетка(); // не ошибка
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КодПослеЦикла(Команда)
    Если Условие Тогда
        ДополнительныеПараметры = Новый Структура("Результат", 10);
        Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
        Пока Условие Цикл
            ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2); // ошибка
        КонецЦикла;
        Сообщить("Введенное количество равно " + ДополнительныеПараметры.Результат); // ошибка, т.к. всегда будет 10
    Иначе
        ДругаяВетка(); // не ошибка
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КодПослеЦиклаДляКаждого(Команда)
    Если Условие Тогда
        ДополнительныеПараметры = Новый Структура("Результат", 10);
        Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
        Для Каждого Элемент Из Коллекция Цикл
            ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
        КонецЦикла;
        Сообщить("Введенное количество равно " + ДополнительныеПараметры.Результат); // ошибка, т.к. всегда будет 10
    Иначе
        ДругаяВетка(); // не ошибка
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КодПослеЦиклаДляПо(Команда)
    Если Условие Тогда
        ДополнительныеПараметры = Новый Структура("Результат", 10);
        Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
        Для Счетчик = 1 По 10 Цикл
            ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
        КонецЦикла;
        Сообщить("Введенное количество равно " + ДополнительныеПараметры.Результат); // ошибка, т.к. всегда будет 10
    Иначе
        ДругаяВетка(); // не ошибка
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КодПослеПопытки(Команда)
    Если Условие Тогда
        ДополнительныеПараметры = Новый Структура("Результат", 10);
        Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
        Попытка
            ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
        Исключение
            КодВПопытке = 1;
        КонецПопытки;
        Сообщить("Введенное количество равно " + ДополнительныеПараметры.Результат); // ошибка, т.к. всегда будет 10
    Иначе
        ДругаяВетка(); // не ошибка
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура БезОшибок1(Команда)
    ПоказатьВводЧисла(Оповещение, 1); //не ошибка
    // комментарий
КонецПроцедуры

&НаКлиенте
Процедура БезОшибок2(Команда)
    Если Условие Тогда
        ДополнительныеПараметры = Новый Структура("Результат", 10);
        Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
        ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
    Иначе
        ДругаяВетка(); // не ошибка
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура БезОшибок3(Команда)
    Если Условие Тогда
        ДополнительныеПараметры = Новый Структура("Результат", 10);
        Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
        Если Условие Тогда
            ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
        КонецЕсли;
    Иначе
        ДругаяВетка(); // не ошибка
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура БезОшибокПослеКонецЕсли(Команда)
    Если Условие Тогда
        ДополнительныеПараметры = Новый Структура("Результат", 10);
        Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
        Если Условие Тогда
            ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
        КонецЕсли;
    Иначе
        ДругаяВетка(); // не ошибка
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура БезОшибокПослеЦикла(Команда)
    Если Условие Тогда
        ДополнительныеПараметры = Новый Структура("Результат", 10);
        Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
        Пока Условие Цикл
            ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
        КонецЦикла;
    Иначе
        ДругаяВетка(); // не ошибка
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура БезОшибокПослеЦиклаДляКаждого(Команда)
    Если Условие Тогда
        ДополнительныеПараметры = Новый Структура("Результат", 10);
        Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
        Для Каждого Элемент Из Коллекция Цикл
            ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
        КонецЦикла;
    Иначе
        ДругаяВетка(); // не ошибка
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура БезОшибокПослеЦиклаДляПо(Команда)
    Если Условие Тогда
        ДополнительныеПараметры = Новый Структура("Результат", 10);
        Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
        Для Счетчик = 1 По 10 Цикл
            ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
        КонецЦикла;
    Иначе
        ДругаяВетка(); // не ошибка
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура БезОшибокПослеПопытки(Команда)
    Если Условие Тогда
        ДополнительныеПараметры = Новый Структура("Результат", 10);
        Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
        Попытка
            ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
        Исключение
            КодВПопытке = 1;
        КонецПопытки;
    Иначе
        ДругаяВетка(); // не ошибка
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВозвратПослеАсинхрона(Команда)
    Если Условие Тогда
        ДополнительныеПараметры = Новый Структура("Результат", 10);
        Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
        ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
        Возврат; // не ошибка
    КонецЕсли;

    КодВКонцеМетода(); // не ошибка

КонецПроцедуры

&НаКлиенте
Процедура ПрерватьАсинхрона(Команда)
    Если Условие Тогда
        Для Каждого Элемент Из Коллекция Цикл
            ДополнительныеПараметры = Новый Структура("Результат", 10);
            Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
            ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
            Прервать; // не ошибка
        КонецЦикла;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрерватьПослеАсинхронаИКодПослеЦикла(Команда)
    Если Условие Тогда
        Для Каждого Элемент Из Коллекция Цикл
            ДополнительныеПараметры = Новый Структура("Результат", 10);
            Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
            ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);
            Прервать; // не ошибка
        КонецЦикла;
    КонецЕсли;

    КодПослеЦикла(); // ошибка
КонецПроцедуры

&НаКлиенте
Процедура ДваВызоваАсинхронаВоВзаимоисключащихВетках(Команда)
    ДополнительныеПараметры = Новый Структура("Результат", 10);
    Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества1", ЭтотОбъект);
    Если Условие Тогда
        ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2); // не ошибка
    Иначе
        ПоказатьВводЧисла(Оповещение, 1, "Введите количество", ДополнительныеПараметры.Результат, 2);  // не ошибка
    КонецЕсли;

КонецПроцедуры
