// Процедура Тест()
//   // Тут кааой-то код
// КонецПроцедуры

// Если Услови() Тогда
//   Действие()
// КонецЕсли;

// Если Условие() Тогда // Тут исключение. Нужно придумать как отлавливат такие случаи.

// Нормальный комментарий

// Пример: Запрос = Новый Запрос();

//// Вот такое тоже не распарситься, а хотелось бы отловить
// Запрос = Новый Запрос();
// Какой-то комментарий который не попал под общее комментирование
// Запрос = 2 + 3;

// ОбщегоНазначения.СвойствоСтруктуры(Стр);

// СтрСоединить(Строки, ", ");