Функция СерверныйМодульМенеджера(Имя)
	ОбъектНайден = Ложь;

	ЧастиИмени = СтрРазделить(Имя, ".");
	Если ЧастиИмени.Количество() = 2 Тогда

		ИмяВида = ВРег(ЧастиИмени[0]);
		ИмяОбъекта = ЧастиИмени[1];

		Если ИмяВида = ВРег("Константы") Тогда
			Если Метаданные.Константы.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("РегистрыСведений") Тогда
			Если Метаданные.РегистрыСведений.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		Иначе
			ОбъектНайден = Ложь;
		КонецЕсли;
	КонецЕсли;

    Для Ит = 0 По 100 Цикл
        Если Ит % 2 = 0 Тогда
            Сообщить("Чет");
        ИначеЕсли Ит % 2 > 0 Тогда
            Сообщить("Нечет");
        Иначе
            Сообщить("Хм...");
        КонецЕсли;
    КонецЦикла;

    Для Ит = 101 По 1000 Цикл
        Если Ит % 3 = 0 Тогда
            Сообщить("Не остатка");
        ИначеЕсли Ит % 3 > 0 Тогда
            Сообщить("Есть остаток");
        ИначеЕсли Ит % 3 < 0 Тогда
            Сообщить("Так не бывает");
        Иначе
            Сообщить("Хм...");
        КонецЕсли;
    КонецЦикла;

	Если Не ОбъектНайден Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Объект метаданных ""%1"" не найден,
			           |либо для него не поддерживается получение модуля менеджера.'"),
			Имя);
	КонецЕсли;
	УстановитьБезопасныйРежим(Истина);
	Модуль = Вычислить(Имя);
	F = ?(Условие, ИСТИНА, НЕОПРЕДЕЛЕНО);
	А = ?(Условие, ИСТИНА, ?(Условие2, ЛОЖЬ, НЕОПРЕДЕЛЕНО));
	M = ИСТИНА ИЛИ 7;
	Возврат Модуль;
КонецФункции                                                                            // итог 21

Процедура СЦиклами()
    Для Ит = 0 По 4 Цикл
        Если Ит = 1 Тогда
            Сообщить(1);
            Прервать;
        Иначе
            Сообщить(2);
        КонецЕсли;
        Если Истина ИЛИ Ложь Тогда
            Сообщить(3);
        КонецЕсли;
        Для Каждого Строка Из Строки Цикл
            Если 1 > 0 Тогда
                Возврат;
            КонецЕсли;
            Продолжить;
        КонецЦикла;
    КонецЦикла;
    Перейти ~Метка;
    ~Метка:
КонецПроцедуры                                                                          // итог 9

Если Истина Тогда
КонецЕсли;

Попытка
    Действие();
Исключение
    Действие2();
КонецПопытки;
                                                                                        // итог 2
