Процедура Метод1()
    Значение = Новый File(ИмяФайла); // есть ошибка
    Значение = Новый xBase("C:\temp.dbf"); // есть ошибка
    Значение = Новый HTMLWriter; // есть ошибка
    Значение = Новый HTMLReader; // есть ошибка
    Значение = Новый FastInfosetReader; // есть ошибка
    Значение = Новый FastInfosetWriter; // есть ошибка
    Значение = Новый XSLTransform; // есть ошибка
    Значение = Новый ZipFileWriter(ИмяФайла); // есть ошибка
    Значение = Новый ZipFileReader(ИмяФайла); // есть ошибка
    Значение = Новый TextReader(ИмяФайла); // есть ошибка
    Значение = Новый TextWriter(ИмяФайла); // есть ошибка
    Значение = Новый TextExtraction(ИмяФайла); // есть ошибка
    Значение = Новый BinaryData(ИмяФайла); // есть ошибка
    Значение = Новый FileStream(ИмяФайла, РежимОткрытия); // есть ошибка
КонецПроцедуры

&НаСервере
Процедура Метод2()
    Значение = Новый xBase("C:\temp.dbf"); // есть ошибка
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Метод3()
    Значение = Новый xBase; // есть ошибка
КонецПроцедуры

&НаКлиенте
Процедура Метод4()
    ЗначениеВФайл("C:\Temp\PersonalData.txt", ЛичныеДанные); // есть ошибка
    КопироватьФайл("C:\Temp\Order.htm", "C:\My Documents\Order.htm"); // есть ошибка

    МассивИмен = Новый Массив();
    МассивИмен.Добавить("C:\Windows\Temp\Presentation.ppt.1");
    ОбъединитьФайлы(МассивИмен, "C:\Windows\Temp\Presentation.ppt"); // есть ошибка

    ПереместитьФайл("C:\Temp\Order.htm", "C:\My Documents\Order.htm"); // есть ошибка
    РазделитьФайл("C:\Windows\Temp\Presentation.ppt", 1024 * 1024 ); // есть ошибка
    СоздатьКаталог("C:\Temp"); // есть ошибка
    УдалитьФайлы("C:\temp\Works"); // есть ошибка
КонецПроцедуры
