Функция Проверка()

    Перем1 = Перем1;

    Если Перем2 <> Перем2 Тогда

        Возврат Перем3 > Перем3;

    КонецЕсли;

    Перем4 = Перем5 + Перем5;  // Нормально
    Перем6 = Перем7 / Перем7;

    Если (Перем8 + Перем9 + Перем10) = (Перем8 + Перем9 + Перем10) Тогда

        Возврат Перем11 <> Перем11;

    КонецЕсли;

    Если УсловиеВыполняется() ИЛИ УсловиеВыполняется() ИЛИ УсловиеВтороеВыполняется() Тогда

        Возврат Перем12 < Перем12;

    КонецЕсли;

    Если (Перем13 = 0) И (Перем13 = 0) Тогда

        Возврат Перем14 И Перем15 И Перем15;

    КонецЕсли;

    Результат = Перем16 - Перем16;
    Результат = Результат * Результат; // Нормально
    Наименование = "Начало" + " " + "середина" + " " + "конец";
    Возврат Перем18 И Перем19 ИЛИ Перем18 И Перем20; // Нормально

КонецФункции

Б = 0;
С = (А = 1) И (Б = 1) ИЛИ (А = 1) И (Б = 1);
Если А = 1 ИЛИ А = 1 Тогда
    Б = 1;
ИначеЕсли 1 = А ИЛИ А = 1 Тогда // use TransitiveIgnoringComparer in diagnostic (slower)
    Б = 11;
ИначеЕсли А = 1 ИЛИ (А = 1) Тогда
    Б = 12;
ИначеЕсли (А = 1) И (Б = 1) ИЛИ ((А = 1) И (Б = 1) )Тогда
    Б = 13;
ИначеЕсли (1 = А) ИЛИ (А = 1) Тогда // use TransitiveIgnoringComparer in diagnostic (slower)
    Б = 14;
КонецЕсли;

Б = А = 12 ИЛИ А = 13 ИЛИ А = 12;
Б = А = 12 ИЛИ А = 13 ИЛИ А = 14 ИЛИ А = 12;

// тут _должна быть_ ошибка, т.к. часть выражения внутри области
// совпадает с частью выражения после области
Результат = ТипЗначения.СодержитТип(Тип("Тип1"))
#Область НоваяОбласть
ИЛИ ТипЗначения.СодержитТип(Тип("Тип2"))
#КонецОбласти
ИЛИ ТипЗначения.СодержитТип(Тип("Тип2"));

// тут ошибка
Результат = Истина
#Область ЕщеОднаОбласть
ИЛИ Истина;
#КонецОбласти

// тут ошибка
Результат = Истина
#Если ВебКлиент Тогда
ИЛИ Ложь
#Иначе
ИЛИ ЗначениеВыражения()
#КонецЕсли
ИЛИ Истина;

// нет ошибки
Результат = ЗначениеВыражения()
#Если ВебКлиент Тогда
ИЛИ Ложь
#Иначе
ИЛИ Отказ
#КонецЕсли
ИЛИ Истина;
