
// Warn
Если ИдентификаторОбъекта = "АнализСубконто"
    ИЛИ ИдентификаторОбъекта = "АнализСчета"
    ИЛИ ИдентификаторОбъекта = "ОборотноСальдоваяВедомость"
    ИЛИ ИдентификаторОбъекта = "ОборотноСальдоваяВедомостьПоСчету"
    ИЛИ ИдентификаторОбъекта = "ОборотыМеждуСубконто"
    ИЛИ ИдентификаторОбъекта = "ОборотыСчета"
    ИЛИ ИдентификаторОбъекта = "СводныеПроводки"
    ИЛИ ИдентификаторОбъекта = "ГлавнаяКнига"
    ИЛИ ИдентификаторОбъекта = "ШахматнаяВедомость" Тогда

    ПараметрыРасшифровки.Вставить("ОткрытьОбъект", Ложь);

    ЕстьПоказатель  = Ложь;
    ЕстьКорЗначение = Ложь;
    ЕстьСчет        = Истина;
    Счет            = Неопределено;
    ПервыйЭлемент   = Неопределено;

КонецЕсли;

// Pass:
Если ИдентификаторОбъекта = "АнализСубконто"
    ИЛИ ИдентификаторОбъекта = "АнализСчета" Тогда

    // Warn
	Если ИдентификаторОбъекта = "ОборотыМеждуСубконто"
             ИЛИ ИдентификаторОбъекта = "ОборотыСчета"
             ИЛИ ИдентификаторОбъекта = "СводныеПроводки"
             ИЛИ ИдентификаторОбъекта = "ШахматнаяВедомость" Тогда

        ПараметрыРасшифровки.Вставить("ОткрытьОбъект", Ложь);

    КонецЕсли;

    ЕстьПоказатель  = Ложь;
    ЕстьКорЗначение = Ложь;
    ЕстьСчет        = Истина;
    Счет            = Неопределено;
    ПервыйЭлемент   = Неопределено;

КонецЕсли;

// Warn
Если ИдентификаторОбъекта = "ИД1"
    ИЛИ ИдентификаторОбъекта = "ИД2"
    ИЛИ ИдентификаторОбъекта = "ИД3"
    ИЛИ ИдентификаторОбъекта = "ИД4" Тогда
    Возврат 1;
// Warn
ИначеЕсли ИдентификаторОбъекта = "ИД5"
    ИЛИ ИдентификаторОбъекта = "ИД6"
    ИЛИ ИдентификаторОбъекта = "ИД7"
    ИЛИ ИдентификаторОбъекта = "ИД8"
    ИЛИ ИдентификаторОбъекта = "ИД9"
    ИЛИ ИдентификаторОбъекта = "ИД10"
    ИЛИ ИдентификаторОбъекта = "ИД10" Тогда
    Возврат 2;
Иначе
    Возврат 3;
КонецЕсли;


