// минусы с ошибками
СреднееТире = "–";
ЦифровоеТире = "‒";
ДлинноеТире = "—";
ГоризонтальнаяЛиния = "―";
НеправильныйМинус = "−";
// Мягкий перенос в комментарии ­

// минус без ошибки
ПравильныйДефисМинус = "-";

// ошибочные неразрывные пробелы
// В этом комментарии только НПП

Строка = "А" + " " + "И";

//в строке ниже неразрывный пробел
 
// минусы с ошибками
//СреднееТире = "
–;
//ЦифровоеТире = "
‒;
//ДлинноеТире = "
—;
//ГоризонтальнаяЛиния = "
―;
//НеправильныйМинус = "
−;
//конец файла
