Процедура Тест()
    ДоступРазрешен = РольДоступна("НужнаяРоль");
    ПР = ПривилегированныйРежим();
    Если ДоступРазрешен ИЛИ ПР Тогда // Нет срабатывания. Есть проверка на привилегированный режим
    КонецЕсли;
КонецПроцедуры

Процедура Тест()
    Если РольДоступна("НужнаяРоль") ИЛИ ПривилегированныйРежим() Тогда // Нет срабатывания. Есть проверка на привилегированный режим
    КонецЕсли;
КонецПроцедуры

Процедура Тест()
    ДоступРазрешен = РольДоступна("НужнаяРоль");
    Если ДоступРазрешен ИЛИ ПривилегированныйРежим() Тогда // Нет срабатывания. Есть проверка на привилегированный режим
    КонецЕсли;
КонецПроцедуры

Процедура Тест()
    ПР = ПривилегированныйРежим();
    Если РольДоступна("НужнаяРоль") ИЛИ ПР Тогда // Нет срабатывания. Есть проверка на привилегированный режим
    КонецЕсли;
КонецПроцедуры

Процедура Тест()
    ДоступРазрешен = РольДоступна("НужнаяРоль");
    ДоступРазрешен = ПР();
    Если ДоступРазрешен Тогда // Нет срабатывания
    КонецЕсли;
КонецПроцедуры

Процедура Тест2()
    Если РольДоступна("НужнаяРоль") Тогда // Срабатывание
    КонецЕсли;
КонецПроцедуры

Процедура Тест3()
    ДоступРазрешен = РольДоступна("НужнаяРоль");
    Если ДоступРазрешен Тогда // Срабатывание
    КонецЕсли;
КонецПроцедуры