// Табличная часть, названная как виртуальная таблица регистра, - не виртуальная таблица.

Функция ТЧСправочникаВСоединении()

    Возврат "ВЫБРАТЬ
    |    Партии.Ссылка КАК Ссылка,
    |    Т.Количество КАК Количество
    |ИЗ
    |    Справочник.Партии КАК Партии
    |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партии.Остатки КАК Т
    |        ПО Партии.Ссылка = Т.Ссылка";

КонецФункции

Функция ВиртуальнаяТаблицаВСоединении()

    Возврат "ВЫБРАТЬ
    |    Партии.Ссылка КАК Ссылка,
    |    Т.КоличествоОстаток КАК Количество
    |ИЗ
    |    Справочник.Партии КАК Партии
    |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК Т
    |        ПО Партии.Ссылка = Т.Партия";

КонецФункции
