// Соединение с виртуальной таблицей каждого вида.
Функция ВидыВиртуальныхТаблиц()

    Возврат "ВЫБРАТЬ
    |    Т.Ссылка КАК Ссылка
    |ИЗ
    |    Справочник.Справочник1 КАК Т
    |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Курсы.СрезПервых(&Период) КАК ВТ1
    |        ПО ИСТИНА
    |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&Период) КАК ВТ2
    |        ПО ИСТИНА
    |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(&Начало, &Конец) КАК ВТ3
    |        ПО ИСТИНА
    |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&Начало, &Конец) КАК ВТ4
    |        ПО ИСТИНА
    |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(&Начало, &Конец) КАК ВТ5
    |        ПО ИСТИНА
    |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&Начало, &Конец) КАК ВТ6
    |        ПО ИСТИНА
    |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления.ФактическийПериодДействия(Сотрудник = &Сотрудник) КАК ВТ7
    |        ПО ИСТИНА
    |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления.ДанныеГрафика(Сотрудник = &Сотрудник) КАК ВТ8
    |        ПО ИСТИНА
    |        ЛЕВОЕ СОЕДИНЕНИЕ Последовательность.Взаиморасчеты.Границы(Контрагент = &Контрагент) КАК ВТ9
    |        ПО ИСТИНА
    |        ЛЕВОЕ СОЕДИНЕНИЕ Задача.Поручение.ЗадачиПоИсполнителю(&Исполнитель) КАК ВТ10
    |        ПО ИСТИНА
    |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Субконто КАК ВТ11
    |        ПО ИСТИНА";

КонецФункции
