Перем Namе;                 // <- ошибка

Процедура ВИмениEnglish()   // <- ошибка
    Перем а;
    Перем ии, вв;
    перем ССС, ccc, сcс;    // <- ошибка в последнем имени
    Переменная = 1;
КонецПроцедуры

Функция InNameРусский()     // <- ошибка
    Перем тьфу;
    Перем name;
    перем Аg;               // <- ошибка
    перем _Аg09;            // <- ошибка
    Переменная = "engру";   // <- ошибки нет
    ComОбъект2 = _Аg09;     // <- ошибка
    _3C_omRRRО_5__бъект = 1;// <- ошибка
КонецФункции

&Аnotation                  // <- ошибка
Функция __t1est()           // <- ошибки нет
КонецФункции

&Аннотация(Парaметр = 1)    // <- ошибка в параметре
Функция _тест12()           // <- ошибки нет
КонецФункции

#Область Regiоn             // <- ошибка
#КонецОбласти

Процедура Тест12(ПараметрY, Знач ParamЫ) // <- ошибка в именах параметров
    Перейти ~Lаbell;        // <- ошибка
КонецПроцедуры