А = 0;

А = "фффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффф";
А = "ффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффф";
А = "фффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффф";
А = "ффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффф";

// Просто коммент
// Длинный ОченьДлинный ОченьОченьДлинный Коооооооооооооооооооооомммммммммеееееееееееееееееееенннннтт Просто такооооййй Коммент

    А = Код + Код + Код; // Просто коммент
    А = Код + Код + Коооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооод; // Длииииииииинныййййй коммент
    А = Код + Код + Кооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооодддддддддддддддддддод; // коммент

Запрос.Текст =
    "ВЫБРАТЬ
    | Данные.Поле1,
    | Данные.ОоооооооооооооооооооооооооооооооочеееееееееннннннннннннннннннннььььььььДлинннннннннннннннннннннннннннноооооееееПоле2,
    | Данные.Поле3
    |ИЗ
    | Источник КАК Данные
    |ГДЕ
    | Данные.ПолеУсловия = &ООООООООООООООООООООООООООООООЧЧЧЧЧЧЧЧЧЧЧЧЧЧЧЧЕЕЕЕЕЕЕЕЕЕЕЕЕЕЕЕЕЕНННННННННННЬЬЬЬЬЬЬЬЬДДДДДДДДЛЛЛЛЛЛЛ"
    ;

    Запрос.Текст =
        "ВЫБРАТЬ
        | Данные.Поле1,
        | Данные.ОоооооооооооооооооооооооооооооооочеееееееееннннннннннннннннннннььььььььДлинннннннннннннннннннннннннннноооооееееПоле2,
        | Данные.Поле3
        |ИЗ
        | Источник КАК Данные
        |ГДЕ
        | Данные.ПолеУсловия = &ООООООООООООООООООООООООООООООЧЧЧЧЧЧЧЧЧЧЧЧЧЧЧЧЕЕЕЕЕЕЕЕЕЕЕЕЕЕЕЕЕЕНННННННННННЬЬЬЬЬЬЬЬЬДДДДДДДДЛЛЛЛЛЛЛ";


// Длинный ОченьДлинный ОченьОченьДлинный Коооооооооооооооооооооомммммммммеееееееееееееееееееенннннтт Просто такооооййй Коммент
А = 0;

ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
НСтр("ru = 'Процедуре ЗаполнитьРеквизитСпособОтображенияПодсказки не удалось обработать некоторые вопросы шаблона анкеты (пропущены): %1'"),
ПроблемныхОбъектов);

ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
    Длинныыыыыыыыыыййййй.Метттттттттттттттооооооооооооооодддддддддддд(СПааааааааааааааааррррррррааааааам, Мееееетттттттррррррррраааааамммииии),
	ПроблемныхОбъектов);

Длинныыыыыыыыыыййййй.Метттттттттттттттооооооооооооооодддддддддддд(СПааааааааааааааааррррррррааааааам, Мееееетттттттррррррррраааааамммииии);

Длинныыыыыыыыыыййййй.Метттттттттттттттооооооооооооооодддддддддддд(СПааааааааааааааааррррррррааааааам, Мееееетттттттррррррррраааааамммииии)
;

ТекстСообщения = НСтр("ru = 'Процедуре ЗаполнитьРеквизитСпособОтображенияПодсказки не удалось обработать некоторые вопросы шаблона анкеты (пропущены): %1'", ПроблемныхОбъектов);

// Описание
// Парамеры:
//  Параметр1 - ТипПараметра - Описание ооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооочччччччччччччччччччччччччччччччччччччччень длиннннннннннннное
Процедура Тест(Параметр1)
КонецПроцедуры

// Описание                      длинное                                  очень                                           очень            вввввв
// Парамеры:
//  Параметр1 - ТипПараметра - Описание
Процедура Тест2(Параметр1)
КонецПроцедуры
