А = 0;

А = "фффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффф";
А = "ффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффф";
А = "фффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффф";
А = "ффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффффф";

// Просто коммент
// Длинный ОченьДлинный ОченьОченьДлинный Коооооооооооооооооооооомммммммммеееееееееееееееееееенннннтт Просто такооооййй Коммент

    А = Код + Код + Код; // Просто коммент
    А = Код + Код + Коооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооод; // Длииииииииинныййййй коммент
    А = Код + Код + Кооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооодддддддддддддддддддод; // коммент

Запрос.Текст =
    "ВЫБРАТЬ
    | Данные.Поле1,
    | Данные.ОоооооооооооооооооооооооооооооооочеееееееееннннннннннннннннннннььььььььДлинннннннннннннннннннннннннннноооооееееПоле2,
    | Данные.Поле3
    |ИЗ
    | Источник КАК Данные
    |ГДЕ
    | Данные.ПолеУсловия = &ООООООООООООООООООООООООООООООЧЧЧЧЧЧЧЧЧЧЧЧЧЧЧЧЕЕЕЕЕЕЕЕЕЕЕЕЕЕЕЕЕЕНННННННННННЬЬЬЬЬЬЬЬЬДДДДДДДДЛЛЛЛЛЛЛ"
    ;

    Запрос.Текст =
        "ВЫБРАТЬ
        | Данные.Поле1,
        | Данные.ОоооооооооооооооооооооооооооооооочеееееееееннннннннннннннннннннььььььььДлинннннннннннннннннннннннннннноооооееееПоле2,
        | Данные.Поле3
        |ИЗ
        | Источник КАК Данные
        |ГДЕ
        | Данные.ПолеУсловия = &ООООООООООООООООООООООООООООООЧЧЧЧЧЧЧЧЧЧЧЧЧЧЧЧЕЕЕЕЕЕЕЕЕЕЕЕЕЕЕЕЕЕНННННННННННЬЬЬЬЬЬЬЬЬДДДДДДДДЛЛЛЛЛЛЛ";
