Процедура ПолучиттьРеализациюТовара()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	     "ВЫБРАТЬ
         |	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
         |	РеализацияТоваровУслугТовары.Сумма > 0
         |		ИЛИ РеализацияТоваровУслугТовары.СуммаСНДС > 0 КАК НенулеваяСумма
         |ИЗ
         |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
         |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
         |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры //Тест работы на вложенном соединении
         |			ПО СправочникНоменклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
         |				И (СправочникНоменклатура.СрокГодности > 1
         |					ИЛИ СправочникНоменклатура.СрокГодности < 10)
         |				И (СправочникНоменклатура.СрокГодности > 1
         |					ИЛИ ВидыНоменклатуры.ЗапрещенаПродажаЧерезПатент = ИСТИНА) //Ошибка
         |		ПО РеализацияТоваровУслугТовары.Номенклатура = СправочникНоменклатура.Ссылка
         |			И (СправочникНоменклатура.КодПоКВПД = ""1122""
         |				ИЛИ СправочникНоменклатура.КодПоКВПД = ""1133"")
         |			И (СправочникНоменклатура.Артикул = ""0011""
         |				ИЛИ СправочникНоменклатура.КодТРУ = ""0111"") //Ошибка
         |			И (СправочникНоменклатура.Артикул = ""0022""
         |				ИЛИ СправочникНоменклатура.КодТРУ = ""0222""
         |				ИЛИ СправочникНоменклатура.КодПоКВПД = ""2233"") //Ошибка (2 срабатывания)
         |			И (СправочникНоменклатура.КодПоКВПД = ""1122""
         |				ИЛИ СправочникНоменклатура.КодПоКВПД = ""1133""
         |				ИЛИ СправочникНоменклатура.КодТРУ = ""0222"")"; //Ошибка (2 срабатывания)

	РезультатЗапроса = Запрос.Выполнить();		
	
КонецПроцедуры

//Диагностика должна зафиксировать ошибку
// при использовании оператора "ИЛИ" в условии над различными полями таблицы.
// Если оператор "ИЛИ" в условии над одним полем, то ошибка не фиксируется,
// так как планировщик запросов имеет возможность преобразовывать такое условие в IN, тем самым оптимизируя.

//Итоговое количество срабатываний - 6.