Процедура Тест1()

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ Таблица.Наименование
    |ИЗ Справочник.Товары КАК Таблица
    |ГДЕ
    |   Истина ИЛИ Цена = 2"; //<-- ошибка

КонецПроцедуры

Процедура Тест2()

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ Таблица.Наименование
    |ИЗ Справочник.Товары КАК Таблица
    |ГДЕ
    |   Таблица.Поле1 = &Значение1
    |   ИЛИ Таблица.Поле2 = &Значение2"; //<-- ошибка

КонецПроцедуры

Процедура Тест4()

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ Таблица.Наименование
    |ИЗ Справочник.Товары КАК Таблица
    |ГДЕ
    |   Таблица.Поле1 = &Значение1
    |   И (Таблица.Поле2 = &Значение2 ИЛИ Таблица.Поле3 = &Значение3)"; //<-- ошибка

КонецПроцедуры

Процедура Тест5()

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ Таблица.Наименование
    |ИЗ Справочник.Товары КАК Таблица
    |ГДЕ
    |   Таблица.Поле1 = &Значение1
    |   ИЛИ //<-- ошибка
    |   (Таблица.Поле2 = &Значение2 ИЛИ Таблица.Поле3 = &Значение3)"; //<-- ошибка

КонецПроцедуры

Процедура Тест6()

    Запрос = Новый Запрос;
    Запрос.Текст =
    "Выбрать Истина КАК Поле1
    |ИЗ Документ.РеализацияТоваровУслуг КАК Т
    |Где Истина
    |И Т.Ссылка В
    |    (Выбрать СС.Ссылка
    |     Из Справочник.Справочник2 КАК СС
    |     Где Истина Или Ложь)"; //<-- ошибка

КонецПроцедуры

Процедура Тест7()

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ ВЫБОР КОГДА Таблица.Флаг ИЛИ Истина Тогда Истина Иначе Ложь КОНЕЦ
    |ИЗ Справочник.Товары КАК Таблица
    |РегистрНакопления.Склады.Остатки(, ) КАК Т
    |По Истина ИЛИ Таблица.Поле1 = Т.Товар
    |УПОРЯДОЧИТЬ ПО
    |   ВЫБОР КОГДА Таблица.Флаг ИЛИ Истина Тогда Истина Иначе Ложь КОНЕЦ";

КонецПроцедуры
