Функция МаксимальнаяДата() Экспорт
	//Возврат '39991231235959'; // TODO
КонецФункции

Функция МаксимальнаяДатаПриПродолжении()
	//Возврат '39990101000000'; // TODO
КонецФункции

Процедура Тест3()

День = Дата("00020101");
День = Дата("00020101") + Шаг; // ошибка
День = Дата("00020101121314") + Шаг; // ошибка
День = '00010102' + Шаг; // ошибка
Пока Сейчас < '12340101' Цикл // ошибка
    Сейчас = Сейчас + Шаг;
КонецЦикла;
Конец = '12340101';
Пока Сейчас < Конец Цикл
    Сейчас = Сейчас + Шаг;
КонецЦикла;
День = Дата("00010101") + Шаг; // исключение
День = '0001-01why not?01' + Шаг; // исключение
День = '0001-01why not?02' + Шаг; // ошибка

ИменаПараметров = СтроковыеФункции.РазложитьСтрокуВМассивПодстрок(ИмяПараметра, , Дата("00050101")); // замечание
ИменаПараметров = СтроковыеФункции.РазложитьСтрокуВМассивПодстрок(ИмяПараметра, "00050101", "00050101"); // замечание
Настройки = Настройки('12350101'); // замечание
Настройки.Свойство("00020501121314", ЗначениеЕдиничногоПараметра); // замечание
Выполнить("00020501121314" + '12350101'); // замечание

ОтборЭлемента.ПравоеЗначение = Новый СтандартнаяДатаНачала(Дата('19800101000000'));

Значение = Метод("%1/%2");
Если Условие Тогда
    ВызватьИсключение "Не указано значение константы ХХХ";
КонецЕсли;

УИДЗамера = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
ПосторонниеСимволы = СтрСоединить(СтрРазделить(СтрокаСЧислом, "0123456789", Ложь), "");
Объект.GetStringValue("2147483649","Software\Buhphone","ProgramPath", Значение);
НедопустимыеСимволы = НедопустимыеСимволыВСтроке(СтрАдрес.АдресСервера,
    "0123456789aAbBcCdDeEfFgGhHiIjJkKlLmMnNoOpPqQrRsStTuUvVwWxXyYzZ_-.:*?");
НедопустимыеСимволы = НедопустимыеСимволы + "1234567890 ";

Дата = Метод("04937803-5dba-11df-a1d4-005056c00008");
Набор.Идентификатор = Новый УникальныйИдентификатор("70425541-23e3-4e5a-8bd3-9587cc949dfa");

НецифровыеСимволы = СтрСоединить(СтрРазделить(Значение, "1234567890,."));
Результат = Сред("0123456789abcdef", ОстатокОтДеления + 1, 1) + Результат;

Результат.Добавить(СтрокаОбъектаАдресации("10100000", НСтр("ru = 'Почтовый индекс'")));
КодСтроки = КодРодителя + Прав("00000000" + Формат(Счетчик, "ЧГ="), ЧислоЦифр);
КлючНаборовСвойств = НачалоКлюча + Лев(КлючНазначения + "00000000000000000000000000000000", 32);

КодыКЛАДР.Регион = Лев(КодКЛАДР, 2) + "00000000000";
КодыКЛАДР.Район = Лев(КодКЛАДР, 5) + "00000000";

//'39990202'
//'39991231235959'
//'39990101000000'

КонецПроцедуры