&НаКлиенте
Процедура НаКлиенте()
    СерверныйМодуль.Цель(); // ошибка: модуль без вызова сервера не виден на клиенте
    СерверныйМодульВызовСервера.Цель();
    КлиентСерверныйМодуль.ЦельЕслиСервер(); // ошибка: объявление другого модуля отсутствует в контексте вызова
    КлиентСерверныйМодуль.ЦельЕслиКлиент();
    КлиентскийМодуль.Цель(); // не отмечается: на клиенте клиентский модуль виден
КонецПроцедуры

&НаСервере
Процедура НаСервере()
    КлиентскийМодуль.Цель(); // ошибка: клиентский модуль не виден на сервере
    КлиентСерверныйМодуль.ЦельЕслиКлиент(); // ошибка: объявление другого модуля отсутствует в контексте вызова
    ЦельГлобальная(); // ошибка: глобальный клиентский модуль не виден на сервере
    КлиентСерверныйМодуль.ЦельЕслиСервер();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВнеконтекстнаяКлиентСерверная()
    КлиентСерверныйМодуль.Цель();
    СерверныйМодуль.Цель(); // ошибка: на клиенте модуль не виден
    #Если Сервер Тогда
    СерверныйМодуль.Цель();
    #КонецЕсли
КонецПроцедуры

&НаКлиентеНаСервере
Процедура НедопустимаяВФорме()
    СерверныйМодуль.Цель(); // не отмечается: директиву отмечает CompilationDirectiveNotAllowed
КонецПроцедуры
