Функция БезПараметровИОписания()
КонецФункции

Функция БезОписания(Параметр1, Параметр2)
КонецФункции

// Описание есть, но нет параметров
Функция Пример1(Параметр1, Параметр2)
КонецФункции

// Описание есть,
// Параметры:
// Параметр1 - Строка - Описание параметра 1
// Параметр2 - Строка - Описание параметра 2
Функция Пример2()
КонецФункции

// Описание есть,
// Параметры:
// Параметр1 - Строка - Описание параметра 1
// Параметр2 - Строка - Описание параметра 2
Функция Пример3(Параметр1)
КонецФункции

// Описание есть,
// Параметры:
// Параметр1 - Строка - Описание параметра 1
// Параметр2 - Строка - Описание параметра 2
Функция Пример4(Параметр2, Параметр3)
КонецФункции

// Описание есть,
// Параметры:
// Параметр2 - Строка - Описание параметра 2
// Параметр1 - Строка - Описание параметра 1
Функция Пример5(Параметр1, Параметр2)
КонецФункции

// Описание есть,
// Параметры:
// Параметр1 - Строка
// Параметр2
Функция Пример6(Параметр1, Параметр2)
КонецФункции

// Описание есть,
// Параметры:
// Параметр1 - Строка - Описание параметра 1
// Параметр2 - Строка - Описание параметра 2
// Параметр2 - Строка - Описание параметра 2
Функция Пример7(Параметр1, Параметр2)
КонецФункции

// Описание есть,
// Параметры:
// Параметр3 - Строка - Описание параметра 3
// Параметр4 - Строка - Описание параметра 4
// Параметр5
Функция Пример8(Параметр1, Параметр2)
КонецФункции

// Описание есть,
// Параметры:
// Параметр1 - Строка - Описание параметра 1
// Параметр2 - Строка - Описание параметра 2
// Параметр3 - Строка - Описание параметра 3
// Параметр4 - Строка - Описание параметра 4
// Параметр5 - тип
Функция Пример9(Параметр1, Знач Параметр4)
КонецФункции

// Описание есть,
// Параметры:
// Параметр1 - Строка - Описание параметра 1
// Параметр2 - Строка - Описание параметра 2
Функция Пример10(параметр1, ПаРамЕтр2)
КонецФункции

// См. Пример10()
Функция Пример11(параметр1, ПаРамЕтр2)
КонецФункции
