Процедура Тест1()
    ПервыйОбщийМодуль.МетодНесуществующий(1, 2); // ошибка
    А = ПервыйОбщийМодуль.ДругойМетодНесуществующий(); // ошибка
    ПервыйОбщийМодуль.ЕщеМетодНесуществующий().Добавить(); // ошибка
    ПервыйОбщийМодуль.ЕщеОдинМетодНесуществующий().Реквизит = 10; // ошибка
    Б = ПервыйОбщийМодуль.ЕщеДругойМетодНесуществующий().Добавить(); // ошибка

    НесуществующийОбщийМодульИлиПростоПеременная.МетодНесуществующий(1, 2); // не ошибка
КонецПроцедуры

Процедура Тест2()
    ПервыйОбщийМодуль.НеУстаревшаяПроцедура(); // не ошибка
    А = ПервыйОбщийМодуль.НеУстаревшаяФункция(); // не ошибка
    ПервыйОбщийМодуль.НеУстаревшаяФункция().Добавить(); // не ошибка
    ПервыйОбщийМодуль.НеУстаревшаяФункция().Реквизит = 10; // не ошибка
    Б = ПервыйОбщийМодуль.НеУстаревшаяФункция().Добавить(); // не ошибка
КонецПроцедуры