
Перем ПеременнаяБезОписания;

Перем ЭкспортнаяПеременнаяБезОписания Экспорт;

Перем ПеременнаяСОписанием; // описание

Перем ЭкспортнаяПеременнаяСОписанием Экспорт; // описание

// описание
Перем ПеременнаяСОписаниемВыше;

// описание
Перем ЭкспортнаяПеременнаяСОписаниемВыше Экспорт;

 // неточное описание

Перем ПеременнаяСНевернымОписаниемВыше;

 // неточное описание

Перем ЭкспортнаяПеременнаяСНевернымОписаниемВыше Экспорт;

&Идентификатор
&ГенерируемоеЗначение
&Колонка(Тип = "Целое")
Перем ПеременнаяСАннотациямиOS Экспорт; // Внутренний идентификатор объекта

// Описание какое-то в шапке
&Идентификатор
&ГенерируемоеЗначение
&Колонка(Тип = "НеЦелое")
Перем ПеременнаяСАннотациямиOS Экспорт; // Висячий комментарий

&Идентификатор
&ГенерируемоеЗначение
&Колонка(Тип = "Вместилище")
Перем ПеременнаяСАннотациямиOSБезОписания Экспорт;

&Идентификатор
&ГенерируемоеЗначение
Перем ПеременнаяСАннотациямиСОписаниемВСтроке Экспорт; // это описание

// это описание переменной в шапке
&Идентификатор
&ГенерируемоеЗначение
Перем ПеременнаяСАннотациямиСОписаниемВШапке Экспорт;

&Идентификатор
// это описание переменной между аннотациями, но тоже подойдет
&ГенерируемоеЗначение
Перем ПеременнаяСАннотациямиСОписаниемВШапке Экспорт;

&Идентификатор
&ГенерируемоеЗначение
// это описание переменной под аннотациями
Перем ПеременнаяСАннотациямиСОписаниемВШапке Экспорт;

// это описание переменной в шапке и будет использовано именно оно
&Идентификатор
// это описание переменной между аннотациями использовано не будет
&ГенерируемоеЗначение
// это описание переменной под аннотациями и так как есть в шапке, будем игнорировать
Перем ПеременнаяСАннотациямиСОписаниемВШапке;
