&НаСервере
Процедура ПолучитьТоварыИзХранилища_Ошибка(АдресТоваровВХранилище)

    ПодобранныеТовары = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище); // ошибка
    Объект.Товары.Загрузить(ПодобранныеТовары);

КонецПроцедуры 

&НаСервере
Процедура ПолучитьТоварыИзХранилища_Ошибка2(АдресТоваровВХранилище)

    УдалитьИзВременногоХранилища(АдресТоваровВХранилище);

    ПодобранныеТовары = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище); // ошибка
    Объект.Товары.Загрузить(ПодобранныеТовары);

КонецПроцедуры

&НаСервере
Процедура ПолучитьТоварыИзХранилища_Ошибка3(АдресТоваровВХранилище)

    ПодобранныеТовары = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище); //ошибка
    Объект.Товары.Загрузить(ПодобранныеТовары);

    Если Истина Тогда
        УдалитьИзВременногоХранилища(ДругойАдрес);
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЕдинственныйВызовВМетоде(АдресТоваровВХранилище)

    ПодобранныеТовары = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище); //ошибка

КонецПроцедуры

&НаСервере
Процедура ПолучитьТоварыИзХранилища_Успешно()

    Адрес = "";
    ОбщийМодуль.ПолучитьАдрес(Адрес);

    ПодобранныеТовары = ПолучитьИзВременногоХранилища(Адрес); // не ошибка
    Результат = ПодобранныеТовары.ВыгрузитьКолонку("Наименование");

    УдалитьИзВременногоХранилища(Адрес);

КонецПроцедуры

&НаСервере
Процедура ПолучитьТоварыИзХранилища_Успешно1()

    Адрес = "";
    Попытка
        ОбщийМодуль.ПолучитьАдрес(Адрес);

        ПодобранныеТовары = ПолучитьИзВременногоХранилища(Адрес); // не ошибка
        Результат = ПодобранныеТовары.ВыгрузитьКолонку("Наименование");

        УдалитьИзВременногоХранилища(Адрес);
    Исключение
    КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ПолучитьТоварыИзХранилища_Успешно2(АдресТоваровВХранилище)

    Если Истина Тогда
	    ПодобранныеТовары = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище); // не ошибка
        Объект.Товары.Загрузить(ПодобранныеТовары);
    КонецЕсли;

    УдалитьИзВременногоХранилища(АдресТоваровВХранилище);

КонецПроцедуры

&НаСервере
Процедура ПолучитьТоварыИзХранилища_Успешно3(АдресТоваровВХранилище)

    Если Истина Тогда
	    ПодобранныеТовары = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище); // не ошибка
        Объект.Товары.Загрузить(ПодобранныеТовары);
    КонецЕсли;

    Если Истина Тогда
        УдалитьИзВременногоХранилища(АдресТоваровВХранилище);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииПоискаНастроек(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;

	Настройки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); // не ошибка
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	УстановитьНастройкиУчетнойЗаписи(Настройки);

КонецПроцедуры
