Процедура Проц1()
    Попытка
        Действие();
    Исключение
        ДействиеИсключения();
    КонецПопытки;
КонецПроцедуры

Процедура Проц11()
    Попытка
        Действие();
    Исключение

        // просто коментарий

        ДействиеИсключения();
    КонецПопытки;
КонецПроцедуры

Процедура Проц2()
    // в исключении пустой блок, это ошибка
    Попытка
        Действие();
    Исключение

    КонецПопытки;
КонецПроцедуры

Функция Функ1()

    Попытка
        Действие();
    Исключение

        // в исключении просто комментарий, это ошибка
        // но иногда нет

    КонецПопытки;

    Возврат 1;
КонецФункции

Процедура Проц3()
    // в исключении другая попытка, не ошибка
    Попытка
        Действие();
    Исключение
        // в исключении пустой блок, это ошибка
        Попытка
            Действие2();
        Исключение

        КонецПопытки;
    КонецПопытки;
КонецПроцедуры
