Процедура ПерваяОшибка_НовыйЗапрос()

    Запрос1 = Новый Запрос("ВЫБРАТЬ
        |    Справочник1.Ссылка КАК Ссылка
        |ИЗ
        |    Справочник.Справочник1 КАК Справочник1
        |ГДЕ
        |    Справочник1.Ссылка = &Параметр"); // ошибка

    РезультатЗапроса = Запрос1.Выполнить();

КонецПроцедуры

Процедура Вторая_НетОшибки_НовыйЗапрос()

    Запрос2 = Новый Запрос("ВЫБРАТЬ
        |    Справочник1.Ссылка КАК Ссылка
        |ИЗ
        |    Справочник.Справочник1 КАК Справочник1
        |ГДЕ
        |    Справочник1.Ссылка = &Параметр"); // нет ошибки

    Запрос2.УстановитьПараметр("Параметр", Ссылка);

    РезультатЗапроса = Запрос2.Выполнить();
КонецПроцедуры

Процедура ТретьяОшибка_ЗапросТекст()

    Запрос3 = Новый Запрос;
    Запрос3.Текст = "ВЫБРАТЬ
        |    Справочник1.Ссылка КАК Ссылка
        |ИЗ
        |    Справочник.Справочник1 КАК Справочник1
        |ГДЕ
        |    Справочник1.Ссылка = &Параметр"; // ошибка

    РезультатЗапроса = Запрос3.Выполнить();

КонецПроцедуры

Процедура Четвертая_НетОшибки_ЗапросТекст()

    Запрос4 = Новый Запрос;
    Запрос4.Текст = "ВЫБРАТЬ
        |    Справочник1.Ссылка КАК Ссылка
        |ИЗ
        |    Справочник.Справочник1 КАК Справочник1
        |ГДЕ
        |    Справочник1.Ссылка = &Параметр"; // нет ошибки

    Запрос4.УстановитьПараметр("Параметр", Ссылка);

    РезультатЗапроса = Запрос4.Выполнить();
КонецПроцедуры
