
Процедура ПроверкаДиагностики()

    Путь = "12345.xml";

    Данные = Base64Значение("12345");
    ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("xml"); // ошибка
    Данные.Записать(ИмяПромежуточногоФайла);

    ИмяПромежуточногоФайла2 = ПолучитьИмяВременногоФайла("xml"); 
    Данные.Записать(ИмяПромежуточногоФайла2);
    УдалитьФайлы(ИмяПромежуточногоФайла2);

    ИмяПромежуточногоФайла3 = ПолучитьИмяВременногоФайла("xml"); 
    Данные.Записать(ИмяПромежуточногоФайла3);
    ПереместитьФайл(ИмяПромежуточногоФайла3, Путь);

    ИмяПромежуточногоФайла4 = ПолучитьИмяВременногоФайла("xml");
    Данные.Записать(ИмяПромежуточногоФайла4);
    РаботаСФайламиСлужебныйКлиент.УдалитьФайл(Неопределено, ИмяПромежуточногоФайла4);

    ИмяПромежуточногоФайла5 = ПолучитьИмяВременногоФайла("xml");
    Данные.Записать(ИмяПромежуточногоФайла5);
    РандомнаяПроцедураУдаленияФайла(ИмяПромежуточногоФайла5);

КонецПроцедуры

Процедура РандомнаяПроцедураУдаленияФайла(ИмяФайла)
    УдалитьФайлы(ИмяФайла);
КонецПроцедуры