Процедура Рассчет()

    Результат = Сложение(, 2);
    Сообщить(Результат);

    Инкремент(Результат);
    Сообщить(Результат);

    Результат = Сложение(5);
    Сообщить(Результат);

    Результат = Сложение(5, 4, 3);
    Сообщить(Результат);

    Результат = Сложение();
    Сообщить(Результат);

    Сообщить(Сложение(5));

КонецПроцедуры

Процедура Версионирование()
    ВерсионированиеПриЗаписи(1);
    Документ.ПКО.ВерсионированиеПриЗаписи(1);
    ПервыйОбщийМодуль.ВерсионированиеПриЗаписи(1);
    ПервыйОбщийМодуль.ВерсионированиеПриЗаписи(,2);
    ПервыйОбщийМодуль.ВерсионированиеПриЗаписи();
    Сообщить(ПервыйОбщийМодуль.ВерсионированиеПриЗаписи());
КонецПроцедуры

Функция Сложение(Левый, Правый)
    Возврат Левый + Правый;
КонецФункции

Функция Инкремент(Значение, Приращение = 1)
    Значение = Значение + Приращение;
    Возврат Значение;
КонецФункции

