Функция Пример()
КонецФункции

// Описание вроде
Функция Пример1()
КонецФункции

// Описание вроде
// Возвращаемое значение:
Функция Пример2()
КонецФункции

// Описание вроде
// Возвращаемое значение:
// Строка - строка типа
Функция Пример3()
КонецФункции

// Описание вроде
// Возвращаемое значение:
// Строка - строка типа
Процедура Пример4()
КонецПроцедуры

// Описание вроде
Процедура Пример5()
КонецПроцедуры

// Описание вроде
// Возвращаемое значение:
// Строка
Функция Пример6()
КонецФункции

// Описание вроде
// Возвращаемое значение:
// - Строка
// - булево
// - Неопределено - если неизвестно
Функция Пример7()
КонецФункции

// Параметры подключения к администрируемой информационной базе кластера.
//
// Возвращаемое значение:
//  Структура:
//    * ИмяВКластере - Строка - имя администрируемой информационной базы в кластере серверов,
//    * ИмяАдминистратораИнформационнойБазы - Строка - имя пользователя информационной базы с правами
//                  администратора (если для информационной базы не задан список пользователей ИБ - используется
//                  пустая строка),
//    * ПарольАдминистратораИнформационнойБазы - Строка - пароль пользователя информационной базы
//                  с правами администратора (если для информационной базы не задан список пользователей ИБ или
//                  для пользователя ИБ не установлен пароль - используется пустая строка).
//
Функция ПараметрыАдминистрированияИнформационнойБазыКластера() Экспорт

	Результат = Новый Структура();

	Результат.Вставить("ИмяВКластере", "");
	Результат.Вставить("ИмяАдминистратораИнформационнойБазы", "");
	Результат.Вставить("ПарольАдминистратораИнформационнойБазы", "");

	Возврат Результат;

КонецФункции

// См. Пример7()
Функция Пример8()
КонецФункции

// См. Пример7()
//
//
//
Функция Пример9()
КонецФункции
