Функция Пример()
КонецФункции

// Описание вроде
Функция Пример1()
КонецФункции

// Описание вроде
// Возвращаемое значение:
Функция Пример2()
КонецФункции

// Описание вроде
// Возвращаемое значение:
// Строка - строка типа
Функция Пример3()
КонецФункции

// Описание вроде
// Возвращаемое значение:
// Строка - строка типа
Процедура Пример4()
КонецПроцедуры

// Описание вроде
Процедура Пример5()
КонецПроцедуры

// Описание вроде
// Возвращаемое значение:
// Строка
Функция Пример6()
КонецФункции

// Описание вроде
// Возвращаемое значение:
// - Строка
// - булево
// - Неопределено - если неизвестно
Функция Пример7()
КонецФункции
