
Процедура ПроверкаДиагностики()

    Путь = "12345.xml";

    Данные = Base64Значение("12345");
    ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("xml"); // ошибка
    Данные.Записать(ИмяПромежуточногоФайла);

    ИмяПромежуточногоФайла2 = ПолучитьИмяВременногоФайла("xml"); 
    Данные.Записать(ИмяПромежуточногоФайла2);
    УдалитьФайлы(ИмяПромежуточногоФайла2);

    ИмяПромежуточногоФайла3 = ПолучитьИмяВременногоФайла("xml"); 
    Данные.Записать(ИмяПромежуточногоФайла3);
    ПереместитьФайл(ИмяПромежуточногоФайла3, Путь);

    // ошибка, если нет поиска
    // РаботаСФайламиСлужебныйКлиент.УдалитьФайл
    ИмяПромежуточногоФайла4 = ПолучитьИмяВременногоФайла("xml"); // ошибка, если нет исключения
    Данные.Записать(ИмяПромежуточногоФайла4);
    РаботаСФайламиСлужебныйКлиент.УдалитьФайл(Неопределено, ИмяПромежуточногоФайла4);

    // ошибка, если нет поиска
    // РандомнаяПроцедураУдаленияФайла
    ИмяПромежуточногоФайла5 = ПолучитьИмяВременногоФайла("xml");
    Данные.Записать(ИмяПромежуточногоФайла5);
    РандомнаяПроцедураУдаленияФайла(ИмяПромежуточногоФайла5);

    // ошибка, если нет "НачатьУдалениеФайлов"
    ИмяПромежуточногоФайла6 = ПолучитьИмяВременногоФайла("xml");
    НачатьУдалениеФайлов(, ИмяПромежуточногоФайла6);

    // ошибка, если нет "BeginDeletingFiles"
    TempFile7 = GetTempFileName("xml");
    BeginDeletingFiles(, TempFile7);

КонецПроцедуры

Процедура РандомнаяПроцедураУдаленияФайла(ИмяФайла)
    УдалитьФайлы(ИмяФайла);
КонецПроцедуры

Процедура ПроверкаДиагностикиСОбщимМодулем()

    ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("xml"); // <-- Ошибки нет, ниже удаление
    Данные.Записать(ИмяПромежуточногоФайла);


    ИмяПромежуточногоФайла2 = ПолучитьИмяВременногоФайла("txt"); // <-- Ошибка, удаления файла нет
    Данные.Записать(ИмяПромежуточногоФайла2);

    ОбщийМодуль.УдалитьВсеФайлы2(ИмяПромежуточногоФайла);
    Обработки.ДляУдаления.УдалитьВсеФайлы(ИмяПромежуточногоФайла);
    Статус = Справочники.ОбщийМодуль.УдалитьВсеФайлы(ИмяПромежуточногоФайла);

КонецПроцедуры

Процедура ПроверкаДиагностикиСОбщимМодулем_Модуль()

    ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла(); // <-- Ошибки нет, ниже удаление
    ДвоичныеДанные = Модуль("РаботаСФайлами").ДвоичныеДанныеФайла(ИмяПромежуточногоФайла);
    УдалитьФайлы(ИмяПромежуточногоФайла);

    ИмяПромежуточногоФайла3 = ПолучитьИмяВременногоФайла(); // <-- Ошибка, удаления файла нет
    ДвоичныеДанные = Модуль("РаботаСФайлами").ДвоичныеДанныеФайла(ИмяПромежуточногоФайла3);

КонецПроцедуры

Функция Тест()
    Если Условие Тогда
        ИмяФайлаНаДиске = ПолучитьИмяВременногоФайла(); // ошибка, удаления файла нет
        ПолучитьИзВременногоХранилища(ИмяФайла).Записать(ИмяФайлаНаДиске);
     Иначе
        ИмяФайлаНаДиске = ИмяФайла;
    КонецЕсли;

    Возврат ТекстИзФайла;
КонецФункции