Процедура ПерваяОшибка()

    Запрос1 = Новый Запрос("ВЫБРАТЬ
        |    Справочник1.Ссылка КАК Ссылка
        |ИЗ
        |    Справочник.Справочник1 КАК Справочник1
        |ГДЕ
        |    Справочник1.Ссылка = &Параметр");

    РезультатЗапроса = Запрос1.Выполнить();

КонецПроцедуры

Процедура Вторая_НетОшибки()

    Запрос2 = Новый Запрос("ВЫБРАТЬ
        |    Справочник1.Ссылка КАК Ссылка
        |ИЗ
        |    Справочник.Справочник1 КАК Справочник1
        |ГДЕ
        |    Справочник1.Ссылка = &Параметр");

    Запрос2.УстановитьПараметр("Параметр", Ссылка);

    РезультатЗапроса = Запрос2.Выполнить(); // нет ошибки
КонецПроцедуры
