Процедура Рассчет()

    Результат = Сложение(, 2); // Range(2, 16, 2, 29)
    Сообщить(Результат);

    Инкремент(Результат);
    Сообщить(Результат);

    Результат = Сложение(5); // Range(8, 16, 8, 27)
    Сообщить(Результат);

    Результат = Сложение(5, 4, 3);
    Сообщить(Результат);

    Результат = Сложение(); // 2xRange(14, 16, 14, 26)
    Сообщить(Результат);

    Сообщить(Сложение(,)); // 2хRange(17, 13, 17, 24)
    Сообщить(Менеджер("Справочник")); // Range(18, 13, 18, 35)
КонецПроцедуры

Процедура Версионирование()
    ВерсионированиеПриЗаписи(1);
    Документы.ПКО.ВерсионированиеПриЗаписи(1);
    ПервыйОбщийМодуль.ВерсионированиеПриЗаписи(1); // Range(24, 22, 24, 49)
    ПервыйОбщийМодуль.ВерсионированиеПриЗаписи(2,); // Range(25, 22, 25, 50)
    ПервыйОбщийМодуль.ВерсионированиеПриЗаписи(); // 2xRange(26, 22, 26, 48)
    Сообщить(ПервыйОбщийМодуль.ВерсионированиеПриЗаписи()); // 2xRange(27, 31, 27, 57)
    Справочники.Справочник1.Тест(); // Range(28, 28, 28, 34);
    Результат = ЭтотОбъект.Сложение(, 2);

КонецПроцедуры

Функция Сложение(Левый, Правый) Экспорт
    Возврат Левый + Правый;
КонецФункции

Функция Инкремент(Значение, Приращение = 1)
    Значение = Значение + Приращение;
    Возврат Значение;
КонецФункции

Функция Менеджер(Тип = "Справочник", Вид)
    ИмяТипа = СтрШаблон("%1Менеджер.%2", Тип, Вид);
    Возврат Новый(Тип(ИмяТипа));
КонецФункции
