
Процедура ПроверкаДиагностики()

    Путь = "12345.xml";

    Данные = Base64Значение("12345");
    ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("xml"); // ошибка
    Данные.Записать(ИмяПромежуточногоФайла);

    ИмяПромежуточногоФайла2 = ПолучитьИмяВременногоФайла("xml"); 
    Данные.Записать(ИмяПромежуточногоФайла2);
    УдалитьФайлы(ИмяПромежуточногоФайла2);

    ИмяПромежуточногоФайла3 = ПолучитьИмяВременногоФайла("xml"); 
    Данные.Записать(ИмяПромежуточногоФайла3);
    ПереместитьФайл(ИмяПромежуточногоФайла3, Путь);

    // ошибка, если нет поиска
    // РаботаСФайламиСлужебныйКлиент.УдалитьФайл
    ИмяПромежуточногоФайла4 = ПолучитьИмяВременногоФайла("xml"); // ошибка, если нет исключения
    Данные.Записать(ИмяПромежуточногоФайла4);
    РаботаСФайламиСлужебныйКлиент.УдалитьФайл(Неопределено, ИмяПромежуточногоФайла4);

    // ошибка, если нет поиска
    // РандомнаяПроцедураУдаленияФайла
    ИмяПромежуточногоФайла5 = ПолучитьИмяВременногоФайла("xml");
    Данные.Записать(ИмяПромежуточногоФайла5);
    РандомнаяПроцедураУдаленияФайла(ИмяПромежуточногоФайла5);

    // ошибка, если нет "НачатьУдалениеФайлов"
    ИмяПромежуточногоФайла6 = ПолучитьИмяВременногоФайла("xml");
    НачатьУдалениеФайлов(, ИмяПромежуточногоФайла6);

    // ошибка, если нет "BeginDeletingFiles"
    TempFile7 = GetTempFileName("xml");
    BeginDeletingFiles(, TempFile7);

КонецПроцедуры

Процедура РандомнаяПроцедураУдаленияФайла(ИмяФайла)
    УдалитьФайлы(ИмяФайла);
КонецПроцедуры