Процедура Рассчет()

    Результат = Сложение(, 2);
    Сообщить(Результат);

    Инкремент(Результат);
    Сообщить(Результат);

    Результат = Сложение(5);
    Сообщить(Результат);

    Результат = Сложение(5, 4, 3);
    Сообщить(Результат);

    Результат = Сложение();
    Сообщить(Результат);

КонецПроцедуры

Функция Сложение(Левый, Правый)
    Возврат Левый + Правый;
КонецФункции

Функция Инкремент(Значение, Приращение = 1)
    Значение = Значение + Приращение;
    Возврат Значение;
КонецФункции

