Процедура ПерваяОшибка_НовыйЗапрос()

    Запрос1 = Новый Запрос("ВЫБРАТЬ
        |    Справочник1.Ссылка КАК Ссылка
        |ИЗ
        |    Справочник.Справочник1 КАК Справочник1
        |ГДЕ
        |    Справочник1.Ссылка = &Параметр1"); // ошибка

    РезультатЗапроса = Запрос1.Выполнить();

КонецПроцедуры

Процедура Вторая_НетОшибки_НовыйЗапрос()

    Запрос2 = Новый Запрос("ВЫБРАТЬ
        |    Справочник1.Ссылка КАК Ссылка
        |ИЗ
        |    Справочник.Справочник1 КАК Справочник1
        |ГДЕ
        |    Справочник1.Ссылка = &Параметр2"); // нет ошибки

    Запрос2.УстановитьПараметр("Параметр2", Ссылка);

    РезультатЗапроса = Запрос2.Выполнить();
КонецПроцедуры

Процедура ТретьяОшибка_ЗапросТекст()

    Запрос3 = Новый Запрос;
    Запрос3.Текст = "ВЫБРАТЬ
        |    Справочник1.Ссылка КАК Ссылка
        |ИЗ
        |    Справочник.Справочник1 КАК Справочник1
        |ГДЕ
        |    Справочник1.Ссылка = &Параметр3"; // ошибка

    РезультатЗапроса = Запрос3.Выполнить();

КонецПроцедуры

Процедура Четвертая_НетОшибки_ЗапросТекст()

    Запрос4 = Новый Запрос;
    Запрос4.Текст = "ВЫБРАТЬ
        |    Справочник1.Ссылка КАК Ссылка
        |ИЗ
        |    Справочник.Справочник1 КАК Справочник1
        |ГДЕ
        |    Справочник1.Ссылка = &Параметр4"; // нет ошибки

    Запрос4.УстановитьПараметр("Параметр4", Ссылка);

    РезультатЗапроса = Запрос4.Выполнить();
КонецПроцедуры

Процедура ПятаяОшибка_СначалаТекстПотомНовыйЗапрос()

    Текст5 = "ВЫБРАТЬ
        |    Справочник1.Ссылка КАК Ссылка
        |ИЗ
        |    Справочник.Справочник1 КАК Справочник1
        |ГДЕ
        |    Справочник1.Ссылка = &Параметр5"; // ошибка

    Запрос5 = Новый Запрос(Текст5);
    РезультатЗапроса = Запрос5.Выполнить();

КонецПроцедуры

Процедура Шестое_СначалаТекстПотомНетЗапроса(Текст)

    НеиспользуемыйТекст6 = "ВЫБРАТЬ
        |    Справочник1.Ссылка КАК Ссылка
        |ИЗ
        |    Справочник.Справочник1 КАК Справочник1
        |ГДЕ
        |    Справочник1.Ссылка = &Параметр6"; // не ошибка

    Запрос6 = Новый Запрос(Текст);
    РезультатЗапроса = Запрос6.Выполнить();

КонецПроцедуры
