// Считаем, что в конфигурации два языка ru и en
Процедура БезОшибок()
    Приветствие = НСтр("ru='Привет, я простая строка';
        |en='Hi, i'm a simple string'");

    ПолеЗапроса = СтрШаблон("%1.%2 КАК %2", "Документ", "Автомобиль");
КонецПроцедуры

Функция СОшибками(Строка)
    Сообщить(НСтр("en='Hi, i'm a simple string'"));

    Сообщить(СтрШаблон(НСтр("ru='В строке №%1 не заполнена номенклатура'"), Строка.Номер));

    ШаблонСообщения = НСтр("ru='В строке №%1 не заполнена характеристика'");
    Сообщить(СтрШаблон(ШаблонСообщения, Строка.Номер));

    ТекстДляНСтр = "ru='Привет, я простая строка';
        |en='Hi, i'm a simple string'";
    Сообщить(НСтр(ТекстДляНСтр));
КонецФункции
