// Считаем, что в конфигурации два языка ru и en
Процедура БезОшибок()
    Приветствие = НСтр("ru='Привет, я простая строка';
        |en='Hi, i'm a simple string'");

    ПолеЗапроса = СтрШаблон("%1.%2 КАК %2", "Документ", "Автомобиль");
КонецПроцедуры

Функция СОшибками(Строка)
    Сообщить(НСтр("en='Hi, i'm a simple string'")); // Нет ошибки, тут отрабатывает диагностика MultilingualStringHasAllDeclaredLanguagesDiagnostic

    Сообщить(СтрШаблон(НСтр("ru='В строке №%1 не заполнена номенклатура'"), Строка.Номер)); // Ошибка если указаны какие-то языки кроме ru

    ШаблонСообщения = НСтр("ru='В строке №%1 не заполнена характеристика'"); // Нет ошибки, тут отрабатывает диагностика MultilingualStringHasAllDeclaredLanguagesDiagnostic
    Сообщить(СтрШаблон(ШаблонСообщения, Строка.Номер));

    ТекстДляНСтр = "ru='Привет, я простая строка';
        |en='Hi, i'm a simple string'";
    Сообщить(НСтр(ТекстДляНСтр)); // Ошибка если указаны какие-то языки кроме ru, en
КонецФункции
