// Считаем, что в конфигурации два языка ru и en
Процедура БезОшибок()
    
    Приветствие = НСтр("ru='Привет, я простая строка';
        |en='Hi, i'm a simple string'");

    ПолеЗапроса = СтрШаблон("%1.%2 КАК %2", "Документ", "Автомобиль");

КонецПроцедуры

Функция СОшибками(Строка)

    БезТекста = НСтр(); // <-- для ru, ru и en ошибка
    СНевернымФорматомСтроки = НСтр("Тут текст который не относиться к ниодному языку"); // <-- для ru, ru и en ошибка

    ТекстТолькоНаРусском = НСтр("ru='Привет, я простая строка''"); // <-- для ru и en ошибка
    ТекстТолькоНаАнглийском = НСтр("en='Hi, i'm a simple string'"); // <-- для ru, ru и en ошибка

    СообщениеПользователю = СтрШаблон(НСтр("ru='В строке №%1 не заполнена номенклатура'"), Строка.Номер); // <-- для ru и en ошибка
    СообщениеПользователю = СтрШаблон(НСтр("en='In line №%1 nomenclature is not filled'"), Строка.Номер); // <-- для ru, ru и en ошибка

    ТекстТолькоНаРусском = НСтр("ru='В строке №%1 не заполнена номенклатура'"); // <-- для ru и en ошибка
    СообщениеПользователю = СтрШаблон(ТекстТолькоНаРусском, Строка.Номер);

    ТекстТолькоНаАнглийском = НСтр("en='In line №%1 nomenclature is not filled'"); // <-- для ru, ru и en ошибка
    СообщениеПользователю = СтрШаблон(ТекстТолькоНаАнглийском, Строка.Номер);

КонецФункции
