Процедура Тест()

    ТекстЗапроса =
    "ВЫБРАТь
    |   Поле КАК Поле,
    |   "" КАК ПустаяСтрока,
    |   "" КАК ЕщеПустаяСтрока,
    |   "" как ТретьяПустаяСтрока,
    |   ЕСТЬNULL(Поле, """") КАК ПолеНеВСтроке
    |ИЗ
    |   Справочник.Справочник";

    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
    |	ПриходныйОрдерНоменклатура.Номенклатура КАК Номенклатура,
    |	ЕСТЬNULL(ПриходныйОрдерНоменклатура.Номенклатура.Код, "") КАК НоменклатураКод,
    |	ЕСТЬNULL(ПриходныйОрдерНоменклатура.Номенклатура.Наименование, "") КАК НоменклатураНаименование
    |ИЗ
    |	Документ.ПриходныйОрдер.Номенклатура КАК ПриходныйОрдерНоменклатура
    |ГДЕ
    |	ПриходныйОрдерНоменклатура.Ссылка = &Ссылка";
КонецПроцедуры
