Если а Тогда
  Если б Тогда
   Если в Тогда
    Если г Тогда
    КонецЕсли;
   КонецЕсли;
 КонецЕсли;
КонецЕсли;

Если аа Тогда
 Если бб Тогда
  Пока вв Цикл
    Попытка
    Исключение
    КонецПопытки;
  КонецЦикла;
 КонецЕсли;
КонецЕсли;

Если ааа Тогда
 Если ббб Тогда
 КонецЕсли;
 Если ввв Тогда
 КонецЕсли;
 Если ггг Тогда
 КонецЕсли;
 Если ддд Тогда
 КонецЕсли;
КонецЕсли;

Пока аааа Цикл
 Если бббб Тогда
  Попытка
   Для А = 1 По гггг Цикл
   КонецЦикла;
  Исключение
  КонецПопытки;
 КонецЕсли;
КонецЦикла;