Процедура Тест()
    СтруктураВложений.Вставить(                     // <-- Ошибка, т.к. есть вложенный конструктов и метод
     ПрисоединенныйФайл.Наименование,
     Новый Картинка(ПолучитьИзВременногоХранилища(  // <-- 2 ошибки, т.к. есть вложенный метод м в конструкторе и в методе
      ПрисоединенныеФайлы.ПолучитьДанныеФайла(ПрисоединенныйФайл.Ссылка).СсылкаНаДвоичныеДанныеФайла)));

    Сообщить(СуммаСтрокой("7"), СуммаСтрокой(СуммаНДС(Перечисление.Сумма)));  // <-- не ошибка, все в одной строке

    Сообщить(СуммаСтрокой("77"),                            // <-- ошибка для Сообщить, т.к есть вложенный метод в параметрах
        СуммаСтрокой(СуммаНДС(Перечисление.ВтораяСумма)));  // <-- не ошибка для СуммаСтрокой, т.к. в одной строке


    Объект.Метод().Метод2(Объект2.Метод2()); // <-- не ошибка, все в одной строке
    Объект.Метод(Объект2.Метод2()).Метод21( // <-- ошибка для Метод21, т.к. есть вложенный метод
        Объект2.Метод22());

    Структура = Новый Структура("Параметр1, Параметр2", Новый Массив(), Новый СписокЗначений()); // <-- не ошибка, все в одной строке
    Структура = Новый Структура("Параметр1, Параметр2",                             // <-- ошибка, есть вложенный конструктор с инициализацией
                Новый Структура(), Новый Структура("Параметр3", Новый Массив()));   // <-- ошибок нет

    Структура = Новый Структура("Параметр1, Параметр2",                             // <-- ошибок нет, т.к. конструктор без инициализации
                Новый Структура, Новый Массив);

КонецПроцедуры