
// Ru

// Структуры

// Pass
Результат = Новый Структура("П1", ОбщегоНазначения.ЗначениеПараметра(П1));

// Pass
Результат = Новый Структура("П1", ОбщегоНазначения.ЗначениеПараметра(П1, П2));

// Pass
Результат = Новый Структура("П1", ОбщегоНазначения.ЗначениеПараметра(П1, П2, П3));

// Warn
Результат = Новый Структура("П1", ОбщегоНазначения.ЗначениеПараметра(П1, П2, П3, П4));

// Warn
Результат = Новый Структура("П1", ЗначениеПараметра(П1, П2, П3, П4));

// Warn
Результат = Новый ФиксированнаяСтруктура(
                   СписокПараметров(П1, П2, П3, П4),                    // Warn
                   ОбщегоНазначения.ЗначениеПараметра1(П1, П2, П3, П4), // Warn
                   ОбщегоНазначения.ЗначениеПараметра2(П1, П2, П3),     // Pass
                   ЗначениеПараметра3(),                                // Pass
                   ЗначениеПараметра4(П1, П2, П3, П4));                 // Warn

// Pass
Результат = Новый ("Структура", МассивПараметров());

// Pass
Результат = Новый ("ФиксированнаяСтруктура", МассивПараметров(П1, П2, П3));

// Warn
Результат = Новый ("ФиксированнаяСтруктура", МассивПараметров(П1, П2, П3, П4));

// Warn
Результат = Новый ("ФиксированнаяСтруктура",
                    МассивПараметров(                                       // Warn
                                    П1,
                                    П2,
                                    П3,
                                    ЗначениеПараметра4(П1, П2, П3, П4)));   // Pass

Результат = Новый Структура(                            // Pass
					Новый ФиксированнаяСтруктура (
							ЗаполнитьПараметры1(        // Warn
							"ПФ1_1",
							"ПФ1_2",
							"ПФ1_3",
							ЗаполнитьВложенныеПараметры(
								"ПФВЛ_1",
								"ПФВЛ_2",
								"ПФВЛ_3",
								"ПФВЛ_4"))));

// En

// Structure

// Pass
Result = New Structure("П1", Common.ParamValue(P1));

// Pass
Result = New Structure("П1", Common.ParamValue(P1, P2));

// Pass
Result = New Structure("П1", Common.ParamValue(P1, P2, P3));

// Warn
Result = New Structure("П1", Common.ParamValue(P1, P2, P3, P4));

// Warn
Result = New Structure("П1", ParamValue(P1, P2, P3, P4));

// Warn
Result = New FixedStructure(
                ParamList(P1, P2, P3, P4),              // Warn
                Common.ParamValue1(P1, P2, P3, P4),     // Warn
                Common.ParamValue2(P1, P2, P3),         // Pass
                ParamValue3(),                          // Pass
                ParamValue4(P1, P2, P3, P4));           // Warn

// Pass
Result = New ("Structure", GetParams());

// Pass
Result = New ("FixedStructure", GetParams(P1, P2, P3));

// Warn
Result = New ("FixedStructure", GetParams(P1, P2, P3, P4))