Процедура А()
 Если а Тогда     //1
   Если б Тогда   //2
    Если в Тогда  //3
     Если г Тогда //4 Максимуим но не сработало
     КонецЕсли;
    КонецЕсли;
  КонецЕсли;
 КонецЕсли;
КонецПроцедуры

Если аа Тогда    //1
   Пока вв Цикл  //2
    Попытка      //3 Мимо
    Исключение
    КонецПопытки;
  КонецЦикла;
КонецЕсли;

Если ааа Тогда  //Мимо
 Если ббб Тогда
 КонецЕсли;
 Если ввв Тогда
 КонецЕсли;
 Если ггг Тогда
 КонецЕсли;
 Если ддд Тогда
 КонецЕсли;
КонецЕсли;

Пока аааа Цикл             //1
 Если бббб Тогда           //2
 Иначе
  Попытка                  //3
   Для А = 1 По гггг Цикл  //4 Максимуим
        Если дддд Тогда    //5 Сработало
        КонецЕсли;
   КонецЦикла;
  Исключение
  КонецПопытки;
 КонецЕсли;
КонецЦикла;

Пока аааа Цикл             //1
 Если бббб Тогда           //2
 Иначе
  Попытка                  //3
   Для А = 1 По гггг Цикл  //4 Максимуим
    Если дддд Тогда        //5
     Если ееее Тогда       //6
      Если жжжж Тогда      //7 Сработало

      КонецЕсли;
     КонецЕсли;
    КонецЕсли;
   КонецЦикла;
  Исключение
  КонецПопытки;
 КонецЕсли;
КонецЦикла;