Функция ОдноЗначение()
    Возврат "Значение";
КонецФункции

Процедура ПерваяПроцедура()

    Тест = 1;
    Возврат;
    Возврат Тест;

КонецПроцедуры

Процедура ПромежуточнаяПроцедура()

    Значение = Истина;
    Если Значение = Истина Тогда
        Возврат ОдноЗначение() + " 2";
    КонецЕсли;

КонецПроцедуры

Процедура ВтораяПроцедура()

    Накопитель = 1;
    Для Счетчик = 1 По 2 Цикл
        Накопитель = Накопитель + 1;

        Если Накопитель = 2 Тогда
            Возврат Накопитель;
        КонецЕсли;
    КонецЦикла;

    Возврат;

КонецПроцедуры

Процедура ТретьяПроцедура()
    Тест = 2;
    Если Тест = 2 Тогда
        Возврат;
    КонецЕсли;
КонецПроцедуры
