//Проверяемые кейсы:

//1.Базовое разыменование ссылочных полей в выборке (во временную таблицу или в результат запроса) Должна зафиксироваться ошибка
//2.Разыменование ссылочных полей в соединениях таблиц (Должна зафиксироваться ошибка)
//3.Разыменование ссылочных полей в виртуальных таблиц (Должна зафиксироваться ошибка)
//4.Агрегатные и иные функции над полем (Не должна фиксироваться ошибка)
//5.Конструкция "ВЫРАЗИТЬ" без разыменования итогового поля (Не должна фиксироваться ошибка)
//6.Конструкция "ВЫРАЗИТЬ" с разыменованием итогового поля (Должна фиксироваться ошибка)
//7.Разыменование ссылочных полей в секции "ГДЕ" (Должна фиксироваться ошибка)

Процедура ПолучениеДанныхЗаказовКлиентов()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
	|	ЗаказКлиентаТовары.Серия КАК Серия,
	|	ЗаказКлиентаТовары.СуммаНДС + ЗаказКлиентаТовары.Сумма КАК СуммаСНДС,
	|	ЗаказКлиентаТовары.Ссылка.Организация КАК Организация,
	|	ЗаказКлиентаТовары.Ссылка.Контрагент КАК Контрагент,
	|	ЗаказКлиентаТовары.Ссылка.Партнер КАК Партнер,
	|	ЗаказКлиентаТовары.Ссылка.ОбъектРасчетов КАК ОбъектРасчетов
	|ПОМЕСТИТЬ ВТ_ДанныеЗаказовКлиента
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент,
	|	Партнер,
	|	ОбъектРасчетов,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСКлиентамиОбороты.Валюта КАК Валюта,
	|	РасчетыСКлиентамиОбороты.СуммаОборот КАК СуммаОборот,
	|	РасчетыСКлиентамиОбороты.КОплатеОборот КАК КОплатеОборот,
	|	РасчетыСКлиентамиОбороты.КОтгрузкеОборот КАК КОтгрузкеОборот,
	|	РасчетыСКлиентамиОбороты.ОтгружаетсяОборот КАК ОтгружаетсяОборот
	|ПОМЕСТИТЬ ВТ_РасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			(АналитикаУчетаПоПартнерам.Партнер, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Организация, ОбъектРасчетов) В
	|				(ВЫБРАТЬ
	|					ВТ_ДанныеЗаказовКлиента.Партнер КАК Партнер,
	|					ВТ_ДанныеЗаказовКлиента.Контрагент КАК Контрагент,
	|					ВТ_ДанныеЗаказовКлиента.Организация КАК Организация,
	|					ВТ_ДанныеЗаказовКлиента.ОбъектРасчетов КАК ОбъектРасчетов
	|				ИЗ
	|					ВТ_ДанныеЗаказовКлиента КАК ВТ_ДанныеЗаказовКлиента)) КАК РасчетыСКлиентамиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиПланОтгрузокОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиПланОтгрузокОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСКлиентамиПланОтгрузокОбороты.ДокументПлан КАК ДокументПлан,
	|	РасчетыСКлиентамиПланОтгрузокОбороты.Валюта КАК Валюта,
	|	РасчетыСКлиентамиПланОтгрузокОбороты.СуммаОборот КАК СуммаОборот
	|ПОМЕСТИТЬ ВТ_ПланОтгрузок
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПланОтгрузок.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			(ДокументПлан, ОбъектРасчетов) В
	|				(ВЫБРАТЬ
	|					ВТ_ДанныеЗаказовКлиента.Ссылка КАК Ссылка,
	|					ВТ_ДанныеЗаказовКлиента.ОбъектРасчетов КАК ОбъектРасчетов
	|				ИЗ
	|					ВТ_ДанныеЗаказовКлиента КАК ВТ_ДанныеЗаказовКлиента)) КАК РасчетыСКлиентамиПланОтгрузокОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВТ_РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВТ_РасчетыСКлиентами.Валюта КАК Валюта,
	|	ВТ_РасчетыСКлиентами.СуммаОборот КАК СуммаОборот,
	|	ВТ_РасчетыСКлиентами.КОплатеОборот КАК КОплатеОборот,
	|	ВТ_РасчетыСКлиентами.КОтгрузкеОборот КАК КОтгрузкеОборот,
	|	ВТ_РасчетыСКлиентами.ОтгружаетсяОборот КАК ОтгружаетсяОборот,
	|	ВТ_ДанныеЗаказовКлиента.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеЗаказовКлиента.Характеристика КАК Характеристика,
	|	ВТ_ДанныеЗаказовКлиента.Упаковка КАК Упаковка,
	|	ЕСТЬNULL(ВТ_ДанныеЗаказовКлиента.Ссылка, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК ЗаказКлиента
	|ПОМЕСТИТЬ ВТ_РасчетыСКлиентамиРасш
	|ИЗ
	|	ВТ_РасчетыСКлиентами КАК ВТ_РасчетыСКлиентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеЗаказовКлиента КАК ВТ_ДанныеЗаказовКлиента
	|		ПО ВТ_РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Партнер = ВТ_ДанныеЗаказовКлиента.Партнер
	|			И ВТ_РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент = ВТ_ДанныеЗаказовКлиента.Контрагент
	|			И ВТ_РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация = ВТ_ДанныеЗаказовКлиента.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетыСКлиентамиРасш.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВТ_РасчетыСКлиентамиРасш.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВТ_РасчетыСКлиентамиРасш.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_РасчетыСКлиентамиРасш.Номенклатура КАК Номенклатура,
	|	ВТ_РасчетыСКлиентамиРасш.Характеристика КАК Характеристика,
	|	ВТ_РасчетыСКлиентамиРасш.Упаковка КАК Упаковка,
	|	ВЫРАЗИТЬ(ВТ_ПланОтгрузок.ДокументПлан КАК Документ.ЗаказКлиента).Валюта КАК ВалютаДокумента,
	|	ВЫРАЗИТЬ(ВТ_ПланОтгрузок.ДокументПлан КАК Документ.ЗаказКлиента).Валюта.Наценка КАК НаценкаВалюыДокумента
	|ИЗ
	|	ВТ_РасчетыСКлиентамиРасш КАК ВТ_РасчетыСКлиентамиРасш
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПланОтгрузок КАК ВТ_ПланОтгрузок
	|		ПО ВТ_РасчетыСКлиентамиРасш.АналитикаУчетаПоПартнерам = ВТ_ПланОтгрузок.АналитикаУчетаПоПартнерам
	|			И ВТ_РасчетыСКлиентамиРасш.ОбъектРасчетов = ВТ_ПланОтгрузок.ОбъектРасчетов
	|			И ВТ_РасчетыСКлиентамиРасш.ЗаказКлиента = ВТ_ПланОтгрузок.ДокументПлан";

	Запрос.УстановитьПараметр("КонецПериода", КонецГода(ТекущаяДата()));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ТекущаяДата()));

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс КАК Курс
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";

	Запрос.УстановитьПараметр("Валюта", Справочники.Валюты.ПустаяСсылка());
	Запрос.УстановитьПараметр("Период", ТекущаяДата());

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

КонецПроцедуры;

//Итоговое ожидаемое количество срабатываний:
//Номер тест кейса | Число срабатываний
// №1 | 4
// №2 | 3
// №3 | 3
// №4 | 0
// №5 | 0
// №6 | 1
// №7 | 1
//Итого: 12