	//Проверяемые кейсы:

	//1.Базовое разыменование ссылочных полей в выборке (во временную таблицу или в результат запроса) Должна зафиксироваться ошибка
	//2.Разыменование ссылочных полей в соединениях таблиц (Должна зафиксироваться ошибка)
	//3.Разыменование ссылочных полей в виртуальных таблиц (Должна зафиксироваться ошибка)
	//4.Агрегатные и иные функции над полем (Не должна фиксироваться ошибка)
	//5.Конструкция "ВЫРАЗИТЬ" без разыменования итогового поля (Не должна фиксироваться ошибка)
	//6.Конструкция "ВЫРАЗИТЬ" с разыменованием итогового поля (Должна фиксироваться ошибка)
	//7.Разыменование ссылочных полей в секции "ГДЕ" (Должна фиксироваться ошибка)

	Процедура ПолучениеДанныхЗаказовКлиентов()

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
		|	ЗаказКлиентаТовары.Серия КАК Серия,
		|	ЗаказКлиентаТовары.Подразделение КАК Подразделение,
		|	ЗаказКлиентаТовары.Ссылка.Организация КАК Организация, //Ошибка №1
		|	ЗаказКлиентаТовары.Ссылка.Контрагент КАК Контрагент, //Ошибка №1
		|	ЗаказКлиентаТовары.Ссылка.Партнер КАК Партнер, //Ошибка №1
		|	ЗаказКлиентаТовары.Ссылка.ОбъектРасчетов КАК ОбъектРасчетов //Ошибка №1
		|ПОМЕСТИТЬ ВТ_ДанныеЗаказовКлиента
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода //Ошибка №7
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагент,
		|	Партнер,
		|	ОбъектРасчетов,
		|	Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыСКлиентамиОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	РасчетыСКлиентамиОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
		|	РасчетыСКлиентамиОбороты.Валюта КАК Валюта,
		|	РасчетыСКлиентамиОбороты.СуммаОборот КАК СуммаОборот,
		|	РасчетыСКлиентамиОбороты.КОплатеОборот КАК КОплатеОборот,
		|	РасчетыСКлиентамиОбороты.КОтгрузкеОборот КАК КОтгрузкеОборот,
		|	РасчетыСКлиентамиОбороты.ОтгружаетсяОборот КАК ОтгружаетсяОборот
		|ПОМЕСТИТЬ ВТ_РасчетыСКлиентами
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Обороты(
		|			,
		|			,
		|			,
		|			(АналитикаУчетаПоПартнерам.Партнер, АналитикаУчетаПоПартнерам.Контрагент, АналитикаУчетаПоПартнерам.Организация //Ошибка №3
		|, ОбъектРасчетов) В
		|				(ВЫБРАТЬ
		|					ВТ_ДанныеЗаказовКлиента.Партнер КАК Партнер,
		|					ВТ_ДанныеЗаказовКлиента.Контрагент КАК Контрагент,
		|					ВТ_ДанныеЗаказовКлиента.Организация КАК Организация,
		|					ВТ_ДанныеЗаказовКлиента.ОбъектРасчетов КАК ОбъектРасчетов
		|				ИЗ
		|					ВТ_ДанныеЗаказовКлиента КАК ВТ_ДанныеЗаказовКлиента)) КАК РасчетыСКлиентамиОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыСКлиентамиПланОтгрузокОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	РасчетыСКлиентамиПланОтгрузокОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
		|	РасчетыСКлиентамиПланОтгрузокОбороты.ДокументПлан КАК ДокументПлан,
		|	РасчетыСКлиентамиПланОтгрузокОбороты.Валюта КАК Валюта,
		|	РасчетыСКлиентамиПланОтгрузокОбороты.СуммаОборот КАК СуммаОборот
		|ПОМЕСТИТЬ ВТ_ПланОтгрузок
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПланОтгрузок.Обороты(
		|			,
		|			,
		|			,
		|			(ДокументПлан, ОбъектРасчетов) В
		|				(ВЫБРАТЬ
		|					ВТ_ДанныеЗаказовКлиента.Ссылка КАК Ссылка,
		|					ВТ_ДанныеЗаказовКлиента.ОбъектРасчетов КАК ОбъектРасчетов
		|				ИЗ
		|					ВТ_ДанныеЗаказовКлиента КАК ВТ_ДанныеЗаказовКлиента)) КАК РасчетыСКлиентамиПланОтгрузокОбороты
		|;
		|
		//
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	ВТ_РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
		|	ВТ_РасчетыСКлиентами.Валюта КАК Валюта,
		|	ВТ_РасчетыСКлиентами.СуммаОборот КАК СуммаОборот,
		|	ВТ_РасчетыСКлиентами.КОплатеОборот КАК КОплатеОборот,
		|	ВТ_РасчетыСКлиентами.КОтгрузкеОборот КАК КОтгрузкеОборот,
		|	ВТ_РасчетыСКлиентами.ОтгружаетсяОборот КАК ОтгружаетсяОборот,
		|	ВТ_ДанныеЗаказовКлиента.Номенклатура КАК Номенклатура,
		|	ВТ_ДанныеЗаказовКлиента.Характеристика КАК Характеристика,
		|	ВТ_ДанныеЗаказовКлиента.Упаковка КАК Упаковка,
		|	ЕСТЬNULL(ВТ_ДанныеЗаказовКлиента.Ссылка, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК ЗаказКлиента //Контроль отсутствия ошибки, условие №4
		|ПОМЕСТИТЬ ВТ_РасчетыСКлиентамиРасш
		|ИЗ
		|	ВТ_РасчетыСКлиентами КАК ВТ_РасчетыСКлиентами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеЗаказовКлиента КАК ВТ_ДанныеЗаказовКлиента
		|		ПО ВТ_РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Партнер = ВТ_ДанныеЗаказовКлиента.Партнер //Ошибка №2
		|			И ВТ_РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент = ВТ_ДанныеЗаказовКлиента.Контрагент //Ошибка №2
		|			И ВТ_РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация = ВТ_ДанныеЗаказовКлиента.Организация //Ошибка №2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасчетыСКлиентамиРасш.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	ВТ_РасчетыСКлиентамиРасш.ОбъектРасчетов КАК ОбъектРасчетов,
		|	ВТ_РасчетыСКлиентамиРасш.ЗаказКлиента КАК ЗаказКлиента,
		|	ВТ_РасчетыСКлиентамиРасш.Номенклатура КАК Номенклатура,
		|	ВТ_РасчетыСКлиентамиРасш.Характеристика КАК Характеристика,
		|	ВТ_РасчетыСКлиентамиРасш.Упаковка КАК Упаковка,
		|	ВЫРАЗИТЬ(ВТ_ПланОтгрузок.ДокументПлан КАК Документ.ЗаказКлиента).Валюта КАК ВалютаДокумента, //Контроль отсутствия ошибки, условие №5
		|	ВЫРАЗИТЬ(ВТ_ПланОтгрузок.ДокументПлан КАК Документ.ЗаказКлиента).Валюта.Наценка КАК НаценкаВалюыДокумента //Ошибка №6
		|ИЗ
		|	ВТ_РасчетыСКлиентамиРасш КАК ВТ_РасчетыСКлиентамиРасш
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПланОтгрузок КАК ВТ_ПланОтгрузок
		|		ПО ВТ_РасчетыСКлиентамиРасш.АналитикаУчетаПоПартнерам = ВТ_ПланОтгрузок.АналитикаУчетаПоПартнерам
		|			И ВТ_РасчетыСКлиентамиРасш.ОбъектРасчетов = ВТ_ПланОтгрузок.ОбъектРасчетов
		|			И ВТ_РасчетыСКлиентамиРасш.ЗаказКлиента = ВТ_ПланОтгрузок.ДокументПлан";

		Запрос.УстановитьПараметр("КонецПериода", КонецГода(ТекущаяДата()));
		Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ТекущаяДата()));

		РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	КонецПроцедуры;

	//Итоговое ожидаемое количество срабатываний:
	//Номер тест кейса | Число срабатываний
	// №1 | 4
	// №2 | 3
	// №3 | 3
	// №4 | 0
	// №5 | 0
	// №6 | 1
	// №7 | 1
	//Итого: 12

