ТекстЗапроса =
"ВЫБРАТЬ ССЫЛКА
|ИЗ Справочник.Контрагенты";

ТекстЗапросаОшибка1 =
"ВЫБРАТЬ
|ИЗ Справочник.Контрагенты как";

ТекстЗапросаОшибка2 =
"ВЫБРАТЬ Поле
|ИЗ Справочник.Контрагенты КАК Контрагенты ЛЕВОЕ СОЕДИНЕНИЕ "
+ "Документ.Накладная ПО Контрагенты.Ссылка = Покупатель";

ТекстЗапросаОшибка3 =
"ВЫБРАТЬ Поле
|ИЗ Справочник.Контрагенты КАК Контрагенты
|ЛЕВОЕ СОЕДИНЕНИЕ
|Документ.Накладная ПО Контрагенты.Ссылка = Покупатель
|ГДЕ
| Условие >";

ТекстЗапросаОшибка4 =
"ВЫБРАТЬ Поле
|ИЗ Справочник.Контрагенты КАК Контрагенты
|ЛЕВОЕ СОЕДИНЕНИЕ
|Документ.Накладная ПО Контрагенты.Ссылка = Покупатель
|;
|ВЫБРАТЬ Поле
|ИЗ
|";

ТекстНеЗапроса5 =
"ВЫБРАТЬ значение?";

ТекстНеЗапроса6 =
"Вам нужно выбрать значение из списка";
