Процедура Тест()

    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ Файлы.Файл.Ссылка, // ошибка
                    | Файлы.Файл
                    | ИЗ
                    | СлужебныеФайлы КАК Файлы";
КонецПроцедуры

Процедура Тест2()
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   СлужебныеФайлы.Файл.Ссылка КАК Ссылка, // ошибка
    |   СлужебныеФайлы.Владелец.Ссылка КАК Владелец // ошибка
    |ИЗ
    |   РегистрСведений.СлужебныеФайлы КАК СлужебныеФайлы
    |ГДЕ
    |   СлужебныеФайлы.Отношение = ЗНАЧЕНИЕ(Перечисление.ОтношенияСлужебныхФайлов.ВизуализацияЭП)";
КонецПроцедуры

Процедура Тест3()
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   Ссылка.Ссылка КАК Ссылка, // ошибка
    |   СлужебныеФайлы.Владелец КАК Владелец
    |ИЗ
    |   РегистрСведений.СлужебныеФайлы КАК СлужебныеФайлы
    |ГДЕ
    |   СлужебныеФайлы.Отношение = ЗНАЧЕНИЕ(Перечисление.ОтношенияСлужебныхФайлов.ВизуализацияЭП)";
КонецПроцедуры
