Процедура Тест1(Знач Парам1) // ошибка
    Парам1 = 10;
КонецПроцедуры

Процедура Тест2(Парам21, Знач Парам22) // не ошибка
    Парам21 = 10;
КонецПроцедуры

Процедура Тест3(Знач Парам31 = 1, Знач Парам32 = 2 ) // ошибка
    Парам31 = 3;
КонецПроцедуры

Процедура Тест4(Знач Парам41) // не ошибка
    Парам41 = Парам41;
КонецПроцедуры

Процедура Тест5(Знач Парам51) // не ошибка
    Парам51 = Метод(Парам51);
КонецПроцедуры

Процедура Тест6(Знач Парам61) // ошибка
    Парам61 = Парам61;
    Парам61 = 12;
КонецПроцедуры

Процедура Тест7(Знач Парам71) // ошибка
    Парам71 = Парам71;
    Парам71 = Парам71;
    Парам71 = Парам71;
    Парам71 = 12;
КонецПроцедуры

Процедура Тест8(Знач Парам81) // для покрытия
    ЛокальнаяПеременная = 10;
КонецПроцедуры

