// Это хороший комментарий, с пробелом
//  Это хороший комментарий, с табом
//      Этот комментарий тоже норм

Перем1 = 7; // И это нормальный

//Плохой комментарий

Перем1 = 7; //И это плохой
                //Так тоже плохо

//@skip-warring Пропускаем замечания в EDT

//@unit-test Аннотациия для юниттестов в EDT

//(c) Это строка с копирайтом

// Строка ниже используется как разделитель
/////////////////////////////////////////////////////////////////////////////////

//(с) Похоже на строку с копирайтом, но С - на кириллице

//// Плохой комментарий, т.к. он двойной, но пусть будет

// Строка ниже используется как разделитель с пробелом в конце
/////////////////////////////////////////////////////////////////////////////////

// Это рамка копирайта
//©///////////////////////////////////////////////////////////////////////////©//

//&НаКлиенте
//Процедура МояПроцедура(Параметр1)
//КонецПроцедуры

/// Текст без ошибки
////Текст с ошибкой