&ИзменениеИКонтроль
Процедура СИзменением()

#Удаление
    старый код
#КонецУдаления
#Вставка
    // какой-то код
#КонецВставки

КонецПроцедуры

Процедура БезИзменения()

#Вставка
    // какой-то код
#КонецВставки

КонецПроцедуры

&ИзменениеИКонтроль
Функция ФункцияСИзменением()

    // оригинальный код

#Удаление
    удаляемый блок
#КонецУдаления
#Вставка
    // код
#КонецВставки

КонецФункции

Процедура ПустаяПроцедура()
    // нет вставки
КонецПроцедуры

&ИзменениеИКонтроль
Процедура НеполнаяПара()

#Удаление
    старый код
#Вставка
    // код
#КонецВставки

КонецПроцедуры

&ИзменениеИКонтроль
Процедура СКодомМеждуБлоками()

#Удаление
    старый код
#КонецУдаления

    ОбработчикМеждуБлоками();

#Вставка
    // код
#КонецВставки

КонецПроцедуры
