
ПериодПо = ?(Шапка.ЭтоУвольнение
           , Шапка.Дата
           , ?(Шапка.ЭтоАванс
             , Дата(Год(Шапка.ПериодРегистрации)
                   , Месяц(Шапка.ПериодРегистрации)
                   , 15
                   )
             , КонецМесяца(Шапка.ПериодРегистрации)
             )
            );

Статус = ?(ПолучитьСкидку() > МаксимальныйПроцент, "Особый клиент", "Обычный клиент");

Если ?(ПолучитьСкидку() > МаксимальныйПроцент, Истина, Ложь) Тогда
    Возврат Истина;
Иначе
    Возврат Ложь;
КонецЕсли;