&НаКлиенте
Процедура Клиент1()
    Сервер1(2);
КонецПроцедуры

&НаСервере
Процедура Сервер1(Парам1) // ошибка
    Метод(Парам1);
КонецПроцедуры

&НаКлиенте
Процедура Клиент2()
    Сервер2(2);
КонецПроцедуры

&НаСервере
Процедура Сервер2(Знач Парам1) // не ошибка
КонецПроцедуры

&НаКлиенте
Процедура Клиент3()
    Сервер3(2);
КонецПроцедуры

&НаСервере
Процедура Сервер3(Парам1) // не ошибка
    Парам1 = 10;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура КлиентСервер4(Парам1) // не ошибка
    Сервер4(2);
КонецПроцедуры

&НаСервере
Процедура Сервер4(Парам1) // не ошибка
    ЕщеМетод(Парам1);
КонецПроцедуры

&НаСервере
Процедура Метод(Парам1)
КонецПроцедуры

&НаСервере
Процедура ЕщеМетод(Парам1)
КонецПроцедуры
