Запрос = Новый Запрос(
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
    |   Справочник1.Поле1 КАК Поле1,
    |   1 КАК Поле2,
    |   Справочник1.Поле3 КАК Поле3
    |ИЗ
    |   Справочник.Справочник1 КАК Справочник1
    |ГДЕ
    |	Справочник1.Ссылка = &Ссылка1
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ ПЕРВЫЕ 1
    |   Справочник2.Поле1 КАК Поле1,
    |   2 КАК Поле2,
    |   Справочник2.Поле3 КАК Поле3
    |ИЗ
    |	Справочник.Справочник2 КАК Справочник2
    |ГДЕ
    |	Справочник2.Ссылка = &Ссылка2
    |
    |ОБЪЕДИНИТЬ
    |
    |ВЫБРАТЬ ПЕРВЫЕ 1
    |   Справочник3.Поле1 КАК Поле1,
    |	3 КАК Поле2,
    |	Справочник3.Поле3 КАК Поле3
    |ИЗ
    |	Справочник.Справочник3 КАК Справочник3
    |ГДЕ
    |   Справочник3.Ссылка = &Ссылка3"
);

Запрос = Новый Запрос(
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
    |   Справочник1.Поле1 КАК Поле1,
    |   1 КАК Поле2,
    |   Справочник1.Поле3 КАК Поле3,
    |   ЕСТЬNULL(НачислениеЗарплатыМонтажникамОбороты.Заявка.Адрес, """") КАК Поле4
    |ИЗ
    |   Справочник.Справочник1 КАК Справочник1
    |ГДЕ
    |	Справочник1.Ссылка = &Ссылка1
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ ПЕРВЫЕ 1
    |   Справочник2.Поле1 КАК Поле1,
    |   2 КАК Поле2,
    |   Справочник2.Поле3 КАК Поле3,
    |   ЕСТЬNULL(НачислениеЗарплатыМонтажникамОбороты.Заявка.Адрес, """") КАК Поле4
    |ИЗ
    |	Справочник.Справочник2 КАК Справочник2
    |ГДЕ
    |	Справочник2.Ссылка = &Ссылка2
    |
    |ОБЪЕДИНИТЬ
    |
    |ВЫБРАТЬ ПЕРВЫЕ 1
    |   Справочник3.Поле1 КАК Поле1,
    |	3 КАК Поле2,
    |	Справочник3.Поле3 КАК Поле3,
    |   ЕСТЬNULL(НачислениеЗарплатыМонтажникамОбороты.Заявка.Адрес, """") КАК Поле4
    |ИЗ
    |	Справочник.Справочник3 КАК Справочник3
    |ГДЕ
    |   Справочник3.Ссылка = &Ссылка3"
);