Процедура Тест()
    Если БезопасныйРежим() ИЛИ Тест = Истина Тогда  // Срабатывание
         // Логика выполнения в безопасном режиме...
    ИначеЕсли Не БезопасныйРежим() Тогда // Срабатывание
        // Логика выполнения в небезопасном режиме...
    КонецЕсли;

    Если Не БезопасныйРежим() Тогда // Срабатывание
         // Логика выполнения в небезопасном режиме...
    КонецЕсли;

    Если БезопасныйРежим() <> Ложь Тогда // Нет срабатывания
        // Логика выполнения в безопасном режиме...
    КонецЕсли;

    Если Тест() ИЛИ Тест = Истина Тогда  // Нет срабатывания
        // код
    КонецЕсли;

    Если Истина Тогда
        Перем1 = БезопасныйРежим();  // Нет срабатывания
        Перем1 = Метод(БезопасныйРежим());  // Нет срабатывания
    КонецЕсли;

    Если Условие И (Условие2 Или БезопасныйРежим()) Тогда // Есть срабатывание
    КонецЕсли;
КонецПроцедуры