Процедура Тест()
    Если БезопасныйРежим() ИЛИ Тест = Истина Тогда  // Срабатывание
         // Логика выполнения в безопасном режиме...
    ИначеЕсли Не БезопасныйРежим() Тогда // Срабатывание
        // Логика выполнения в небезопасном режиме...
    КонецЕсли;

    Если Не БезопасныйРежим() Тогда // Срабатывание
         // Логика выполнения в небезопасном режиме...
    КонецЕсли;

    Если Условие И (Условие2 Или БезопасныйРежим()) Тогда // Есть срабатывание
    КонецЕсли;

    ФинальноеУсловие = Условие И (Условие2 Или БезопасныйРежим());  // Есть срабатывание

    ФинальноеУсловие = Условие И (Условие2 Или Не БезопасныйРежим());  // Есть срабатывание

    ФинальноеУсловие = Условие И (БезопасныйРежим() Или Условие2);  // Есть срабатывание

    Если Условие И (Условие2 И Не БезопасныйРежим())) Тогда // Есть срабатывание
    КонецЕсли;

    Если Условие И (БезопасныйРежим() И Условие)) Тогда // Есть срабатывание
    КонецЕсли;

    Если БезопасныйРежим() Тогда //Есть срабатывание
        // Логика выполнения в безопасном режиме...
    КонецЕсли;

    Если БезопасныйРежим() <> Ложь Тогда // Нет срабатывания
        // Логика выполнения в безопасном режиме...
    КонецЕсли;

    Если Тест() ИЛИ Тест = Истина Тогда  // Нет срабатывания
        // код
    КонецЕсли;

    Если Истина Тогда
        Перем1 = БезопасныйРежим();  // Нет срабатывания

        Перем2 = Метод(БезопасныйРежим());  // Нет срабатывания
    КонецЕсли;

    ФинальноеУсловие1 = Условие1 И (Условие12 Или БезопасныйРежим() = Истина);  // Нет срабатывания

    ФинальноеУсловие2 = Условие2 И (Ложь <> БезопасныйРежим() Или Условие2);  // Нет срабатывания

КонецПроцедуры