#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ПодразделениеКомпании Экспорт;
Перем ДокументОбъект Экспорт;
Перем РежимПроведения Экспорт; // Ошибка

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция Приход() Экспорт

    Перем Кэш, Кэш2; // Ошибка на первой переменной
	Результат = Истина;
	ТекстОшибки = ""; // Ошибка

	// Найдем коэффициент пересчета из управленческой валюты в валюту регл.учета
	УпрВал = РаботаСКурсамиВалют.ПолучитьКурсВалюты(
	    Константы.ВалютаУправленческогоУчетаКомпании.Получить(),
	    ДокументОбъект.Дата
	);
	РегВал = РаботаСКурсамиВалют.ПолучитьКурсВалюты(
	    Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(),
	    ДокументОбъект.Дата
	);
	Коэффициент = (УпрВал.Курс / УпрВал.Кратность) / (РегВал.Курс / РегВал.Кратность);

    Запрос = Новый Запрос;
    Запрос.Текст = "Тут какой-то текст запроса";
    Запрос.Установить("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект);
	Запрос.УстановитьПараметр("Коэффициент", Коэффициент);

	Загрузить(Запрос.Выполнить().Выгрузить());

	ДокументОбъект = Кэш2;
	Возврат Результат;

КонецФункции

Функция Пример()

    МояПеременная = 1;
    МояПеременная = МояПеременная + 1; // Тут ошибка

    Сч = 1;

    Пока Сч < 10 Цикл

        Сч = Сч + 1; // Тут будет FP подумать как обходить

    КонецЦикла;

КонецФункции

Процедура Расход(Отказ)

    Отказ = Истина;
    ЭтоНеПараметр = Ложь; // Ошибка


КонецПроцедуры

#КонецОбласти

#КонецЕсли

