
Процедура НеИспользуется() // Тут
КонецПроцедуры





Процедура НеИспользуетсяЭкспорт() Экспорт
КонецПроцедуры

Процедура ИспользуетсяВОсновномТеле() 
КонецПроцедуры

Процедура ИспользуетсяВМетоде()
КонецПроцедуры

Процедура ИспользуетсяВУсловии()
КонецПроцедуры

Функция ИспользуетсяВПрисвоении()
КонецФункции

Функция ИспользуетсяВПарметре()
КонецФункции

Функция ИспользуетсяВПарметреПриПрисвоении()
КонецФункции

Функция СВызовами(Параметры)

	ИспользуетсяВМетоде();
	B = ИспользуетсяВПрисвоении();
	
КонецФункции	

Функция СВызовами2()

	Если ИспользуетсяВУсловии() Тогда
	КонецЕсли;	
	
	ГлобальныйМетод(ИспользуетсяВПарметре());
	А = СВызовами(ИспользуетсяВПарметреПриПрисвоении());
	
КонецФункции	

Процедура Подключаемый_КакойтоОбработчик()
КонецПроцедуры

Процедура Attachable__КакойтоОбработчик()
КонецПроцедуры

Процедура ПриСозданииОбъекта(Параметр1)

КонецПроцедуры

ИспользуетсяВОсновномТеле();
СВызовами();
СВызовами2();
