Перем Поле;

Для Каждого Итератор Из Коллекция Цикл // Сработать Итератор неиспользуется в теле цикла
	Итератор();
КонецЦикла;	

Для Каждого А Из Б Цикл
	КакойТОМетод(а);
КонецЦикла;	

Для Каждого А Из Б Цикл 
	В = А;	
КонецЦикла;	

Для Каждого А Из Б Цикл
	А = Истина;
КонецЦикла;

Для Каждого А Из Б Цикл
	 А.Свойство = 1;
КонецЦикла;

Для Каждого А Из Б Цикл
	 Если А Тогда
	 КонецЕсли;
КонецЦикла;

Для Каждого Объект Из Б Цикл
    Объект.Метод();
КонецЦикла;

Для Каждого АСтруктура Из Б Цикл
    АСтруктура.Ключ.Метод();
КонецЦикла;

Для Каждого Поле Из Б Цикл
    КакойтоМетод();
КонецЦикла;
