Функция ТипТекущейПлатформы() Экспорт
    СистемнаяИнформация = Новый СистемнаяИнформация; // Range(1, 26, 1, 51)
    Возврат СистемнаяИнформация.ТипПлатформы;
КонецФункции

СистемнаяИнформация = Новый СистемнаяИнформация();   // Range(5, 22, 5, 49)
СистемнаяИнформация = Новый("СистемнаяИнформация");  // Range(6, 22, 6, 50)
СистемнаяИнформация = Новый SystemInfo;              // Range(7, 22, 7, 38)
СистемнаяИнформация = Новый("SystemInfo");           // Range(8, 22, 8, 41)
СистемнаяИнформация = Новый("СистемнаяИнформация2");

ИмяТипа = "СистемнаяИнформация";
СистемнаяИнформация = Новый(ИмяТипа);