&НаСервере
Функция ФункцияСОшибкой()

    ГлобалтныйМетод(ЭтаФорма);
    Модуль.Метод("Проверка", ЭтаФорма);
    ЭтаФорма.Закрыть();
    Возврат ЭтаФорма;

КонецФункции

&НаСервере
Процедура ФункцияСОшибкой(Параметр)

    НовыйЭлемент = ЭтаФорма.Элементы.Добавить();
    ГлобалтныйМетод(ЭтаФорма.Элементы, НовыйЭлемент);
    ЗначениеПеременной = Чтото + ЭтаФорма.ЧисловойРеквизит;
    Возврат ЭтаФорма.Элементы;

КонецПроцедуры

&НаСервере
Функция ФункцияСПараметром(ЭтаФорма)

    ГлобалтныйМетод(ЭтаФорма);
    Модуль.Метод("Проверка", ЭтаФорма);
    ЭтаФорма.Закрыть();
    Возврат ЭтаФорма;

КонецФункции

&НаСервере
Процедура ФункцияСПараметром(ЭтаФорма)

    ГлобалтныйМетод(ЭтаФорма);
    Модуль.Метод("Проверка", ЭтаФорма);
    ЭтаФорма.Закрыть();
    Возврат ЭтаФорма;

КонецПроцедуры