Функция Обработчик(Параметр1, Параметр2, Отказ, Параметр4)
    Отказ = Истина;
    Возврат А;
КонецФункции

Функция Обработчик(Параметр21, Параметр22, ОТказ, Параметр24)
    Если Истина Тогда
        ОТказ = Ложь; //Раз
        F =1;
    КонецЕсли;
    Возврат А;
КонецФункции

Функция Обработчик(Параметр31, Параметр32, cancEl = Ложь, Параметр34)
    canceL = Метод(cancel); //Два
    F =1;
    Возврат А;
КонецФункции

Функция Обработчик(Параметр41, Параметр42, Параметр43)
    Отказ = Ложь;
    Если  Метод(Отказ) Тогда
        Отказ = Истина;
    КонецЕсли;
     F = Истина;
    Возврат А;
КонецФункции

Функция Обработчик(Параметр51, Параметр52, Параметр53)
    Отказ = Ложь;
    Отказ = Метод(Отказ); //Три
    Возврат А;
КонецФункции

Функция Обработчик(Параметр61, Параметр62, Параметр63)
    Отказ = Метод(Отказ);
    Возврат А;
КонецФункции

Функция Обработчик(Параметр71, Параметр72, Отказ, Параметр73)
    Отказ = Отказ ИЛИ ОбработатьПараметрыЗапуска(ПараметрыЗапуска);
    Отказ = ОбработатьПараметрыЗапуска(ПараметрыЗапуска) ИЛИ Отказ;
    Отказ = ОбработатьПараметрыЗапуска(ПараметрыЗапуска) = Отказ;
    Отказ = ОбработатьПараметрыЗапуска(ПараметрыЗапуска) И Отказ;
    Отказ = Отказ И ОбработатьПараметрыЗапуска(ПараметрыЗапуска);
    Отказ = ОбработатьПараметрыЗапуска(ПараметрыЗапуска) И А И Отказ;

    Отказ = (ОбработатьПараметрыЗапуска(ПараметрыЗапуска) И А) ИЛИ отказ;
    Отказ = Отказ ИЛИ (ОбработатьПараметрыЗапуска(ПараметрыЗапуска) И А);

    Возврат А;
КонецФункции
