
// IP адреса
СетевойАдрес = "232.252.181.67"; // <-- ошибка
НеСетевойАдрес = "22.00";
НеСетевойАдресЕще = "10.10.2010";
МассивАдресов = Новый Массив();
МассивАдресов.Добавить("160.211.46.126"); // <-- ошибка
МассивАдресов.Добавить("127.0.0.1"); // <-- ошибка
МассивАдресов.Добавить("300.300.300.300");
МассивАдресов.Добавить("da52:04d9:f9fc:8c45:7180:332d:527f:0c08"); // <-- ошибка
МассивАдресов.Добавить("6885:e6fb:e56e:f46c:2da2:a736:f9dc:68b6"); // <-- ошибка
Структура = Новый Структура("СетевойАдрес", "6dd7:1388:7fa1:-:d0af:bb82:0eaf:2225");
Структура = Новый Структура("СетевойАдрес", "6dd7:1388:7fa1:783d:d0af:bb82:0eaf:2225"); // <-- ошибка
Обработчики = Новый ТаблицаЗначений;
Обработчики.Колонки.Добавить("Версия");
Обработчик = Обработчики.Добавить();
Обработчик.Версия = "1.1.1.2";
МассивВерсий = Новый Массив;
МассивВерсий.Добавить("3.1.10.155");
СписокIP = Новый Массив;
СписокIP.Добавить("10.4.10.1"); // <-- ошибка

Тест = "(.*<transportConnector name=\"")(.*)(\"" uri=\""tcp://0.0.0.0:61616\?maximumConnections=1000&amp;wireFormat.maxFrameSize=104857600\""/>)"; // <-- ошибка
Тест = "_to_SRVMIX"" uri=""static:(tcp://10.1.4.55:61616)"" duplex=""true"" UserName=""system"" Password=""manager""/>"; // <-- ошибка

ЗапуститьПриложение("ping -n 60 127.0.0.1 >nul", , Истина);

// исключаем "Драйвер"
Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
	Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикККСДисплеиПокупателя,
	"AddIn.VFCD220E", "ДрайверККСДисплеиПокупателя", Ложь, "1.0.1.1");

Разрешение = ФабрикаXDTO.Создать(
	ФабрикаXDTO.Тип(
		"http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/1.0.0.1", // игнорим
		РазрешениеВДанных.ВидРазрешения
	)
);

КакойТоКлассификатор = "1.2.3.4.5.6.7.8";

Субъект.Вставить("РНСФСС", Строка(Свойства["OID.1.2.643.3.141.1.1"]));

СвойстваНаселенныйПункт.Добавить("2.5.4.7"); // <- игнорим

СтрокаСообщения = НСтр("ru = '%1
  |Параметры синхронизации данных для этой программы:
  |========================================================
  |%2%3Префикс информационной базы: %4
  |
  |Параметры синхронизации данных для другой программы:: // <-- игнорим
  |========================================================
  |%5%6Префикс информационной базы: %7'");

FoundedElement = HTMLDocument.evaluate(".//img[ancestor::div[@aria-hidden=""False""]]", HTMLDocument.body, null, 0, null).iterateNext(); // <-- игнорим
Правильный = "::1" // <-- ошибка

Функция ПодготовитьСведенияОВнешнейОбработке(Вид, Назначение, Наименование, Версия, Информация, Адрес = "8.8.8.10", ВерсияБСП = "1.2.1.4", РассылкаОтчетов = Ложь) Экспорт // <-- 1 ошибка 1 игнор
КонецФункции

Функция ВерсияБиблиотеки() Экспорт
    Возврат "2.9.4.0";
КонецФункции

Функция ВерсияБиблиотеки() Экспорт
    ip = "10.10.10.55"; // <-- 1 ошибка
КонецФункции

СписокПараметров.Добавить("2.5.4.10", Поля.O);
ПараметрыРегистрации = Модуль.СведенияОВнешнейОбработке("2.1.3.1");

ДНС = "8.8.8.8"; // <- ошибка
ПроизвольнаяВерсияСВосьмеркиИТройки = "8.3.10.1";
