// Тестовый модуль для проверки служебных тегов в комментариях
// TODO: удалить после внедрения БСП
Функция СкопироватьСтруктуру(ВходящаяСтруктура)

	Если ТипЗнч(ВходящаяСтруктура) <> Тип("Структура") Тогда
		Возврат Новый Структура;
	КонецЕсли;

	НоваяСтруктура = Новый Структура;
	Для Каждого КлючЗначение Из ВходящаяСтруктура Цикл
		НоваяСтруктура.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;

	// FIXME: Добавиить новое значение в структуру
	// НоваяСтруктура.Вставить("Тест", "TODO");
	Возврат НоваяСтруктура;

КонецФункции

// Просто описание функции
Функция ВернутьЗначение()
    // TODO: просто проверка?
    Возврат 1;
КонецФункции