
Перем Пароль;
Перем Password;

Процедура ХардкодимПароль()

    КакаяТоСтруктура = Новый Структура;
    КакаяТоСтруктура.Вставить("Логин", "Петька");
    КакаяТоСтруктура.Вставить("Пароль", "12345"); // <-- Уязвимость
    КакаяТоСтруктура.Вставить("Пароль", "");
    КакаяТоСтруктура.Вставить("Пароль", Неопределено);

    ВтораяСтруктура = Новый Структура("Первое, Пароль, Компот", 1, "qwerty", ""); // <-- Уязвимость

    ТретьяСтруктура = Новый Структура("Пароль", Неопределено);

    Пароль = "12345670"; // <-- Уязвимость
    Password = "qwerty"; // <-- Уязвимость

    Пароль = Неопределено;
    Password = Undefined;
    // Пароль = "123";
    // Это называется Пароль?
    НеПароль = "123";
    Пороль = "Истина";

    Map = New Map();
    Map.Insert("Password", "1234"); // <-- Уязвимость

    Данные = Новый Структура("Логин, Пароль");
    Данные.Пароль = Неопределено;
    Данные.Пароль = "";
    Данные.Пароль = "12345"; // <-- Уязвимость
    Данные["Пароль"] = "qwerty"; // <-- Уязвимость

    Пароль = "" + ВернутьПароль(); // пока не сработает
    Пароль = "134" + ВернутьПароль(); // пока не сработает

    НоваяСтрока = ВтораяСтруктура.Первое + "%" + ВтораяСтруктура.Пароль + "@";

    ДанныеУровень2 = Новый Структура("Пароль");
    Данные = Новый Структура("Аутентификация", ДанныеУровень2);
    Данные["Аутентификация"]["Пароль"] = ВтораяСтруктура.Пароль + "@";

    СоединениеHTTP = Новый HTTPСоединение("Сервер", 8080, "Пользователь", "12345"); // <-- Уязвимость
    СоединениеFTP = Новый FTPСоединение("Сервер", 80, "Пользователь", "dfdfdf"); // <-- Уязвимость
    СоединениеHTTP = Новый HTTPСоединение("Сервер", 8080);

    Пароль = "*12345*"; // <-- Уязвимость
    Пароль = "*12345"; // <-- Уязвимость
    Пароль = "12345*"; // <-- Уязвимость
    Пароль = "******";
    Пароль = "*";

КонецПроцедуры

Функция ВернутьПароль()
    Возврат "Пароль?";
КонецФункции

Пароль = "";
Password = "";
ХардкодимПароль();

Элементы["Пароль"]["Заголовок"] = "Пароль";
Элементы.Пароль.Заголовок = "Пароль";