Процедура Тест()
    ТекстЗапроса =
    "ВЫБРАТЬ
    |   Таблица.Поле1,
    |   Таблица.Поле1 ПОДОБНО ""Строка"" КАК Поле2,             // <-- Ошибка
    |   Таблица.Поле1 ПОДОБНО &Параметр КАК Поле3,              // <-- Ошибка
    |   Таблица.Поле1 ПОДОБНО Таблица.Поле99 КАК Поле4,         // <-- Ошибка
    |   ""Строка"" ПОДОБНО ((((Таблица.Поле1)))) КАК Поле5,     // <-- Ошибка
    |   &Параметр ПОДОБНО Таблица.Поле1 КАК Поле6,              // <-- Ошибка
    |   &Параметр ПОДОБНО &Параметр2 КАК Поле7,                 // <-- Ошибка
    |   &Параметр ПОДОБНО ""Строка"" КАК Поле8,                 // <-- Ошибка
    |   &Параметр ПОДОБНО ПОДСТРОКА(""Строка"", 1, 1) КАК Поле9 // <-- Ошибка
    |ИЗ
    |   Документ.Документ КАК Таблица
    |   ЛЕВОЕ СОЕДИНЕНИЕ (
    |       ВЫБРАТЬ
    |          Таблица.Поле1,
    |          Таблица.Поле1 ПОДОБНО ""Строка"" КАК Поле2,      // <-- Ошибка
    |           Таблица.Поле1 ПОДОБНО &Параметр КАК Поле3,      // <-- Ошибка
    |           Таблица.Поле1 ПОДОБНО Таблица.Поле99 КАК Поле4, // <-- Ошибка
    |           ""Строка"" ПОДОБНО Таблица.Поле1 КАК Поле5,     // <-- Ошибка
    |           &Параметр ПОДОБНО Таблица.Поле1 КАК Поле6       // <-- Ошибка
    |       ИЗ
    |           Документ.Документ2 КАК Таблица) КАК Таблица2
    |       ПО Таблица.Поле1 ПОДОБНО Таблица2.Поле1             // <-- Ошибка
    |           И Таблица.Поле1 ПОДОБНО ""Строка""              // <-- Ошибка
    |           И Таблица.Поле1 ПОДОБНО &Параметр               // <-- Ошибка
    |           И &Параметр ПОДОБНО Таблица.Поле1               // <-- Ошибка
    |ГДЕ
    |   Таблица.Поле1 ПОДОБНО Таблица2.Поле1                    // <-- Ошибка
    |   И Таблица.Поле1 ПОДОБНО ""Строка""                      // <-- Ошибка
    |   И Таблица.Поле1 ПОДОБНО &Параметр                       // <-- Ошибка
    |   И &Параметр ПОДОБНО Таблица.Поле1";                     // <-- Ошибка

КонецПроцедуры
