// Тестовый модуль для проверки служебных тегов в комментариях
// TODO: удалить после внедрения БСП
Функция СкопироватьСтруктуру(ВходящаяСтруктура)
    
    Если ТипЗнч(ВходящаяСтруктура) <> Тип("Структура") Тогда
        Возврат Новый Структура;
    КонецЕсли;
    
    НоваяСтруктура = Новый Структура;
    Для Каждого КлючЗначение Из ВходящаяСтруктура Цикл
        НоваяСтруктура.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
    КонецЦикла;
    
    // FIXME: Добавиить новое значение в структуру
    // НоваяСтруктура.Вставить("Тест", "TODO");
    Возврат НоваяСтруктура;
    
КонецФункции

// Просто описание функции
Функция ВернутьЗначение()
    // TODO: просто проверка?
    Возврат 1;
КонецФункции

// !!!_nik: Такой-то текст
Процедура ПроверочнаяПроцедура() // !!_nik: Такой-то текст
    
    // @nik
    ЧтоТо = Истина; // отладка
    
    // debug
    Если ЧтоТо Тогда // отладка
        
        // дляотладки
        
    КонецЕсли;
    
КонецПроцедуры

Процедура ПроверочнаяФункция()
    
    //{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
    // Данный фрагмент построен конструктором.
    // При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |	Автомобили.Ссылка КАК Ссылка
        |ИЗ
        |	Справочник.Автомобили КАК Автомобили";
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        // Вставить обработку выборки ВыборкаДетальныеЗаписи
    КонецЦикла;
    
    //}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
    
КонецПроцедуры

//{{MRG[  ]
//            ПредставлениеПодразделения = Подразделение.Наименование;
//}}MRG[  ]

// Просто описание функции
Функция ВернутьВтороеЗначение()
    // для отладки: просто проверка?
    Возврат 1;
КонецФункции