
Перем Пароль;
Перем Password;

Процедура ХардкодимПароль()

    КакаяТоСтруктура = Новый Структура;
    КакаяТоСтруктура.Вставить("Логин", "Петька");
    КакаяТоСтруктура.Вставить("Пароль", "12345");
    КакаяТоСтруктура.Вставить("Пароль", "");
    КакаяТоСтруктура.Вставить("Пароль", Неопределено);

    ВтораяСтруктура = Новый Структура("Первое, Пароль, Компот", 1, "qwerty", "");

    ТретьяСтруктура = Новый Структура("Пароль", Неопределено);

    Пароль = "12345670";
    Password = "qwerty";

    Пароль = Неопределено;
    Password = Undefined;
    // Пароль = "123";
    // Это называется Пароль?
    НеПароль = "123";
    Пороль = "Истина";

    Map = New Map();
    Map.Insert("Password", "1234");

КонецПроцедуры

Пароль = "";
Password = "";
ХардкодимПароль();