// Виртуальная таблица каждого вида без параметров и с параметрами.

Функция ВиртуальнаяТаблица1()

    Возврат "ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    РегистрСведений.Курсы.СрезПервых КАК Т
    |;
    |ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    РегистрСведений.Курсы.СрезПервых(&Период) КАК Т";

КонецФункции

Функция ВиртуальнаяТаблица2()

    Возврат "ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    РегистрБухгалтерии.Хозрасчетный.Остатки КАК Т
    |;
    |ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    РегистрБухгалтерии.Хозрасчетный.Остатки(&Период) КАК Т";

КонецФункции

Функция ВиртуальнаяТаблица3()

    Возврат "ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    РегистрБухгалтерии.Хозрасчетный.Обороты КАК Т
    |;
    |ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    РегистрБухгалтерии.Хозрасчетный.Обороты(&Начало, &Конец) КАК Т";

КонецФункции

Функция ВиртуальнаяТаблица4()

    Возврат "ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты КАК Т
    |;
    |ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&Начало, &Конец) КАК Т";

КонецФункции

Функция ВиртуальнаяТаблица5()

    Возврат "ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто КАК Т
    |;
    |ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(&Начало, &Конец) КАК Т";

КонецФункции

Функция ВиртуальнаяТаблица6()

    Возврат "ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт КАК Т
    |;
    |ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&Начало, &Конец) КАК Т";

КонецФункции

Функция ВиртуальнаяТаблица7()

    Возврат "ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    РегистрРасчета.Начисления.ФактическийПериодДействия КАК Т
    |;
    |ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    РегистрРасчета.Начисления.ФактическийПериодДействия(Сотрудник = &Сотрудник) КАК Т";

КонецФункции

Функция ВиртуальнаяТаблица8()

    Возврат "ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    РегистрРасчета.Начисления.ДанныеГрафика КАК Т
    |;
    |ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    РегистрРасчета.Начисления.ДанныеГрафика(Сотрудник = &Сотрудник) КАК Т";

КонецФункции

Функция ВиртуальнаяТаблица9()

    Возврат "ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    Последовательность.Взаиморасчеты.Границы КАК Т
    |;
    |ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    Последовательность.Взаиморасчеты.Границы(Контрагент = &Контрагент) КАК Т";

КонецФункции

Функция ВиртуальнаяТаблица10()

    Возврат "ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    Задача.Поручение.ЗадачиПоИсполнителю КАК Т
    |;
    |ВЫБРАТЬ
    |    1 КАК Поле
    |ИЗ
    |    Задача.Поручение.ЗадачиПоИсполнителю(&Исполнитель) КАК Т";

КонецФункции
