// Табличные части, названные как виртуальные таблицы регистров, - не виртуальные таблицы.

Функция ТЧСправочника()

    Возврат "ВЫБРАТЬ
    |    Т.Склад КАК Склад
    |ИЗ
    |    Справочник.Партии.Остатки КАК Т
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |    Т.Склад
    |ИЗ
    |    Справочник.Партии.Обороты КАК Т
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |    Т.Склад
    |ИЗ
    |    Справочник.Партии.ОстаткиИОбороты КАК Т
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |    Т.Склад
    |ИЗ
    |    Справочник.Партии.СрезПоследних КАК Т";

КонецФункции

Функция ТЧДокументаИЗадачи()

    Возврат "ВЫБРАТЬ
    |    Т.Склад КАК Склад
    |ИЗ
    |    Документ.Инвентаризация.Остатки КАК Т
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |    Т.Склад
    |ИЗ
    |    Задача.Поручение.Остатки КАК Т";

КонецФункции

Function TabularSection()

    Return "SELECT
    |    T.Warehouse AS Warehouse
    |FROM
    |    Catalog.Batches.Balance AS T";

EndFunction

Функция ВиртуальныеТаблицыБезПараметров()

    Возврат "ВЫБРАТЬ
    |    Т.Склад КАК Склад
    |ИЗ
    |    РегистрНакопления.ТоварыНаСкладах.Остатки КАК Т
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |    Т.Исполнитель
    |ИЗ
    |    Задача.Поручение.ЗадачиПоИсполнителю КАК Т";

КонецФункции
