Процедура А()

// Выражение с ошибкой
Если 100 = ЙодаГоворит Тогда
КонецЕсли;

// Выражение с ошибкой
Если 100 + 10 = ЙодаГоворит Тогда
КонецЕсли;

// Выражение с ошибкой
Если "МолчитИода" = ЙодаГоворит Тогда
КонецЕсли;

// Корректное выражение
Если "МолчитИода" = "МолчитИода" Тогда
КонецЕсли;

// Корректное выражение
Если 100 = 100 Тогда
КонецЕсли;

// Корректное выражение
Если ЙодаГоворит = 100 Тогда
КонецЕсли;

// Выражение с ошибкой
Если ЙодаГоворит = 100 + 10 Тогда
КонецЕсли;

// Выражение с ошибкой
Если ЙодаГоворит = "МолчитИода" Тогда
КонецЕсли;

КонецПроцедуры;