&ТестоваяАннотация(ВторойПараметр = "ТестовоеЗначение", "ТестовоеЗначение2")
Перем ТестоваяПеременная;

&ТестоваяАннотация2
Перем ТестоваяПеременная2;

&ТестоваяАннотация("Строка")
&ТестоваяАннотация(
    "Многострочная
    |Строка"
)
&ТестоваяАннотация(32)
&ТестоваяАннотация(-32)
&ТестоваяАннотация(Истина)
&ТестоваяАннотация('20200101')
&ТестоваяАннотация(Неопределено)
&ТестоваяАннотация(NULL)
&ТестоваяАннотация(
    42,
    -42,
    "Строка",
    "Многострочная
    |Строка",
    Истина,
    '20200101',
    Неопределено,
    NULL
)
Перем ТестоваяПеременная3;

Процедура ПриСозданииОбъекта()
КонецПроцедуры