Процедура ИмяПроцедуры()
    ИмяПроцедуры();
    ПервыйОбщийМодуль.УстаревшаяПроцедура();
    РегистрыСведений.РегистрСведений1.УстаревшаяПроцедура();
    ПервыйОбщийМодуль.Тест();
КонецПроцедуры

Процедура Тест_Присваивание()
    А = ПервыйОбщийМодуль.НеУстаревшаяФункция();
    Б = ПервыйОбщийМодуль.НеУстаревшаяФункция().Добавить();
    ПервыйОбщийМодуль.НеУстаревшаяФункция().Реквизит = 10;
КонецПроцедуры

Процедура Тест_ИмяПараметр(ПервыйОбщийМодуль)
    ПервыйОбщийМодуль.НеУстаревшаяПроцедура(1, 2); // ошибка
    А = ПервыйОбщийМодуль.НеУстаревшаяФункция(); // ошибка
    ПервыйОбщийМодуль.НеУстаревшаяФункция().Добавить(); // ошибка
    ПервыйОбщийМодуль.НеУстаревшаяФункция().Реквизит = 10; // ошибка
    Б = ПервыйОбщийМодуль.НеУстаревшаяФункция().Добавить(); // ошибка
КонецПроцедуры

Процедура Тест_ВызовЧерезПолноеИмяОбъекта()
    А = РегистрыСведений.РегистрСведений1.НеУстаревшаяФункция();
    Б = РегистрыСведений.РегистрСведений1.НеУстаревшаяФункция().Добавить();
    РегистрыСведений.РегистрСведений1.НеУстаревшаяФункция().Реквизит = 10;
КонецПроцедуры
