Перем Модуль;
Перем Модуль2;

Функция ПервыйМетод()

    Перем Первая;

    Первая = 1;
    Первая = Первая + 1;

КонецФункции

Функция ВторойМетод()

    Вторая = 1;
    Вторая = Вторая + 1;

КонецФункции

Функция ТретийМетод(Параметр1, Параметр2, Знач Параметр3)

    Перем Первая, Вторая;

    Если Параметр1 > Параметр2 Тогда

        Модуль = Метод(Первая, Параметр1);

    Иначе

        Модуль = ОбщийМодуль.Метод(Вторая, Параметр2);

    КонецЕсли;

    Модуль.Метод(Параметр3);
    Третья = Модуль.Метод();

    Для Каждого ЭлементКоллекции Из Коллекция Цикл

            Метод(ЭлементКоллекции);

    КонецЦикла;

    Для Счетчик = 1 По 100 Цикл

        Коллекция.Добавить(Счетчик);

    КонецЦикла;

КонецФункции

Метод(Модуль, Модуль2);