// Это тестовая функция
Функция Тестовая(Парам1, Парам2, Парам3) Экспорт

	Док = Документы.АвансовыйОтчет.НайтиПоНомеру(1);
	Док.Записать
	Товар.Цена

	Запрос =
	"ВЫБРАТЬ
	|ИЗ
	|Справочники";

	Если Истина Тогда
		Выполнить(ТекстКода);
		Счетчик = Счетчик + 1
		Состояние("Выполнено " + Счетчик + " из " + Всего);
	КонецЕсли;

	Пока Истина Цикл
		Выполнить(ТекстКода);
		Счетчик = Счетчик + 1
		Состояние("Выполнено " + Счетчик + " из " + Всего);
	КонецЦикла;

	Для Индекс = 1 По 5 Цикл
		Выполнить(ТекстКода);
		Счетчик = Счетчик + 1
		Состояние("Выполнено " + Счетчик + " из " + Всего);
	КонецЦикла;

	ТаблицаЗначений.Найти(Справочники.

	Стр = ОписаниеОшибки

	Новый ТаблицаЗначений

	Новый HTTPЗапрос

	Найти(HTTPЗапрос

	ТаблицаЗначений.Добавить

	СтрНайти

	HTTPЗапрос.УстановитьТелоИзСтроки

	ЧислоСтр = Формат(Число, "ЧЦ=15; ЧДЦ=2; ЧГ=0")

	Запрос = Новый HTTPЗапрос();
	Запрос.

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	АвансовыйОтчет.ВалютаДокумента КАК ВалютаДокумента,
	|	АвансовыйОтчет.ВидОперации КАК ВидОперации,
	|	АвансовыйОтчет.Комментарий КАК Комментарий,
	|	АвансовыйОтчет.КурсДокумента КАК КурсДокумента,
	|	""ИСТИНА"" КАК Поле1,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчет.ФизЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ""ЛОЖЬ""
	|	КОНЕЦ КАК Поле2
	|ИЗ
	|	Документ.АвансовыйОтчет КАК АвансовыйОтчет");

	Результат = Запрос.

	// Начало проверки форматирования для попытки и условия
	Попытка
 		Док = Документы.АвансовыйОтчет.НайтиПоНомеру(1);
	Исключение
		Сообщить("Ошибка");
	КонецПопытки;

	Если Истина Тогда
		Если Истина Тогда
			Док = Документы.АвансовыйОтчет.НайтиПоНомеру(1);
		ИначеЕсли Ложь Тогда
			Док = Документы.РасходнаяНакладная.НайтиПоНомеру(1);
		КонецЕсли;
	Иначе
		Если Истина Тогда
			Док = Документы.РасходнаяНакладная.НайтиПоНомеру(1);
		Иначе
			Док = Документы.ПриходнаяНакладная.НайтиПоНомеру(1);
		КонецЕсли;
	КонецЕсли;
	// Конец проверки форматирования для попытки и условия

	// Проверка подсказки по стеку

	ПервыйДокумент = Документы.АвансовыйОтчет.НайтиПоНомеру(1);
	ВторойДокумент = ПервыйДокумент.ПолучитьОбъект();
	ВторойДокумент.

	ПервыйСправочник = Справочники.Товары.НайтиПоНомеру(1);
	ВторойСправочник = ПервыйСправочник.СоставнойРеквизит;
	ТретийСправочник = ВторойСправочник.ПолучитьОбъект();
	ТретийСправочник.

	ЧетвертыйСправочник = ТоварСсылка.СоставнойРеквизит.Товар.ПолучитьОбъект();
	ПятыйСправочник = ЧетвертыйСправочник.СтавкаНДС.ПолучитьОбъект()
	ПятыйСправочник.

	ПользовательскийТовар = _ОбъектСВложениями.Товар.ПолучитьОбъект();
	ПользовательскийТовар.

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 1";
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		Выборка.
	КонецЦикла;

	// Конец проверки подсказки по стеку

	// Проверка вывода цветов
	Структура = Новый Структура();
	Структура.Вставить("Web", WebЦвета.Аквамарин);
	Структура.Вставить("Web", Новый Цвет(100, 150, 100));
	Структура.Вставить("Web", "WebЦвета.Аквамарин");

КонецФункции