Процедура ИмяПроцедуры()
    ИмяПроцедуры();
    ПервыйОбщийМодуль.УстаревшаяПроцедура();
    РегистрыСведений.РегистрСведений1.УстаревшаяПроцедура();
    ПервыйОбщийМодуль.Тест();
КонецПроцедуры

Процедура Тест_Присваивание()
    А = ПервыйОбщийМодуль.НеУстаревшаяФункция();
    Б = ПервыйОбщийМодуль.НеУстаревшаяФункция().Добавить();
    ПервыйОбщийМодуль.НеУстаревшаяФункция().Реквизит = 10;
КонецПроцедуры

Процедура Тест_ИмяПараметр(ПервыйОбщийМодуль)
    ПервыйОбщийМодуль.МетодНесуществующий(1, 2); // ошибка
    А = ПервыйОбщийМодуль.ДругойМетодНесуществующий(); // ошибка
    ПервыйОбщийМодуль.ЕщеМетодНесуществующий().Добавить(); // ошибка
    ПервыйОбщийМодуль.ЕщеОдинМетодНесуществующий().Реквизит = 10; // ошибка
    Б = ПервыйОбщийМодуль.ЕщеДругойМетодНесуществующий().Добавить(); // ошибка
КонецПроцедуры