Процедура Пример2()
	Контекст = КонтекстЗапроса();
	УзелДанные = Контекст.ДанныеТокена;
	УзелСрок = Контекст.ДанныеТокена.СрокДействия;
КонецПроцедуры

//  Возвращаемое значение:
//   Структура:
//    * ТипАвторизации - Строка - Тип авторизации.
//    * ДанныеТокена - см. ДанныеТокена - Данные токена.
Функция КонтекстЗапроса()
	Результат = Новый Структура;
	Результат.Вставить("ТипАвторизации", "JWT");
	Результат.Вставить("ДанныеТокена", ДанныеТокена());
	Возврат Результат;
КонецФункции

// Возвращаемое значение:
//  Структура:
//   * Токен - Строка - Токен авторизации.
//   * СрокДействия - см. СрокДействияТокена - Дата и время окончания действия токена.
Функция ДанныеТокена()
	Результат = Новый Структура;
	Результат.Вставить("Токен", "");
	Результат.Вставить("СрокДействия", СрокДействияТокена());
	Возврат Результат;
КонецФункции

// Возвращаемое значение:
//  Структура:
//   * СрокДействия - Дата - Дата и время окончания действия токена.
//   * ДатаПолучения - Дата - Дата и время получения токена.
Функция СрокДействияТокена()
	Результат = Новый Структура;
	Результат.Вставить("СрокДействия", '00010101');
	Результат.Вставить("ДатаПолучения", '00010101');
	Возврат Результат;
КонецФункции
