Процедура Пример()
	Числа = ТестовыеЧисла();
	Список = ТестовыйСписок();
	СписокСтрок = ТестовыйСписокСтрок();
	ДобавленныйЭлемент = СписокСтрок.Добавить();
	ЗначениеДобавленного = ДобавленныйЭлемент.Значение;
	Для Каждого ЭлементСписка Из СписокСтрок Цикл
		ЗначениеОбхода = ЭлементСписка.Значение;
	КонецЦикла;
КонецПроцедуры

//  Возвращаемое значение:
//   Массив из Число - Массив тестовых чисел.
Функция ТестовыеЧисла()

	Результат = Новый Массив();
	Результат.Добавить(1);
	Результат.Добавить(2);
	Возврат Результат;

КонецФункции

//  Возвращаемое значение:
//   СписокЗначений - Список значений.
Функция ТестовыйСписок()

	Возврат Новый СписокЗначений();

КонецФункции

//  Возвращаемое значение:
//   СписокЗначений из Строка - Список строк.
Функция ТестовыйСписокСтрок()

	Возврат Новый СписокЗначений();

КонецФункции
