Процедура Тест()
	// Массив methods.
	М = Новый Массив;
	М.Добавить(1);
	М.Добавить(2);
	М.Добавить(3);
	Кол = М.Количество();
	Граница = М.ВГраница();
	НайденЭл = М.Найти(2);
	Содерж = М.Содержит(2);
	Копия = М.Скопировать();

	// Структура methods.
	С = Новый Структура("X, Y", 1, 2);
	КолС = С.Количество();
	Свой = С.Свойство("X");
	КолСВар2 = 0;
	С.Свойство("X", КолСВар2);

	// Соответствие methods.
	Карта = Новый Соответствие;
	Карта.Вставить("a", 1);
	КолКарт = Карта.Количество();
	Получ = Карта.Получить("a");

	// ТЗ methods.
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("К1");
	НоваяСтр = ТЗ.Добавить();
	КолТЗ = ТЗ.Количество();
	КолКол = ТЗ.Колонки.Количество();
	Найдена = ТЗ.Найти("a", "К1");

	// СписокЗначений methods.
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(1, "первый");
	КолСЗ = СЗ.Количество();
КонецПроцедуры
