Процедура Тест()
	// Различные платформенные конструкторы (для PlatformMethodCallInlayHintSupplier).
	Стр1 = Новый Структура("К1, К2", 100, "X");
	Стр2 = Новый Структура("Простой");
	Со1 = Новый Соответствие;
	ФиксСтр = Новый ФиксированнаяСтруктура(Стр1);
	ФиксСоо = Новый ФиксированноеСоответствие(Со1);
	ФиксМасс = Новый ФиксированныйМассив(Новый Массив(1, 2));

	// Платформенные методы с параметрами.
	Массив1 = Новый Массив;
	Массив1.Добавить(100);
	Массив1.Вставить(0, "X");
	Массив1.Удалить(0);
	Массив1.Очистить();
	Кол = Массив1.Количество();

	// Структура.Свойство() метод.
	Стр1.Очистить();
	Стр1.Удалить("К1");

	// ТЗ методы.
	ТЗ1 = Новый ТаблицаЗначений;
	ТЗ1.Колонки.Добавить("X", Новый ОписаниеТипов("Число"));
	НовС = ТЗ1.Добавить();
	НовС.X = 10;

	// Дата с параметрами.
	Д1 = Новый Дата(2020, 1, 1);
	Д2 = Новый Дата(2020, 1, 1, 12, 0, 0);

	// УникальныйИдентификатор.
	УИД1 = Новый УникальныйИдентификатор;
	УИД2 = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
КонецПроцедуры
