Процедура Тест()
	Значение = ВызовФункции(); // Число -
	Имя = ВызовФункции(); // Строка
	Перечисление = ВызовФункции(); // Число, Строка -
	X = Значение;
	Y = Имя;
	Z = Перечисление;
КонецПроцедуры

Процедура СсылкаВСтрокеПрисваивания()
	ПоЛокальнойСсылке = ВызовФункции(); // см. НовыйОбъектДанных
	ПоМежмодульнойСсылке = ВызовФункции(); // см. ОбщегоНазначения.НовыеСвойстваПодписи
	П = ПоЛокальнойСсылке;
	М = ПоМежмодульнойСсылке;
КонецПроцедуры

Процедура ТипЭлементовКоллекцииВСтроке()
	СписокСсылок = Новый Массив; // Массив из Структура -
	Для Каждого ЭлементМассива Из СписокСсылок Цикл
		ЭМ = ЭлементМассива;
	КонецЦикла;

	МоеСоответствие = Новый Соответствие; // Соответствие из Строка -
	Для Каждого ЭлементСоответствия Из МоеСоответствие Цикл
		ЭС = ЭлементСоответствия;
	КонецЦикла;

	Смешанный = Новый Массив; // Массив из Произвольный, Строка -
	Для Каждого ЭлементСмешанного Из Смешанный Цикл
		ЭСм = ЭлементСмешанного;
	КонецЦикла;
КонецПроцедуры

// Возвращаемое значение:
//  Структура:
//  * Ссылка - Строка
//  * Количество - Число
Функция НовыйОбъектДанных()
	Возврат Новый Структура;
КонецФункции

Функция ВызовФункции()
	Возврат "stub";
КонецФункции
