Процедура Тест()
	Значение = ВызовФункции(); // Число -
	Имя = ВызовФункции(); // Строка
	Перечисление = ВызовФункции(); // Число, Строка -
	X = Значение;
	Y = Имя;
	Z = Перечисление;
КонецПроцедуры

Процедура СсылкаВСтрокеПрисваивания()
	ПоЛокальнойСсылке = ВызовФункции(); // см. НовыйОбъектДанных
	ПоМежмодульнойСсылке = ВызовФункции(); // см. ОбщегоНазначения.НовыеСвойстваПодписи
	П = ПоЛокальнойСсылке;
	М = ПоМежмодульнойСсылке;
КонецПроцедуры

// Возвращаемое значение:
//  Структура:
//  * Ссылка - Строка
//  * Количество - Число
Функция НовыйОбъектДанных()
	Возврат Новый Структура;
КонецФункции

Функция ВызовФункции()
	Возврат "stub";
КонецФункции
