// Параметры:
//  Стр - Строка - текст
//
Функция ВернутьСтроку(Стр) Экспорт
	Возврат Стр;
КонецФункции

// Параметры:
//  МойПар - Строка, Число - текст или число
//
Функция ОбработатьСмешанный(МойПар) Экспорт
	Возврат МойПар;
КонецФункции

// Параметры:
//  Параметр - См. ВернутьСтроку
//
Функция СоССылкой(Параметр) Экспорт
	Возврат Параметр;
КонецФункции

// Параметры:
//  Х - См. НесуществующийМетод123
//
Функция СоСломаннойСсылкой(Х) Экспорт
	Возврат Х;
КонецФункции

Процедура Использовать()
	А = ВернутьСтроку("привет");
	Б = ОбработатьСмешанный(42);
	В = СоССылкой("текст");
	Г = СоСломаннойСсылкой("что-то");
КонецПроцедуры
