// Параметры:
//  ТабличнаяЧасть - См. Справочник.Справочник1.ТабличнаяЧасть1
Процедура СсылкаНаТабличнуюЧасть(ТабличнаяЧасть) Экспорт

	ЧастьТаблицы = ТабличнаяЧасть;

	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		КолонкаСтроки = СтрокаТЧ.Реквизит1;
	КонецЦикла;

КонецПроцедуры

// Параметры:
//  РеквизитТЧ - См. Справочник.Справочник1.ТабличнаяЧасть1.Реквизит1
Процедура СсылкаНаРеквизитТабличнойЧасти(РеквизитТЧ) Экспорт

	РеквизитЧасти = РеквизитТЧ;

КонецПроцедуры

// Параметры:
//  РеквизитОбъекта - См. Справочник.Справочник1.Реквизит2
Процедура СсылкаНаРеквизитОбъекта(РеквизитОбъекта) Экспорт

	РеквизитСправочника = РеквизитОбъекта;

КонецПроцедуры

// Параметры:
//  ЛишнийПуть - См. Справочник.Справочник1.ТабличнаяЧасть1.Реквизит1.Лишнее
Процедура СсылкаСЛишнимиЧастями(ЛишнийПуть) Экспорт

	ЗначениеЛишнегоПути = ЛишнийПуть;

КонецПроцедуры
