Перем Сохранённый;
Перем БезПрисваиванийВКонструкторе;

Функция КакаяТоФункция()
	Возврат "Какая-то функция";
КонецФункции

Процедура ПриСозданииОбъекта()
	Сохранённый = Новый Массив;
КонецПроцедуры

Процедура ПрочитатьПоля()
	ИзКонструктора = Сохранённый;
	БезКонструктора = БезПрисваиванийВКонструкторе;
КонецПроцедуры

Значение = 10;
ПослеЧисла = Значение;

Значение = Истина;
ПослеБулево = Значение;

Данные = Новый Структура;
Данные.Вставить("Первое", 1);
ПослеПервойВставки = Данные;
Данные.Вставить("Второе", "текст");
