Перем Кэш;
Перем Настройки Экспорт;

Процедура ЗаполнитьКэш()

	Кэш = Новый Соответствие;
	ПослеПрисваивания = Кэш;

КонецПроцедуры

Процедура ОчиститьКэш()

	Кэш = Новый Массив;

КонецПроцедуры

Процедура ИспользоватьПослеВызова()

	Кэш = Новый Соответствие;
	ОчиститьКэш();
	ПослеВызова = Кэш;

КонецПроцедуры

Процедура ДоПервогоПрисваивания()

	ДоПрисваивания = Кэш;
	Кэш = Новый Соответствие;

КонецПроцедуры

Процедура ЗаполнитьНастройки()

	Настройки = Новый Структура;
	Настройки.Вставить("Режим", "Тест");
	ПослеВставки = Настройки;

КонецПроцедуры

Процедура СброситьНастройки()

	Настройки = Новый ТаблицаЗначений;

КонецПроцедуры
