Процедура Пример()
	Контекст = Контейнер();
	Контекст.
КонецПроцедуры

//  Возвращаемое значение:
//   Структура:
//    * Содержимое - см. Коробка - Содержимое контейнера
Функция Контейнер()
	НовыйКонтейнер = Новый Структура;
	НовыйКонтейнер.Вставить("Содержимое", Коробка(НовыйКонтейнер));
	Возврат НовыйКонтейнер;
КонецФункции

// Параметры:
//  Родитель - см. Контейнер - Родительский контейнер
//
// Возвращаемое значение:
//  Структура:
//   * Описание - Строка - Описание содержимого
//   * Родитель - см. Контейнер - Родительский контейнер
Функция Коробка(Родитель)
	Результат = Новый Структура;
	Результат.Вставить("Описание", "");
	Результат.Вставить("Родитель", Родитель);
	Возврат Результат;
КонецФункции
