Процедура Пример(Знач ВходныеОшибки)
КонецПроцедуры

// Возвращаемое значение:
//  Массив из см. ОшибкаВалидации - Список ошибок валидации.
Функция ВалидироватьДанные() Экспорт
	Ошибки = Новый Массив;
	Ошибки.Добавить(ОшибкаВалидации());
	Возврат Ошибки;
КонецФункции

// Возвращаемое значение:
//  Структура:
//   * ИмяПоля - Строка - Имя поля, которое не прошло валидацию.
//   * ОписаниеОшибки - Строка - Детальное описание ошибки валидации.
Функция ОшибкаВалидации() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ИмяПоля", "");
	Результат.Вставить("ОписаниеОшибки", "");
	Возврат Результат;
КонецФункции

// Возвращаемое значение:
//  Структура:
//   * ТипАвторизации - Строка - Тип авторизации.
//   * ДанныеТокена - см. ДанныеТокена - Данные токена.
Функция КонтекстЗапроса() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ТипАвторизации", "JWT");
	Результат.Вставить("ДанныеТокена", ДанныеТокена());
	Возврат Результат;
КонецФункции

// Возвращаемое значение:
//  Структура:
//   * Токен - Строка - Токен авторизации.
//   * СрокДействия - Дата - Дата и время окончания действия токена.
Функция ДанныеТокена() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Токен", "");
	Результат.Вставить("СрокДействия", '00010101');
	Возврат Результат;
КонецФункции

// Параметры:
//  ВходныеОшибки - Массив из см. ОшибкаВалидации - Входные ошибки.
//
// Возвращаемое значение:
//  Булево
Функция ОбработатьОшибки(ВходныеОшибки) Экспорт
	Возврат Истина;
КонецФункции

// Возвращаемое значение:
//  см. ТаблицаЗначений
Функция ПолучитьТаблицу() Экспорт
	Возврат Новый ТаблицаЗначений;
КонецФункции

// Возвращаемое значение:
//  Массив из см. ОбщегоНазначения.НеизвестныйМетод
Функция СписокСКвалифицированнойСсылкой() Экспорт
	Возврат Новый Массив;
КонецФункции
