Процедура Пример()
	Значение = Звено();
КонецПроцедуры

// Возвращаемое значение:
//  Структура:
//   * Имя - Строка - Имя звена.
//   * Ссылка - см. ЗвеноИлиУзел - Следующее звено или узел.
Функция Звено() Экспорт
	Возврат Новый Структура;
КонецФункции

// Возвращаемое значение:
//  Структура:
//   * Код - Число - Код узла.
//   * Ссылка - см. Узел - Следующий узел.
Функция Узел() Экспорт
	Возврат Новый Структура;
КонецФункции

// Возвращаемое значение:
//  - см. Звено
//  - см. Узел
Функция ЗвеноИлиУзел(Признак) Экспорт
	Если Признак Тогда
		Возврат Звено();
	КонецЕсли;
	Возврат Узел();
КонецФункции
