Перем ИдентификаторВыгрузки; // Строка -
Перем КэшированныеЗначения; // Число, Строка -
Перем ПараметрыВызова; // Булево
Перем БезКомментария;
Перем СсылкаНаКонструктор; // см. НовыйОбъектДанных

// Дата - момент последнего обновления кэша.
Перем СКомментариемСверху;

// Возвращаемое значение:
//  Структура:
//  * Ссылка - Строка
//  * Количество - Число
Функция НовыйОбъектДанных()
	Возврат Новый Структура;
КонецФункции

Процедура Тест()
	А = ИдентификаторВыгрузки;
	Б = КэшированныеЗначения;
	В = ПараметрыВызова;
	Д = БезКомментария;
	Е = СсылкаНаКонструктор;
	З = СКомментариемСверху;
КонецПроцедуры

Процедура ЛокальнаяПерем()
	Перем ТекущаяСсылка; // Число -
	Г = ТекущаяСсылка;
КонецПроцедуры

Процедура ЛокальнаяПеремБезКомментария()
	Перем БезТипа;
	Ж = БезТипа;
КонецПроцедуры
