// Конструктор параметра СвойстваПодписи для добавления и обновления данных электронной подписи.
// Содержит развернутое описание подписи.
//
// Возвращаемое значение:
//   Структура:
//     * Подпись             - ДвоичныеДанные - результат подписания.
//                           - Строка - подписанный КонвертXML, если передавался в данных.
//     * УстановившийПодпись - СправочникСсылка.Пользователи - пользователь, который
//                           подписал объект информационной базы.
//     * Комментарий         - Строка - комментарий, если он был введен при подписании.
//     * ИмяФайлаПодписи     - Строка - если подпись добавлена из файла.
//     * ДатаПодписи         - Дата - дата, когда подпись была сделана. Имеет смысл для случаев,
//                           когда дату невозможно извлечь из данных подписи.
//     * ПропуститьПриПродлении - Булево - не подлежит усовершенствованию, например,
//                                достоверность обеспечивается оператором электронного документооборота.
//
//     Используются при обновлении результата проверки подписи:
//     * ДатаПроверкиПодписи - Дата - дата последней проверки подписи.
//     * ПодписьВерна        - Булево - результат последней проверки подписи.
//     * ТребуетсяПроверка   - Булево - не удалось проверить подпись.
//     * ПодписьМатематическиВерна - Булево - вычисляется при проверке подписи без дополнительных атрибутов.
//     * ОшибкаМатематическойПроверкиПодписи - Строка - ошибка при ПроверитьПодпись с флагом
//                                                      ПроверитьДополнительныеАтрибуты = Ложь
//     * ОшибкаПроверкиДополнительныхАтрибутов - Строка - ошибка при проверке сертификата и атрибутов
//                                                        усовершенствованной подписи, таких как метка времени.
//     * ДополнительныеАтрибутыПровереныВручную - Булево - признак ПодписьВерна в части доп. атрибутов установлен
//         вручную (в случае ПодписьМатематическиВерна = Ложь - Исключение при ручной установке)
//     * АвторРучнойПроверкиДополнительныхАтрибутов - СправочникСсылка.Пользователи
//     * ОбоснованиеРучнойПроверкиДополнительныхАтрибутов - Строка - ссылка на организацию, подтвердившую достоверность
//                                                                   подписи, например, Оператор ЭДО
//
//     Используются при обновлении усовершенствованной подписи:
//     * ПодписанныйОбъект   - ОпределяемыйТип.ПодписанныйОбъект - объект, с которым связана подпись.
//                             Игнорируется в методах, в которые объект передается как параметр.
//     * ПорядковыйНомер     - Число - идентификатор подписи, по которому можно упорядочивать их в списке.
//                             Не заполнен, если подпись не связана с объектом.
//     * ОшибкаПриАвтоматическомПродлении - Булево - не использовать, служебный, заполняется регламентным заданием.
//     Используются для связи с машиночитаемой доверенностью:
//     * ИдентификаторПодписи - УникальныйИдентификатор
//     * РезультатПроверкиПодписиПоМЧД - Массив из Структура
//                                     - Структура - МашиночитаемыеДоверенностиФНС.РезультатПроверкиПодписиПоМЧД
//
//     Производные свойства подписи:
//     * ТипПодписи          - ПеречислениеСсылка.ТипыПодписиКриптографии
//     * ДатаПодписиИзМетки  - Дата, Неопределено - дата самой ранней метки времени.
//     * СрокДействияПоследнейМеткиВремени - Дата - срок действия сертификата, которым подписана
//                                           последняя метка времени (или пустая дата, если нет метки времени),
//                                           если удалось определить с помощью МенеджерКриптографии
//     * Сертификат          - ХранилищеЗначения - содержит выгрузку сертификата,
//                             который использовался для подписания (содержится в подписи).
//                           - ДвоичныеДанные
//     * Отпечаток           - Строка - отпечаток сертификата в формате строки Base64.
//     * КомуВыданСертификат - Строка - представление субъекта, полученное из двоичных данных сертификата.
//     * ОписаниеСертификата - Структура - свойство, требуемое для сертификатов, которые
//                             не могут быть переданы в метод платформы СертификатКриптографии, со свойствами:
//        ** СерийныйНомер  - Строка - серийный номер сертификата, как у объекта платформы СертификатКриптографии.
//        ** КемВыдан       - Строка - как возвращает функция ПредставлениеИздателя.
//        ** КомуВыдан      - Строка - как возвращает функция ПредставлениеСубъекта.
//        ** ДатаНачала     - Строка - дата сертификата, как у объекта платформы СертификатКриптографии в формате "ДЛФ=D".
//        ** ДатаОкончания  - Строка - дата сертификата, как у объекта платформы СертификатКриптографии в формате "ДЛФ=D".
//        ** ДействителенДо - Строка - (необязательный) минимальная дата из дат окончания открытого и закрытого ключа
//                                     (если указана в сертификате) в формате "ДЛФ=D".
//
Функция НовыеСвойстваПодписи() Экспорт
	Структура = Новый Структура;
	Возврат Структура;
КонецФункции

Процедура Тест()
	Свойства = НовыеСвойстваПодписи();
	X = Свойства.Подпись;
КонецПроцедуры
