// Возвращаемое значение:
//  Структура:
//   * Подпись     - ДвоичныеДанные - результат подписания.
//                 - Строка - подписанный КонвертXML, если передавался в данных.
//   * Комментарий - Строка - комментарий, если он был введен при подписании.
//   * ДатаПодписи - Дата - дата, когда подпись была сделана.
//
Функция НовыеСвойстваПодписи() Экспорт
	Структура = Новый Структура;
	Возврат Структура;
КонецФункции

Процедура Тест()
	Свойства = НовыеСвойстваПодписи();
	X = Свойства.Подпись;
КонецПроцедуры
