Процедура Пример1()
	ОтветСКомментарием = ОтправитьЗапрос();
	ОтветБезКомментария = ОтправитьЗапрос2();
КонецПроцедуры

// Возвращаемое значение:
//  см. СхемаОтвета - Структура с кодом и сообщением ответа.
Функция ОтправитьЗапрос()
	Возврат СхемаОтвета();
КонецФункции

// Возвращаемое значение:
//  см. СхемаОтвета
Функция ОтправитьЗапрос2()
	Возврат СхемаОтвета();
КонецФункции

// Возвращаемое значение:
//  Структура:
//   * Код - Число - Код ответа.
//   * Сообщение - Строка - Сообщение ответа.
Функция СхемаОтвета() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Код", 200);
	Результат.Вставить("Сообщение", "OK");
	Возврат Результат;
КонецФункции
