Процедура Пример()
	Узлы = УзлыСостава(Неопределено);
КонецПроцедуры

// Параметры:
//  Родитель - Произвольный - Узел-родитель
//
// Возвращаемое значение:
//  Массив из Структура - Узлы состава:
//   * Имя  - Строка - Имя узла
//   * Дети - см. УзлыСостава
//          - Неопределено - у листа детей нет
//
Функция УзлыСостава(Родитель) Экспорт
	Возврат Новый Массив;
КонецФункции

// Параметры:
//  Ветка - см. УзлыСостава
//
Процедура ОбойтиУзлы(Ветка)
	Для Каждого Узел Из Ветка Цикл
		ОбойтиУзлы(Узел.Дети);
	КонецЦикла;
КонецПроцедуры
