Процедура Тест()
	// ОписаниеТипов с разной арностью.
	ОТ_БезАргов = Новый ОписаниеТипов;
	ОТ_ОдинТип = Новый ОписаниеТипов("Число");
	ОТ_НесколькоТипов = Новый ОписаниеТипов("Число, Строка");
	ОТ_СКвалиф = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2));
	ОТ_БезПробелов = Новый ОписаниеТипов("Число,Строка,Булево");

	// КвалификаторыЧисла.
	КвЧ = Новый КвалификаторыЧисла(10, 2);
	КвЧ2 = Новый КвалификаторыЧисла;

	// КвалификаторыСтроки.
	КвС = Новый КвалификаторыСтроки(50);

	// КвалификаторыДаты.
	КвД = Новый КвалификаторыДаты;

	// Использование в ТЗ.
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Кол1", ОТ_ОдинТип);
	ТЗ.Колонки.Добавить("Кол2", Новый ОписаниеТипов("Строка"));

	// Использование напрямую.
	Доступн = ОТ_ОдинТип.Типы();
КонецПроцедуры
