// Строка - какая-то переменная
Перем ПеременнаяСОписанием;

ИмяКорневойАннотации = "Завязь";

Сообщить(ИмяКорневойАннотации);

ДваТипа = "Строка";
ДваТипа = 0;

Сообщить(ДваТипа);

Переприсваивание = 0;
Переприсваивание = 0;

Сообщить(Переприсваивание);

ДругоеИмяМассива = Новый Массив;
ДругоеИмяМассива.Добавить(1);

РезультатФункции = КакаяТоФункция();

Сообщить(РезультатФункции);

Сообщить(ПеременнаяСОписанием);

// Важная функция
//
//  Возвращаемое значение:
//   Строка - что-то там.
//
Функция КакаяТоФункция()
    Возврат "Какая-то функция";
КонецФункции