// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Идентификатор - Строка
//   * Сумма - Число
//
Функция ТаблицаИзОписания() Экспорт
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Возврат Таблица;
КонецФункции

// Возвращаемое значение:
//  ДеревоЗначений:
//   * Наименование - Строка
//
Функция ДеревоИзОписания() Экспорт
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	Возврат Дерево;
КонецФункции

// Возвращаемое значение:
//  Соответствие:
//   * Ключ - Строка
//   * Значение - Число
//
Функция СоответствиеИзОписания() Экспорт
	Возврат Новый Соответствие;
КонецФункции

Процедура ТестДереваИзОписания()
	ДеревоПоОписанию = ДеревоИзОписания();
	Для Каждого СтрокаДерева Из ДеревоПоОписанию.Строки Цикл
		F = СтрокаДерева.Наименование;
	КонецЦикла;
КонецПроцедуры

Процедура ТестСоответствияИзОписания()
	СоответствиеПоОписанию = СоответствиеИзОписания();
	Для Каждого ЭлементСоответствия Из СоответствиеПоОписанию Цикл
		G = ЭлементСоответствия.Ключ;
		H = ЭлементСоответствия.Значение;
	КонецЦикла;
КонецПроцедуры

Процедура ТестКолонкиИзОписания()
	ТаблицаПоОписанию = ТаблицаИзОписания();
	СтрокаПоОписанию = ТаблицаПоОписанию.Добавить();
	C = СтрокаПоОписанию.Идентификатор;
	D = СтрокаПоОписанию.Сумма;
	Для Каждого ОбходПоОписанию Из ТаблицаПоОписанию Цикл
		E = ОбходПоОписанию.Идентификатор;
	КонецЦикла;
КонецПроцедуры

Процедура Тест()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Имя");
	ТЗ.Колонки.Добавить("Сумма");
	Для Каждого Строка Из ТЗ Цикл
		X = Строка.Имя;
		Y = Строка.Сумма;
	КонецЦикла;

	НоваяСтрока = ТЗ.Добавить();
	A = НоваяСтрока.Имя;
	B = НоваяСтрока.Сумма;
КонецПроцедуры
