Стек = Новый Массив;

Стек.Добавить(Новый Структура("Х,ТочкаВозврата",8,"ТочкаВозврата1"));
Перейти ~Факториал;
~ТочкаВозврата1: А = Стек[Стек.ВГраница()].Факториал;
Стек.Удалить(Стек.ВГраница());

Перейти ~Конец;

//область методов
~Факториал:
Контекст = Стек[Стек.ВГраница()];
Если Контекст.Х = 0 Тогда
  Контекст.Вставить("Факториал",1);
  Перейти ~Диспетчер;
Иначе
  Стек.Добавить(Новый Структура("Х,ТочкаВозврата",Контекст.Х - 1,"ТочкаВозврата2"));
  Перейти ~Факториал;
  ~ТочкаВозврата2:Контекст = Стек[Стек.ВГраница()-1];
  Контекст.Вставить("Факториал",Контекст.Х * Стек[Стек.ВГраница()].Факториал);
  Стек.Удалить(Стек.ВГраница());
  Перейти ~Диспетчер;
КонецЕсли;

~Диспетчер:
Контекст = Стек[Стек.ВГраница()];
Если Контекст.ТочкаВозврата = "ТочкаВозврата1" Тогда
  Перейти ~ТочкаВозврата1;
ИначеЕсли Контекст.ТочкаВозврата = "ТочкаВозврата2" Тогда
  Перейти ~ТочкаВозврата2;
КонецЕсли;

~Конец: