
Процедура esd(
    Парм1,
    Парим2)
    Перем Переменная1;
    Сообщить(
        "монго
        |много строк" );

    Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("СЗОткрытых", СЗОткрытых);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				   //|	Открытая.Ссылка КАК Открытая,
				   |	Закрытая.Ссылка КАК Закрытая
				   |ИЗ
				   |	Документ.ЗаявкаНаЗакупку КАК Открытая
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаЗакупкуЗакрытая КАК Закрытая
				   |		ПО (Закрытая.ДокументОснование" + Метод()"
				   |
				   |ГДЕ
				   |	Открытая.Ссылка В (&СЗОткрытых)
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	Закрытая.Дата
				   |
				   |";

    тзПлан.Колонки.Добавить( "Количество", Новый ОписаниеТипов( "Число", // ТУТ
               Новый КвалификаторыЧисла( 10, 0, ДопустимыйЗнак.Неотрицательный ) ) );

    Если мПропускатьКартыСМалымКоличеством // Тут
        И ЗначениеЗаполнено(цСтрока.ВариантыРазруба) Тогда // Тут
    КонецЕсли

    Если Не пОтборПоАналитике = Неопределено // ТУТ
      И пОтборПоАналитике.Количество() > 0
      И Метод() //Тут
      И пОтборПоАналитике.Найти( цСтрокаПланаУбоя.Подразделение ) = Неопределено Тогда
    КонецЕсли;

КонецПроцедуры