
Процедура esd(
    Парм1,
    Парим2)

    Сообщить(
        "монго
        |много строк" );

    Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("СЗОткрытых", СЗОткрытых);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				   //|	Открытая.Ссылка КАК Открытая,
				   |	Закрытая.Ссылка КАК Закрытая
				   |ИЗ
				   |	Документ.ЗаявкаНаЗакупку КАК Открытая
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаЗакупкуЗакрытая КАК Закрытая
				   |		ПО (Закрытая.ДокументОснование = Открытая.Ссылка)
				   |
				   |ГДЕ
				   |	Открытая.Ссылка В (&СЗОткрытых)
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	Закрытая.Дата
				   |
				   |";

КонецПроцедуры