&НаСервере
Процедура esd(
    Парам1,
    Парам2)
    Перем Переменная1;
    Сообщить( // тут
        "много
        |много строк" );

    Запрос = Новый Запрос(); // тут
	Запрос.УстановитьПараметр("СЗОткрытых", СЗОткрытых); // тут
	// на след.строке и далее в середине запроса
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				   |	Закрытая.Ссылка КАК Закрытая
				   |ИЗ
				   |	Документ.ЗаявкаНаЗакупку КАК Открытая
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаЗакупкуЗакрытая КАК Закрытая
				   |		ПО (Закрытая.ДокументОснование" + Метод() + "
				   |
				   |ГДЕ
				   |	Открытая.Ссылка В (&СЗОткрытых)
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	Закрытая.Дата
				   |
				   |";

    тзПлан.Колонки.Добавить( "Количество", Новый ОписаниеТипов( "Число", // ТУТ
               Новый КвалификаторыЧисла( 10, 0, ДопустимыйЗнак.Неотрицательный ) ) );

    Если мПропускатьКартыСМалымКоличеством // Тут
        И ЗначениеЗаполнено(цСтрока.ВариантыРазруба) Тогда // Тут
    КонецЕсли

    Если Не пОтборПоАналитике = Неопределено // ТУТ
      И пОтборПоАналитике.Количество() > 0
      И Метод() //Тут
      И пОтборПоАналитике.Найти( цСтрокаПланаУбоя.Подразделение ) = Неопределено Тогда
    Иначе
    КонецЕсли;

    //комментарий не считается

    Для Каждого Элемент Из Коллекция Цикл // тут
        ОбщийМодуль.ЕгоМетод( // тут
            1 + Элемент);
    КонецЦикла;

    Для Счетчик = 0 ПО 10 Цикл // тут
        РегистрыСведений.Регистр1.ЕгоМетод( // тут
            1 + Счетчик);
    КонецЦикла;

    Пока А = Б Цикл // тут
    КонецЦикла;

    Попытка
        Поз = СтрНайти("Строка", "ДругаяСтрока"); // тут
    Исключение
        ВызватьИсключение "1"; // тут
    КонецПопытки;
КонецПроцедуры

#Область Неиспользуемая

&НаКлиенте
Функция Функция1(Знач Парам = 10)
КонецФункции

#КонецОбласти
