#Область ОписаниеПеременных

// Реквизит-структура; тип выводится из возврата СоздатьДанные() (см.-ссылка)
Перем Данные Экспорт; // см. СоздатьДанные

// Тип выводится из квалифицированной см.-ссылки на метод общего модуля
Перем ИтогРасчёта Экспорт; // см. ОбщегоНазначения.ЗначениеВМассиве

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращаемое значение:
//  Структура:
//   * Код - Число -
//   * Наименование - Строка -
//
Функция СоздатьДанные()
	Возврат Новый Структура("Код, Наименование", 0, "");
КонецФункции

#КонецОбласти
