
// Соответствие
Результат = Новый Соответствие;
// ХранилищеЗначения
Результат = Новый ХранилищеЗначения(СписокСохранения);
// Запрос
Результат = Новый Запрос;
// Структура
Результат = Новый Структура;
// Структура
Результат = Новый Структура("Синоним, МассивСсылок", СинонимДокумента, Неопределено);
// СписокЗначений
Результат = Новый СписокЗначений;
// Массив
Результат = Новый Массив;
// ТаблицаЗначений
Результат = Новый ТаблицаЗначений();

// Массив
Параметры = Новый Массив(2);
Параметры[0] = "П1";
Параметры[1] = 1;
// Структура
Результат = Новый("Структура", Параметры);

// Массив
ТипЗначения = Тип("Структура");
Параметры = Новый Массив(2);
Параметры[0] = "П1";
Параметры[1] = 1;
// Null
Результат = Новый(ТипЗначения, Параметры);

