

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ТестОписанийОповещения()

    // Такое объявление ловим
    ОписаниеОповещения1 = Новый ОписаниеОповещения(
        "ОбработчикОписаниеОповещения",
        КлиентскийОбщийМодуль,
        ,
        "ОшибкаОписаниеОповещения",
        КлиентскийОбщийМодуль
    );

    // Такое объявление не ловим
    ОбработчикОписаниеОповещения = "ОбработчикОписаниеОповещенияВПеременной";
    ОшибкаОписаниеОповещения = "ОшибкаОписаниеОповещенияВПеременной";
    ОписаниеОповещения2 = Новый ОписаниеОповещения(
        ОбработчикОписаниеОповещения,
        КлиентскийОбщийМодуль,
        ,
        ОшибкаОписаниеОповещения,
        КлиентскийОбщийМодуль
    );

    // Такое объявление не ловим
    ПараметрыОбработчика = Новый Массив(5);
    ПараметрыОбработчика[0] = "ОбработчикОписаниеОповещения";
    ПараметрыОбработчика[1] = КлиентскийОбщийМодуль;
    ПараметрыОбработчика[3] = "ОшибкаОписаниеОповещения";
    ПараметрыОбработчика[4] = КлиентскийОбщийМодуль;
    ОписаниеОповещения3 = Новый("ОписаниеОповещения", ПараметрыОбработчика);

КонецПроцедуры