Функция СерверныйМодульМенеджера(Имя)                                                   // 1
	ОбъектНайден = Ложь;                                                                // 0
                                                                                        // 0
	ЧастиИмени = СтрРазделить(Имя, ".");                                                // 0
	Если ЧастиИмени.Количество() = 2 Тогда                                              // 1
                                                                                        // 0
		ИмяВида = ВРег(ЧастиИмени[0]);                                                  // 0
		ИмяОбъекта = ЧастиИмени[1];                                                     // 0
                                                                                        // 0
		Если ИмяВида = ВРег("Константы") Тогда                                          // 1
			Если Метаданные.Константы.Найти(ИмяОбъекта) <> Неопределено Тогда           // 1
				ОбъектНайден = Истина;                                                  // 0
			КонецЕсли;                                                                  // 0
		ИначеЕсли ИмяВида = ВРег("РегистрыСведений") Тогда                              // 1
			Если Метаданные.РегистрыСведений.Найти(ИмяОбъекта) <> Неопределено Тогда    // 1
				ОбъектНайден = Истина;                                                  // 0
			КонецЕсли;                                                                  // 0
		Иначе                                                                           // 1
			ОбъектНайден = Ложь;                                                        // 0
		КонецЕсли;                                                                      // 0
	КонецЕсли;                                                                          // 0
                                                                                        // 0
	Если Не ОбъектНайден Тогда                                                          // 1
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(      // 0
			НСтр("ru = 'Объект метаданных ""%1"" не найден,                             // 0
			           |либо для него не поддерживается получение модуля менеджера.'"), // 0
			Имя);                                                                       // 0
	КонецЕсли;                                                                          // 0
	УстановитьБезопасныйРежим(Истина);                                                  // 0
	Модуль = Вычислить(Имя);                                                            // 0
	F = ?(Условие, ИСТИНА, НЕОПРЕДЕЛЕНО);                                               // 1
	А = ?(Условие, ИСТИНА, ?(Условие2, ЛОЖЬ, НЕОПРЕДЕЛЕНО));                            // 2
	M = ИСТИНА ИЛИ 7;                                                                   // 1
	Возврат Модуль;                                                                     // 0
КонецФункции                                                                            // итог 12

Процедура СЦиклами()                                                                    // 1
    Для Ит = 0 По 4 Цикл                                                                // 1
        Если Ит = 1 Тогда                                                               // 1
            Сообщить(1);                                                                // 0
            Прервать;                                                                   // 0
        Иначе                                                                           // 1
            Сообщить(2);                                                                // 0
        КонецЕсли;                                                                      // 0
        Если Истина ИЛИ Ложь Тогда                                                      // 2
            Сообщить(3);                                                                // 0
        КонецЕсли;                                                                      // 0
        Для Каждого Строка Из Строки Цикл                                               // 1
            Если 1 > 0 ИЛИ 3 < 4 ИЛИ НЕ ИСТИНА Тогда                                    // 3
                Возврат;                                                                // 0
            КонецЕсли;                                                                  // 0
            Продолжить;                                                                 // 0
        КонецЦикла;                                                                     // 0
    КонецЦикла;                                                                         // 0
    Перейти ~Метка;                                                                     // 1
    ~Метка:                                                                             // 0
КонецПроцедуры                                                                          // итог 11

Процедура Пустая()                                                                      // 1
КонецПроцедуры                                                                          // итог 1

&НаСервере
Процедура ТестСАннотацией()                                                                 // 1
    Если Условие Тогда                                                                      // 1
        Если Условие2 Тогда                                                                 // 1
        КонецЕсли;
    Иначе                                                                                   // 1
        Для Каждого Элемент Из Коллекция Цикл                                               // 1
            Попытка
                Действие();
            Исключение                                                                      // 1
                Если Условие3 ИЛИ Условие4 ИЛИ Условие5 ИЛИ Условие6 ИЛИ Условие7 Тогда     // 5
                    Действие2();
                КонецЕсли;
            КонецПопытки;
        КонецЦикла;
    КонецЕсли;
    Для Каждого Строка Из Строки Цикл                                                       // 1
        Если 1 > 0 ИЛИ 3 < 4 ИЛИ НЕ ИСТИНА Тогда                                            // 3
            Возврат;                                                                        // 0
        КонецЕсли;                                                                          // 0
        Продолжить;                                                                         // 0
    КонецЦикла;
КонецПроцедуры                                                                              // итог 15
