Функция Точка(Схема) Экспорт
	Если Схема = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НоваяТочка(Схема);
КонецФункции

Функция ТочкаЧерезСлужебную(Схема) Экспорт
	Если Схема = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат СлужебнаяТочка(Схема);
КонецФункции

Функция НоваяТочка(Схема) Экспорт
	Контекст = Новый Структура;
	Контекст.Вставить("Схема", Схема);
	Возврат Контекст;
КонецФункции

Функция СлужебнаяТочка(Схема)
	Контекст = Новый Структура;
	Контекст.Вставить("Схема", Схема);
	Возврат Контекст;
КонецФункции
