Перем Разделитель;
Перем Части;

Процедура ПриСозданииОбъекта(Знач РазделительЧастей = " ")
	Разделитель = РазделительЧастей;
	Части = Новый Массив;
КонецПроцедуры

// Добавляет часть строки.
//
// Параметры:
//   Часть - Строка - добавляемая часть
//
Процедура Добавить(Знач Часть) Экспорт
	Части.Добавить(Часть);
КонецПроцедуры

// Собирает строку из добавленных частей.
//
// Возвращаемое значение:
//   Строка - результат
//
Функция Результат() Экспорт
	Возврат СтрСоединить(Части, Разделитель);
КонецФункции
