// Определение мета-аннотации &ХранилищеСущностей (по мотивам autumn-data).
// Класс, помеченный &ХранилищеСущностей("..."), наследует ХранилищеСущностей.

Перем ИмяТипаСущности;
Перем ИсточникДанныхСущности;

Функция ПолучитьИмяТипаСущности() Экспорт
	Возврат ИмяТипаСущности;
КонецФункции

Функция ПолучитьИсточникДанных() Экспорт
	Возврат ИсточникДанныхСущности;
КонецФункции

&Аннотация("ХранилищеСущностей")
&Расширяет("ХранилищеСущностей")
&Желудь
Процедура ПриСозданииОбъекта(Значение, ИсточникДанных = "")
	ИмяТипаСущности = Значение;
	ИсточникДанныхСущности = ИсточникДанных;
КонецПроцедуры
