// Базовый класс хранилища сущностей (по мотивам nixel2007/entity).
// Его методы наследуются репозиториями, помеченными &ХранилищеСущностей.

// Получить одну сущность по идентификатору.
//
// Возвращаемое значение:
//  Произвольный - найденная сущность
Функция ПолучитьОдно(Идентификатор) Экспорт
КонецФункции

// Получить набор сущностей по отбору.
Функция Получить(Отбор = Неопределено) Экспорт
КонецФункции

// Сохранить сущность в хранилище.
Процедура Сохранить(Сущность) Экспорт
КонецПроцедуры
