Функция Пример1(ТипКласса)
    Если ТипКласса.Неизвестен() Тогда                                                  // +1
        Возврат Символы.НеизвестныйСимвол;
    КонецЕсли;

    НеизвестностьНайдена = Ложь;
    СписокСимволов = ТипКласса.ПолучитьСимвол().Потомки.Поиск("имя");
    Для Каждого Символ Из СписокСимволов Цикл                                          // +1
        Если Символ.ИмеетТип(Символы.Странное)                                         // +2 (nesting = 1)
            И НЕ Символы.Экспортный() Тогда                                            // +1

            Если МожноПереопределить(Символ) Тогда                                     // +3 (nesting = 2)
                Переопредялемость = ПроверитьПереопределяемость(Символ, ТипКласса);
                Если Переопределяемость = Неопределено Тогда                           // +4 (nesting = 3)
                    Если НЕ НеизвестностьНайдена Тогда                                 // +5 (nesting = 4)
                        НеизвестностьНайдена = Истина;
                    КонецЕсли;
                ИначеЕсли Переопределяемость Тогда                                     // +1
                    Возврат Символ;
                КонецЕсли;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;

    Если НеизвестностьНайдена Тогда                                                   // +1
        Возврат Символы.НеизвестныйСимвол;
    КонецЕсли;

    Возврат Неопределено;
КонецФункции
