
Процедура Один()
    А = 0;
КонецПроцедуры

#Область ИмяОбласти

// Описание
// Возвращаемое значение:
// Строка - описание строки
Функция Два()
    Возврат Неопределено;
КонецФункции

Функция Три(Парам, Знач Парам2, Парам3 = 0, Знач Парам4 = 0)
    Возврат Неопределено;
КонецФункции

#КонецОбласти

// Устарела.
//
Функция Четыре()
КонецФункции

// Описание
// Устарела. См. функцию Три()
//
Функция Пять()
КонецФункции

&НаКлиенте
Процедура Метод6()
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Метод7()
КонецПроцедуры

&НаКлиенте
&НаСервереБезКонтекста
Процедура Метод8()
КонецПроцедуры

Процедура Метод9()
КонецПроцедуры

&После
Процедура Метод10()
КонецПроцедуры

&НаКлиенте
&После
Процедура Метод11()
КонецПроцедуры

&После
&НаКлиенте
Процедура Метод12()
КонецПроцедуры

&НаКлиенте
&После
Функция Метод13()
КонецФункции

&Аннотация1
&Аннотация2
Процедура Метод14() Экспорт
КонецПроцедуры
