Функция Тест1()

    СтрокаЗапроса = "Выбрать первые 1 из справочник.Контрагенты";
    МногострочнаяСтрокаЗапроса = "
    |Выбрать первые 1
    |из справочник.Контрагенты";

КонецФункции

Функция Тест2()

    СтрокаЗапроса = "Уничтожить ВТ";
    МногострочнаяСтрокаЗапроса = "
    |Уничтожить ВТ;
    |Уничтожить ВТ1;";

КонецФункции

Функция Тест3()

    СтрокаЗапроса = "Выбрать * Поместить ВТ Из Справочник.Контрагенты;Уничтожить ВТ";
    МногострочнаяСтрокаЗапроса = "
    |Уничтожить ВТ;
    |Выбрать Поле1, Поле2 Из ВТ1";

КонецФункции