Функция Тест1()

    СтрокаЗапроса = "Выбрать первые 1 из справочник.Контрагенты";
    МногострочнаяСтрокаЗапроса = "
    |Выбрать первые 1
    |из справочник.Контрагенты";

КонецФункции

Функция Тест2()

    СтрокаЗапроса = "Уничтожить ВТ";
    МногострочнаяСтрокаЗапроса = "
    |Уничтожить ВТ;
    |Уничтожить ВТ1;";

КонецФункции

Функция Тест3()

    СтрокаЗапроса = "Выбрать * Поместить ВТ Из Справочник.Контрагенты;Уничтожить ВТ";
    МногострочнаяСтрокаЗапроса = "
    |Уничтожить ВТ;
    |Выбрать Поле1, Поле2 Из ВТ1";

КонецФункции

Функция Тест4()

      F = Новый Запрос( "" "Выбрать" "Валюты.Код,
   | Валюты.Ссылка, " " Валюты.Наценка
    |  ИЗ 	Справочник.Валюты КАК Валюты"
);

КонецФункции

Функция Тест5()

      F = "" "Выбрать" " " "Валюты.Код, " "Валюты.Ссылка, " " Валюты.Наценка ИЗ 	Справочник.Валюты КАК Валюты"

КонецФункции

Функция Тест6()

       F = "ВЫБРАТЬ
         |	Валюты.Код КАК Код,
         |	Валюты.ВерсияДанных КАК ВерсияДанных,
         |	""D"" КАК Поле1
         |ИЗ
         |	Справочник.Валюты КАК Валюты
         |ГДЕ
         |	Валюты.Код = ""D"""

КонецФункции

Функция Тест7()

А = "ВЫБРАТЬ РАЗРЕШЕННЫЕ Поле.Один
|КАК
|  Один, 2
|  КАК Два ИЗ Справочник.Поле
|АВТОУПОРЯДОЧИВАНИЕ;";

КонецФункции