
/////Описание
/////
/////

#Область ОписаниеПеременных




#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти


#Region EventHandlers
// Enter code here.
#EndRegion

#Region Internal
// Enter code here.
#EndRegion

#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИмяТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция Тест() КонецФункции
#КонецОбласти

Процедура НеУстаревшаяПроцедура() Экспорт

КонецПроцедуры

// Процедура - Устаревшая процедура
// Устарела. См. НеУстаревшаяПроцедура.
Процедура УстаревшаяПроцедура() Экспорт

КонецПроцедуры

Функция НеУстаревшаяФункция() Экспорт

КонецФункции

// Функция - Устаревшая функция
// Устарела. См. НеУстаревшаяФункция.
Функция УстаревшаяФункция() Экспорт

КонецФункции

#Region Initialize

// SupportEmail = "v8@1c.ru";
// Ctor();

#EndRegion