#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Region EventHandlers

Функция URLTemplate1POST(Запрос)

	Возврат Неопределено;

КонецФункции

Функция URLTemplate_НеверныеОбработчики_POST(Запрос, НеверныйПараметр)

	Возврат Неопределено;

КонецФункции

#EndRegion

#Region Private
// Enter code here.
#EndRegion

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
