Процедура БезЛписания()
КонецПроцедуры

// Описание метода
Процедура ТолькоСОписанием()
КонецПроцедуры

// Параметры:
//   ПараметрБезТипаИОписания
//   ПараметрСТипом – Произвольный
//   ПараметрСОписаниемСсылкой - см. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту.НастройкиФормы
//   ПараметрСТипомИОписанием - Произвольный - описание параметра см. Справочник.Контрагенты.
//   ПараметрСТипамиИОписанием - Произвольный, ДокументСсылка - простое описание параметра.
//   ПараметрСТипамиИОписанием2 - Произвольный, ДокументСсылка - многострочное
//      описание параметра
//   ПараметрСТипамиИОписанием3 - Произвольный - описание произвольного типа
//                              - ДокументСсылка - какой-то документ
//                                  именно
//                                  ссылка
//                              - Число - многострочное
//                                  описание числа
//                              - Строка
//  ПараметрМассив - Массив из Структура:
//     * Элемент1 - Структура:
//        ** СубЭлемент1    - Число - код региона (длина - 2).
//        ** Субэлемент2    - Число - код населенного пункта (длина - 3).
//        ** СубЭлемент3    - Число - код улицы (длина - 4).
//     * Элемент2           - Строка
//     * Элемент3           - Булево
//     * Жесть              - Структура
//                      ** Массив - Массив из Структура:
//                          *** Элемент - Число - описание
//     *** Элемент4 - строка
//     **** Элемент5 - См. ОбщийМодуль.ОбщийМетод()
Процедура ТолькоСПараметрами()
КонецПроцедуры

// Варианты вызова:
//   УниверсальнаяПроцедура(Тип11, Тип21) - описание ...
//   УниверсальнаяПроцедура(Тип12, Тип22) - описание ...
//   УниверсальнаяПроцедура(Тип11, Тип23) - описание ...
Процедура ТолькоСВариантамиВызовов()
КонецПроцедуры

// Возвращаемое значение:
//  - ЛюбаяСсылка - ссылка на предопределенный элемент.
//  - Неопределено - если предопределенный элемент есть в метаданных, но не создан в ИБ.
Функция ТолькоСВозвращаемымЗначение()
КонецФункции

// Пример:
//   УниверсальнаяПроцедура(Тип11, Тип21) - описание ...
//
//   УниверсальнаяПроцедура(Тип11, Тип23) - описание ...
Процедура ТолькоСПримерами()
КонецПроцедуры

// Устарела. Следует использовать новую см. ОбщегоНазначения.Метод()
Процедура ТолькоУстарела()
КонецПроцедуры

// Устарела. Следует использовать новую см. ОбщегоНазначения.Метод()
// Описание метода
// Несколько строк
// Параметры:
//   ПараметрБезТипаИОписания
//   ПараметрСТипамиИОписанием2 - Произвольный, ДокументСсылка - многострочное
//      описание параметра
//  ПараметрМассив - Массив из Структура:
//     * Элемент1 - Структура:
//        ** СубЭлемент1    - Число - код региона (длина - 2).
//        ** Субэлемент2    - Число - код населенного пункта (длина - 3).
//        ** СубЭлемент3    - Число - код улицы (длина - 4).
//     * Элемент2           - Строка
// Возвращаемое значение:
//  - ЛюбаяСсылка - ссылка на предопределенный элемент.
//  - Неопределено - если предопределенный элемент есть в метаданных, но не создан в ИБ.
// Пример:
//   Пример0(Тип11, Тип21) - описание ...
//   Пример1(Тип12, Тип22) - описание ...
//   УниверсальнаяПроцедура(Тип11, Тип21) - описание ...
//   УниверсальнаяПроцедура(Тип12, Тип22) - описание ...
Функция Полная()
КонецФункции

// Описание метода
// Несколько строк
// Параметры:
//   ПараметрБезТипаИОписания
//   ПараметрСТипамиИОписанием2 - Произвольный, ДокументСсылка - многострочное
//      описание параметра
//  ПараметрМассив - Массив из Структура:
// Возвращаемое значение:
//  ЛюбаяСсылка - ссылка на предопределенный элемент.
Функция Частая()
КонецФункции

// Описание метода
// Несколько строк
// Возвращаемое значение:
//  ЛюбаяСсылка - ссылка на предопределенный элемент.
Функция БезПараметров()
КонецФункции

// См. ОбщийМодуль.Метод()
Функция ОписаниеСсылкой(Параметр1, Знач Параметр2 = 3)
КонецФункции

// Параметры:
// См. ОбщийМодуль.Метод()
Функция ОписаниеСсылкой2(Параметр1, Знач Параметр2 = 3)
КонецФункции

// Возвращаемое значение:
// См. ОбщийМодуль.Метод()
Функция ОписаниеСсылкой3(Параметр1, Знач Параметр2 = 3)
КонецФункции

// Значения реквизитов, прочитанные из информационной базы для нескольких объектов.
//
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылки - Массив - массив ссылок на объекты одного типа.
//                          Значения массива должны быть ссылками на объекты одного типа.
//                          если массив пуст, то результатом будет пустое соответствие.
//  Реквизиты - Строка - имена реквизитов перечисленные через запятую, в формате требований к свойствам
//                             структуры. Например, "Код, Наименование, Родитель".
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объектам выполняется с учетом прав пользователя, и в случае,
//                                    - если какой-либо объект будет исключен из выборки по правам, то этот объект
//                                      будет исключен и из результата;
//                              - если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//
// Возвращаемое значение:
//  Соответствие - список объектов и значений их реквизитов:
//   * Ключ - ЛюбаяСсылка - ссылка на объект;
//   * Значение - Структура - значения реквизитов:
//    ** Ключ - Строка - имя реквизита;
//    ** Значение - Произвольный - значение реквизита.
//
Функция BUG_1495(Ссылки, Знач Реквизиты, ВыбратьРазрешенные = Ложь) Экспорт
КонецФункции

// Описание процедуры
&Аннотация("Параметр")
Процедура ПроцедураСАннотацией()
КонецПроцедуры

&Аннотация("Параметр")
// Описание процедуры
Процедура ПроцедураСАннотациейПередОписанием()
КонецПроцедуры
