
// Описание сверху
Перем ПеременнаяСОписаниемСверху;

// Описание сверху
// Еще немного описания
Перем ПеременнаяСОписаниемСверху;

Перем ПеременнаяСОписаниемВСтроке; // Описание в строке

// Неверное описание

Перем ПеременнаяСНевернымОписанием;

Перем ПеременнаяБезОписания;

Перем ПеременнаяА, ПеременнаяБ;

&НаКлиенте
Перем ПеременнаяАф; // висячий комментарий

// Комментарий сверху
&НаКлиенте
// Комментарий под аннотацией
Перем ПеременнаяАя; // висячий комментарий

Процедура А()
    Перем Локальная;

    Перем Локальнаяв;// висячий комментарий

    // комментарий сверху
    &НаКлиенте
    Перем Локальнаяя;// висячий комментарий

    // комментарий сверху
    // комментарий сверху 2
    &НаКлиенте
    // комментарий сверху 3
    // комментарий сверху 4
    Перем Локальнаяяя;

КонецПроцедуры