асинх процедура тест(знач парам1) экспорт
  перем тест;
  
  если условие и УсловиеДва или не Условие3 тогда
  иначеесли Условие4 тогда
  иначе
  конецесли;
  
  пока условие цикл
    прервать;
  конеццикла;
  
  для каждого строка из таблица цикл
    продолжить;
  конеццикла;
  
  попытка
    объект = новый Массив;
  исключение
    вызватьисключение "исключение";
  конецпопытки
  
  перейти ~Метка1;
  ~Метка1 : сообщить("привет");
  
  добавитьобработчик Накладная.ПриЗаписи, Обработка.ПриЗаписиДокумента;
  удалитьобработчик Накладная.ПриЗаписи, Обработка.ПриЗаписиДокумента;
  
  ждать вызов();
конецпроцедуры

функция тест2()
конецфункции