Функция Создать(Токен, Данные, ПослеАвторизации = Ложь) Экспорт

	Результат = Новый Соответствие;

	Если Данные <> "false" Тогда
		Результат.Вставить("Ид", Данные);
	ИначеЕсли Не ПослеАвторизации Тогда
		Результат = Создать(Токен, Данные, Истина);
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция Обновить(Токен, Данные, Ид, ПослеАвторизации = Ложь) Экспорт

	Результат = Новый Соответствие;

	Если Данные <> "false" Тогда
		Результат.Вставить("Ид", Данные);
	ИначеЕсли Не ПослеАвторизации Тогда
		Результат = Обновить(Токен, Данные, Ид, Истина);
	КонецЕсли;

	Возврат Результат;

КонецФункции
