// Добавляет команду.
//
// Параметры:
//   Команды - см. Переопределяемый.ПередДобавлением.Команды
//   Добавлять - Булево - добавлять ли команду.
//
// Возвращаемое значение:
//   Неопределено - команда не добавлена.
//
Функция ДобавитьКоманду(Команды, Добавлять) Экспорт
	Если Добавлять Тогда
		Команда = Команды.Добавить();
		Возврат Команда;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

// См. Переопределяемый.ПередДобавлением
Функция ДобавитьКомандуПоИнтерфейсу(Команды, Добавлять) Экспорт
	Если Добавлять Тогда
		Команда = Команды.Добавить();
		Возврат Команда;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции
