
/////Описание
/////
/////

#Область ОписаниеПеременных




#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти


#Region EventHandlers
// Enter code here.
#EndRegion

#Region Internal
// Enter code here.
#EndRegion

#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИмяТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция Тест()
    РегистрыСведений.РегистрСведений1.УстаревшаяПроцедура();
КонецФункции

#КонецОбласти

Процедура НеУстаревшаяПроцедура() Экспорт

КонецПроцедуры

// Устарела. См. НеУстаревшаяПроцедура.
// Процедура - Устаревшая процедура
Процедура УстаревшаяПроцедура() Экспорт

КонецПроцедуры

Функция НеУстаревшаяФункция() Экспорт

КонецФункции

// Устарела. См. НеУстаревшаяФункция.
// Функция - Устаревшая функция
Функция УстаревшаяФункция() Экспорт

    ПервыйОбщийМодуль.НеУстаревшаяФункция();
    НеУстаревшаяФункция();

КонецФункции

Процедура ВерсионированиеПриЗаписи(Источник, Отказ) Экспорт

КонецПроцедуры

Процедура РегистрацияИзмененийПередУдалением(Источник, Отказ)

КонецПроцедуры
