//////////////////////////////////////////////
// Название модуля
//////////////////////////////////////////////
#Если Сервер тогда
Перем А;                // <- Ошибка
#Область Переменные
Перем Б;
Перем Дд;
#КонецОбласти
Перем Ии;               // <- Ошибка

#Область Методы
Функция Аа() Экспорт
    Возврат 7;
КонецФункции
#КонецОбласти
#Иначе
Процедура ССС()          // <- Ошибка
    #Область Методы21
    Сообщаить(4245);
    #КонецОбласти
КонецПроцедуры
#КонецЕсли

Процедура Бб()          // <- Ошибка
    #Область Методы2
    Сообщаить(42);
    #КонецОбласти
КонецПроцедуры

///////////////////////////////////////////
// инициализация
///////////////////////////////////////////

#Если Сервер Тогда
#Область Методы3
Функция Пример3
 Сообщить(42);
КонецФункции
#КонецОбласти
#КонецЕсли

#Область Иниц
А = 78;
#КонецОбласти

Б = Аа() + А;           // <- Ошибка

#Область Иниц
Если Условие Тогда
    Ии = 79;
КонецЕсли;
#КонецОбласти

#Область в
    Ин = 5;
#КонецОбласти
Ин = в;                         // <- Ошибка

Если Условие Тогда              // <- Ошибка
#Если Сервер Тогда
Сообщить("Так нельзя жить");
#ИначеЕсли Клиент Тогда
Сообщить("И так нельзя жить");
#Иначе
#Область Областишка
Сообщить("Так тоже нелзя, хоть и хочется");
#КонецОбласти
#КонецЕсли
КонецЕсли
