Процедура Пример1() // правильнй с ИТС
    НачатьТранзакцию();
    Попытка
        БлокировкаДанных = Новый БлокировкаДанных;
        ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ПриходнаяНакладная");
        ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", СсылкаДляОбработки);
        ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
        БлокировкаДанных.Заблокировать();

        ДокументОбъект.Записать();

        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();

        ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),
            УровеньЖурналаРегистрации.Ошибка,
            ,
            ,
            ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

        ВызватьИсключение; // есть внешняя транзакция

    КонецПопытки;
КонецПроцедуры

// ошибочные конструкции

Процедура Пример2()
    НачатьТранзакцию();
    Попытка
        Метод();
    Исключение
        ОтменитьТранзакцию();
        Возврат;
    КонецПопытки;
    ЗафиксироватьТранзакцию(); // <-- Ошибка: вне попытки
КонецПроцедуры

Процедура Пример3()
    НачатьТранзакцию();
    Попытка
        Метод();
    Исключение
        Если ТранзакцияАктивна() Тогда
            ЗафиксироватьТранзакцию(); // <-- Ошибка: в исключении
        Иначе
            ОтменитьТранзакцию();
        КонецЕсли;
        Возврат;
    КонецПопытки;
КонецПроцедуры

Процедура Пример4()
    НачатьТранзакцию();
    Метод();
    Если ТранзакцияАктивна() Тогда
        ЗафиксироватьТранзакцию(); // <-- Ошибка: вне попытки
    Иначе
        ОтменитьТранзакцию();
    КонецЕсли;
КонецПроцедуры

Функция Пример5()
    НачатьТранзакцию();
    Метод();
    ЗафиксироватьТранзакцию(); // <-- Ошибка: вне попытки
    Возврат 1;
КонецФункции

Процедура Пример6()
    НачатьТранзакцию();
    Попытка
        Метод();
        ЗафиксироватьТранзакцию(); // <-- Ошибка: есть код после
        Метод2();
    Исключение
        ОтменитьТранзакцию();
        Возврат;
    КонецПопытки;
КонецПроцедуры

Процедура Пример7()
    НачатьТранзакцию();
    Попытка
        Метод();
        ЗафиксироватьТранзакцию(); // <-- Ошибка: есть код после
        Возврат;
    Исключение
        ОтменитьТранзакцию();
        Возврат;
    КонецПопытки;
КонецПроцедуры

Для каждого Элемент Из Коллекция Цикл
    НачатьТранзакцию();
    Попытка
        Метод();
        ЗафиксироватьТранзакцию(); // <-- Ошибка: есть код после
        Продолжить;
    Исключение
        ОтменитьТранзакцию();
        Возврат;
    КонецПопытки;
КонецЦикла;

ЗафиксироватьТранзакцию(); // <-- Ошибка: просто в конце модуля

Коннектор.ЗафиксироватьТранзакцию(); // Игнорируем, это просто вызов метода