
ПервыйОбщийМодуль.УстаревшаяПроцедура(); // <--
ПервыйОбщийМодуль.НеУстаревшаяПроцедура();

ПервыйОбщийМодуль.УстаревшаяФункция(); // <--
ПервыйОбщийМодуль.НеУстаревшаяФункция();

А = ПервыйОбщийМодуль.УстаревшаяФункция(); // <--
А = ПервыйОбщийМодуль.НеУстаревшаяФункция();

Если ПервыйОбщийМодуль.УстаревшаяФункция() Тогда // <--
КонецЕсли;

Если ПервыйОбщийМодуль.НеУстаревшаяФункция() Тогда
КонецЕсли;

РегистрыСведений.РегистрСведений1.УстаревшаяПроцедура(); // <--
РегистрыСведений.РегистрСведений1.НеУстаревшаяПроцедура();

А = РегистрыСведений.РегистрСведений1.УстаревшаяФункция(); // <--
А = РегистрыСведений.РегистрСведений1.НеУстаревшаяФункция();

Если РегистрыСведений.РегистрСведений1.УстаревшаяФункция() Тогда // <--
КонецЕсли;

Если РегистрыСведений.РегистрСведений1.НеУстаревшаяФункция() Тогда
КонецЕсли;

УстаревшаяПроцедура(); // <--

// Устарела.
Процедура УстаревшаяПроцедура()
    ПервыйОбщийМодуль.УстаревшаяПроцедура(); // нет срабатывания, т.к. вызов из устаревшей процедуры
КонецПроцедуры