Процедура Метод1()
    Ц = "Строка2";
    Если Ц = "Строка2" Тогда
        Ф = ВРег("Строка2") + HРег("Строка3");
    Иначе
        Ф = НРег("Строка2");
    КонецЕсли;
КонецПроцедуры

Процедура Метод2()
    Ц2 = "Строка22";
    Если Ц2 = "Строка22" Тогда
        Ф2 = Метод7("строка22");
    Иначе
        Ф2 = ("Строка3" + "Строка4" + "СтрОкА22");
    КонецЕсли;
КонецПроцедуры

Функция Метод3(Параметр)
    Возврат "Выбрать Первые 1 Из " + Параметр; // только при анализе файла
КонецФункции

Функция Метод4(Параметр)
    Возврат "Выбрать Первые 1 Из " + Нстр(Параметр);  // только при анализе файла
КонецФункции

Функция Метод5(Параметр)
    Возврат "Выбрать Первые 1 Из ";  // только при анализе файла
КонецФункции

Функция Метод6(Параметр)
    Возврат "Выбрать Первые 1 Из"; // не поймается
КонецФункции

Ц3 = "Строка22";
Если Ц3 = "Строка22" Тогда
    Ф3 = "Строка3";
Иначе
    Ф3 = "Строка";
КонецЕсли;