
Процедура а()
        A = 0;
    Если Истина Тогда
		А = 0;
	Иначе
		// <-- Ошибка на весь блок ИНАЧЕ. Если КОММЕНТАРИЙ = КОД, то ошибки нет
	КонецЕсли;
	
	Попытка		
		А = 0;
	Исключение
		// <-- Ошибки быть не должно, есть другая проверка
	КонецПопытки;
	
	Если Истина Тогда		
		
		Пока Истина Цикл
			// <-- Ошибка на весь блок ПОКА. Если КОММЕНТАРИЙ = КОД, то ошибки нет
        КонецЦикла;

    КонецЕсли;

    // Ошибка на весь следующий блок ЕСЛИ ВСЕГДА
    Если Истина Тогда

    КонецЕсли;

КонецПроцедуры

Функция в()
	// <-- Ошибка быть не должно, есть другая проверка
КонецФункции

а = 5;
Если а = 0 Тогда            // <-- Ошибка на весь блок ЕСЛИ
// Ошибка на весь следующий блок ИНАЧЕЕСЛИ ВСЕГДА
Иначеесли А = 1 Тогда
    Иначе                   // <-- Ошибка на весь блок ИНАЧЕ. Если КОММЕНТАРИЙ = КОД, то ошибки нет
КонецЕсли;
