
&НаКлиенте
Процедура ВыполнитьПроизвольныйКодНаКлиенте(Строка)
    Выполнить(Строка);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроизвольныйКодНаСервере(Строка)
    Выполнить(Строка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьПроизвольныйКодНаСервереБезКонтекста(Строка)
    Выполнить(Строка);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РассчитатьЧтоТоИзСтрокиБезКонтекст(Строка)
    Возврат Вычислить(Строка);
КонецФункции

&НаКлиентеНаСервере
Функция РассчитатьЧтоТоИзСтроки(Строка)
    Возврат Вычислить(Строка);
КонецФункции

Функция БезОшибок(Строка)
    Возврат ВычислитьЧтоТо(Строка);
КонецФункции

Функция МетодБезДеректив(Строка)
    Возврат Вычислить(Строка);
КонецФункции

&НаКлиенте
Функция ВычислениеНаКлиенте(Строка)
    Возврат Вычислить(Строка);
КонецФункции
