Функция ФункцияБезВозврата()
    ПолезныйКод = 0;
КонецФункции

Функция ФункцияСВозвратом()
    Возврат "ЧтоНибудь";
КонецФункции

Процедура ПроцедураБезВозврата()

КонецПроцедуры

Процедура ПроцедураСВозвратом()
    Возврат;
КонецПроцедуры

Function F()

    For Each A In B Do

    EndDo;

    Return B;
EndFunction

Функция СошибкойРазбора()
    Если Тогда

    КонецЕсли;
    Возврат;
КонецФункции

Функция СошибкойРазбора2()
   Пока А Цикл
    Если
    #Если Сервер Тогда
    F
    #Иначе
    G
    #КонецЕсли
    Тогда
    КонецЕсли;
   КонецЦикла;
  // Возврат;
КонецФункции
