Функция ПроверитьБит()
КонецФункции

Функция ПроверитьПоБитовойМаске()
КонецФункции

Функция УстановитьБит()
КонецФункции

Функция ПобитовоеИ()
КонецФункции

Функция ПобитовоеИли()
КонецФункции

Функция ПобитовоеНе()
КонецФункции

Функция ПобитовоеИНе()
КонецФункции

Функция ПобитовоеИсключительноеИли()
КонецФункции

Функция ПобитовыйСдвигВлево()
КонецФункции

Функция ПобитовыйСдвигВправо()
КонецФункции

Функция CheckBit()
КонецФункции

Функция CheckByBitMask()
КонецФункции

Функция SetBit()
КонецФункции

Функция BitwiseAnd()
КонецФункции

Функция BitwiseOr()
КонецФункции

Функция BitwiseNot()
КонецФункции

Функция BitwiseAndNot()
КонецФункции

Функция BitwiseXor()
КонецФункции

Функция BitwiseShiftLeft()
КонецФункции

Функция BitwiseShiftRight()
КонецФункции

Функция _ПроверитьБит()
КонецФункции

Функция ПроверитьПоБитовойМаске_()
КонецФункции

Функция БИТУстановитьБит()
КонецФункции
