
// Корректное выражение
Если x % 15 = 0 Тогда
	Результат = "FizzBuzz";
КонецЕсли;

// Корректное выражение
Если x % 15 = 0 Тогда
	Результат = "FizzBuzz";
Иначе
    Результат = "Fizz";
КонецЕсли;

// Выражение с ошибкой
Если x % 15 = 0 Тогда
	Результат = "FizzBuzz";
ИначеЕсли x % 3 = 0 Тогда
	Результат = "Fizz";
ИначеЕсли x % 5 = 0 Тогда
	Результат = "Buzz";
КонецЕсли;

// Корректное выражение
Если x % 15 = 0 Тогда
	Результат = "FizzBuzz";
ИначеЕсли x % 3 = 0 Тогда
	Результат = "Fizz";
ИначеЕсли x % 5 = 0 Тогда
	Результат = "Buzz";
Иначе
	Результат = x;
КонецЕсли;
