// Считаем, что в конфигурации два языка ru и en
Процедура БезОшибок()
    
    Приветствие = НСтр("ru='Привет, я простая строка';
        |en='Hi, i'm a simple string'");

    ПолеЗапроса = СтрШаблон("%1.%2 КАК %2", "Документ", "Автомобиль");

КонецПроцедуры

Функция СОшибками(Строка)

    БезТекста = НСтр();
    СНевернымФорматомСтроки = НСтр("Тут текст который не относиться к ниодному языку");

    ТекстТолькоНаРусском = НСтр("ru='Привет, я простая строка''");
    ТекстТолькоНаАнглийском = НСтр("en='Hi, i'm a simple string'");

    СообщениеПользователю = СтрШаблон(НСтр("ru='В строке №%1 не заполнена номенклатура'"), Строка.Номер);
    СообщениеПользователю = СтрШаблон(НСтр("en='In line №%1 nomenclature is not filled'"), Строка.Номер);

    ТекстТолькоНаРусском2 = НСтр("ru='В строке №%1 не заполнена номенклатура'");
    СообщениеПользователю = СтрШаблон(ТекстТолькоНаРусском2, Строка.Номер);

    ТекстТолькоНаАнглийском2 = НСтр("en='In line №%1 nomenclature is not filled'");
    СообщениеПользователю = СтрШаблон(ТекстТолькоНаАнглийском2, Строка.Номер);
    Возврат КонструкторАдресов();

    Порция = Сервис.Autocomplete(ИдентификаторАдресногоОбъекта, 0, НСтр("ru = 'ДОМ='"), 1, КодЯзыка, Метаданные.Имя);

    ВычисляемоеПоле.Оформление.УстановитьЗначениеПараметра("Формат", НСтр("ru = 'ДФ=''д ММММ'''"));

    Возврат НСтр("en=""You must specify the user's extension number to the PBX."";ru='Необходимо указать внутренний номер пользователя АТС.'");

КонецФункции
