Процедура МимоРаз()

КонецПроцедуры

Процедура МимоДва(Раз, Два, Три, Четыре, Пять, Шесть)

КонецПроцедуры


Функция МимоТри(Раз, Два, Три, Четыре, Пять = 5, Шесть = 6, Семь = 7)
    Возврат;
КонецФункции


Функция СработкаПоКоличеству(Раз, Два, Три, Четыре, Пять, Шесть, Семь, Восемь)
    Возврат;
КонецФункции

Процедура СработкаПоКоличествуНеобязательных(Раз, Два, Три, Четыре = 4, Пять = 5, Шесть = 6, Семь = 7)

КонецПроцедуры

Процедура СработкаПоНеобязательныйПередОбязательным(Раз, Два = 2, Три, Четыре, Пять, Шесть, Семь)

КонецПроцедуры