Процедура Проц1()
    // Парность соблюдается
    НачатьТранзакцию();
    Действие();
    ОтменитьТранзакцию();
    ЗафиксироватьТранзакцию();
КонецПроцедуры

Процедура Проц2()
    // Парность соблюдается
    BeginTransaction();
    Действие();
    RollbackTransaction();
    CommitTransaction();
КонецПроцедуры

Функция Функ1()
    // Парность соблюдается
    BeginTransaction();
    Действие();
    RollbackTransaction();
    CommitTransaction();
    Возврат Истина;
КонецФункции

Процедура Проц3()
    Действие();
    ЗафиксироватьТранзакцию(); // Парность не соблюдается здесь
КонецПроцедуры

Процедура Проц4()
    BeginTransaction(); // Парность не соблюдается здесь
    Действие();
КонецПроцедуры

Процедура Проц5()
    НачатьТранзакцию();
    Действие();
    ЗафиксироватьТранзакцию();
    ОтменитьТранзакцию();
    ЗафиксироватьТранзакцию(); // Парность не соблюдается здесь
КонецПроцедуры

Процедура Проц6()
    НачатьТранзакцию(); // Парность не соблюдается здесь для Зафаксировать И Отменить
    НачатьТранзакцию(); // Парность не соблюдается здесь для Отменить
    Действие();
    ЗафиксироватьТранзакцию();
КонецПроцедуры

Процедура Проц7()
    // Парность соблюдается
    НачатьТранзакцию(); // Парность не соблюдается здесь для Отменить
    НачатьТранзакцию(); // Парность не соблюдается здесь для Отменить
    Действие();
    ЗафиксироватьТранзакцию();
    НачатьТранзакцию(); // Парность не соблюдается здесь для Отменить
    ЗафиксироватьТранзакцию();
    ЗафиксироватьТранзакцию();
КонецПроцедуры

Процедура Проц8()
    // Парность соблюдается
    НачатьТранзакцию();
    Если Истина Тогда
        НачатьТранзакцию();
    КонецЕсли;
    Действие();
    Если Условие1() Тогда
        ЗафиксироватьТранзакцию();
    КонецЕсли;
    ОтменитьТранзакцию();
    НачатьТранзакцию();
    ЗафиксироватьТранзакцию();
    ОтменитьТранзакцию();
    ЗафиксироватьТранзакцию();
    ОтменитьТранзакцию();
КонецПроцедуры

Процедура Проц8()
    НачатьТранзакцию();
    ЗафиксироватьТранзакцию();
    ОтменитьТранзакцию();
    ЗафиксироватьТранзакцию(); // Парность не соблюдается здесь
    НачатьТранзакцию();
    ЗафиксироватьТранзакцию();
    ОтменитьТранзакцию();
    ЗафиксироватьТранзакцию(); // Парность не соблюдается здесь
    ОтменитьТранзакцию(); // Парность не соблюдается здесь
КонецПроцедуры

Процедура Проц9()
    НачатьТранзакцию(); // Парность не соблюдается здесь
        НачатьТранзакцию(); // Парность не соблюдается здесь для отменить
        ЗафиксироватьТранзакцию();
        НачатьТранзакцию(); // Парность не соблюдается здесь для отменить
        ЗафиксироватьТранзакцию();
        НачатьТранзакцию();
        ЗафиксироватьТранзакцию();
    ЗафиксироватьТранзакцию();
    ОтменитьТранзакцию();
    ЗафиксироватьТранзакцию(); // Парность не соблюдается здесь
КонецПроцедуры

Процедура Проц9()
    НачатьТранзакцию(); // Парность не соблюдается здесь для отменить
        НачатьТранзакцию(); // Парность не соблюдается здесь для отменить
        ЗафиксироватьТранзакцию();
        НачатьТранзакцию(); // Парность не соблюдается здесь для отменить
        ЗафиксироватьТранзакцию();
        НачатьТранзакцию();
        ЗафиксироватьТранзакцию();
    ЗафиксироватьТранзакцию();
    зафиксироватьТРАНЗакциЮ(); // Парность не соблюдается здесь
    ОтменитьТранзакцию();
КонецПроцедуры