&НаКлиенте
Перем ПравильноАннотирована;

&НаКлиенте
// так тоже правильно
Перем ПравильноАннотирована2;

&НаСервере

// так тоже правильно

Перем ПравильноАннотирована3;

&НаКлиенте
&НаКлиенте
Перем НеПравильноАннотирована1;

&НаКлиенте
&НаСервере
Перем НеПравильноАннотирована2;

&НаКлиенте

&НаСервере
// не правильно
Перем НеПравильноАннотирована3;

&НаКлиенте
Функция ПравильноАннотирована1()
    Возврат 1;
КонецФункции

&НаСервере
// Описание метода
Процедура ПравильноАннотирована2()
    Действие();
КонецПроцедуры

&НаСервере
&НаКлиенте
Процедура НеПравильноАннотирована1()
    Действие();
КонецПроцедуры

&НаСервере
// комментарий
&НаКлиенте

// комментарий
Процедура НеПравильноАннотирована2()
    Действие();
КонецПроцедуры
