Процедура ТриВозврата()
    Если Условие Тогда
        Возврат;
    ИначеЕсли Условие2 Тогда
        ВызовМетода();
        Возврат;
    Иначе
        Возврат;
    КонецЕсли;
КонецПроцедуры

Функция ПятьВозвратов()
    Если Условие Тогда
        Возврат 1;
    ИначеЕсли Условие2 Тогда
        ВызовМетода();
        Возврат 2;
    Иначе
        Для Ит = 0 По 7 Цикл
            Если Ит = 10 Тогда
                Возврат 3;
            КонецЕсли;
        КонецЦикла;
        Возврат 4;
    КонецЕсли;
    Возврат 5;
КонецФункции