// Пути к файлам и каталогам
//////////////////////////////////////////

Массив = Новый Массив;
// windows
Массив.Добавить("\\test\test\TEST.xls"); // <-- ошибка
Массив.Добавить("\\server\share\folder\myfile.txt"); // <-- ошибка
Массив.Добавить("\\server\share\myfile.txt"); // <-- ошибка
Массив.Добавить("\\123.123.123.123\share\folder\myfile.txt"); // <-- ошибка
Массив.Добавить("c:\folder\myfile.txt"); // <-- ошибка
Массив.Добавить("c:\folder\myfileWithoutExtension"); // <-- ошибка
Массив.Добавить("c:\folder"); // <-- ошибка
Массив.Добавить("c:/folder"); // <-- ошибка
Массив.Добавить("c://folder"); // <-- ошибка
Массив.Добавить("//test/test/TEST.xls"); // <-- ошибка
Массив.Добавить("C:\Program Files (x86)\"); // <-- ошибка
Массив.Добавить("F:\DATA\Develop\Module.bsl"); // <-- ошибка
// unix
Массив.Добавить("/dev/test"); // <-- ошибка
Массив.Добавить("/dev/test/test.bsl"); // <-- ошибка
Массив.Добавить("/home/root/test.bsl"); // <-- ошибка
Массив.Добавить("/etc/php-fpm/php.ini"); // <-- ошибка
Массив.Добавить("/less/test");

// не сработает, там нет путей
ПутьОтносительный = "./catalog"; // не должно срабатывать
Путь = "/catalog"; // исключаем, т.к. может использовано для URL и будет FP
ПутьКФайлу = "d:тутНетПутиКФайлу";
ПутьКоВторомуФайлу = "тут/нетпутикфайлу";
Структура = Новый Структура("Путь", "Съешь ещё этих мягких французских булок, да выпей же чаю.");

// Снова проверки путей
ПутьWin = "~/temp/file.txt"; // <-- ошибка
ПутьДляСомневающихся = "C:\temp/обратный слеш\тоже/работает"; // <-- ошибка
НеПуть = "!/bin/sh";

// Тут невозможно отличить fp с доменным путем от обычного сетевого пути в windows.
ДоменныйПуть = "\\domain\user"; // <-- ошибка

ПутьОтКаталогаЮзера = "%UserProfile%/что/то/там"; // <-- ошибка

ТипыНастроек.Добавить("/CurrentVarianKey");

КомандаЗапуска.Добавить("/LoadExternalDataProcessorOrReportFromFile");

Разрешение = ФабрикаXDTO.Создать(
	ФабрикаXDTO.Тип(
		"http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/1.0.0.1",
		РазрешениеВДанных.ВидРазрешения
	)
);
