Функция MD5(стрИсх) Экспорт

	МагическоеЧисло = 16;
	objUTF8 = Новый COMОбъект("System.Text.UTF8Encoding");
	objHash = Новый COMОбъект("System.Security.Cryptography.MD5CryptoServiceProvider");
	hash = objHash.ComputeHash_2(objUTF8.GetBytes_4(стрИсх));

	Результат = "";
	Для Каждого hashvalue Из hash Цикл
		Результат = Результат +
			Сред("0123456789abcdef", Цел(hashvalue / МагическоеЧисло) + 1, 1) +
			Сред("0123456789abcdef", hashvalue % МагическоеЧисло + 1, 1);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция НоваяПочта()

	Почта = Новый Почта;
	Почта.Подключиться("Outlook");
	Возврат Почта;

КонецФункции

Процедура ПроверкаВсегоИВся()

	Перем Почта;
	СистемнаяИнформация = Новый СистемнаяИнформация();
	Если Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Или ТипПлатформы.Linux_x86_64 Тогда
		Почта = Новый Почта;
	КонецЕсли;

	Если Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
		Если Истина Тогда
			Почта = Новый Почта;
		КонецЕсли;
	КонецЕсли;

	Если Почта = Неопределено Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Почта не поддерживается";
		Сообщение.Сообщить();

	КонецЕсли;

	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
        Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда

        Почта = Новый Почта;

    КонецЕсли;

    Если ОбщегоНазначения.ЭтоWindowsСервер() Тогда

        Почта = Новый Почта;

    КонецЕсли;

    #Если Не ВебКлиент Тогда
    Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда

        Почта = Новый Почта;

    КонецЕсли;
    #КонецЕсли

    Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86 Тогда

    	Почта = Новый Почта;

    КонецЕсли;

КонецПроцедуры

Функция НоваяИнтернетПочта()
    // срабатывания не должно быть
    Почта = Новый ИнтернетПочта();
    Возврат Почта;
КонецФункции