// Модуль общего назначения для тестирования

// Возвращает ссылку на общий модуль по имени
//
// Параметры:
//  ИмяМодуля - Строка - имя общего модуля
//
// Возвращаемое значение:
//  ОбщийМодуль - ссылка на общий модуль
//
Функция ОбщийМодуль(ИмяМодуля) Экспорт
	Возврат Неопределено;
КонецФункции

// Создает массив и помещает в него переданное значение.
//
// Параметры:
//  Значение - Произвольный - любое значение.
//
// Возвращаемое значение:
//  Массив из Произвольный - массив из одного элемента.
//
Функция ЗначениеВМассиве(Знач Значение) Экспорт
	Результат = Новый Массив;
	Результат.Добавить(Значение);
	Возврат Результат;
КонецФункции
