// Модуль общего назначения для тестирования

// Возвращает ссылку на общий модуль по имени
//
// Параметры:
//  ИмяМодуля - Строка - имя общего модуля
//
// Возвращаемое значение:
//  ОбщийМодуль - ссылка на общий модуль
//
Функция ОбщийМодуль(ИмяМодуля) Экспорт
	Возврат Неопределено;
КонецФункции

// Создает массив и помещает в него переданное значение.
//
// Параметры:
//  Значение - Произвольный - любое значение.
//
// Возвращаемое значение:
//  Массив из Произвольный - массив из одного элемента.
//
Функция ЗначениеВМассиве(Знач Значение) Экспорт
	Результат = Новый Массив;
	Результат.Добавить(Значение);
	Возврат Результат;
КонецФункции

// Возвращаемое значение:
//   Структура:
//     * Подпись             - ДвоичныеДанные - результат подписания.
//                           - Строка - подписанный КонвертXML, если передавался в данных.
//     * Комментарий         - Строка - комментарий, если он был введен при подписании.
//     * ДатаПодписи         - Дата - дата, когда подпись была сделана.
//     * ОписаниеСертификата - Структура - свойство со свойствами:
//        ** СерийныйНомер  - Строка - серийный номер сертификата.
//        ** КемВыдан       - Строка - издатель.
//
Функция НовыеСвойстваПодписи() Экспорт
	Структура = Новый Структура;
	Возврат Структура;
КонецФункции
