&Пластилин("Логгер")
Перем ВнедренныйПоИмени;

&Пластилин
Перем Логгер;

&Пластилин("Васян")
Перем ЧерезПрозвище;

&Пластилин("Панк")
Перем ПриоритетныйПанк;

&Пластилин("ЛогическоеИмя")
Перем Переименованный;

&Пластилин("ФабричныйЖелудь")
Перем ИзФабрики;

&Внедряемое("СовременныйЛоггер")
Перем ЧерезМетаАннотацию;

&Лог("Префикс")
Перем ЧерезЛог;

&Пластилин("МойКонтроллер")
Перем КонтроллерПоИмени;

&Пластилин("Контроллер")
Перем КонтроллерПоПрозвищу;

&Пластилин("/users")
Перем КонтроллерПоМаршруту;

&Желудь
Процедура ПриСозданииОбъекта(&Пластилин("Логгер") ЛоггерИзКонструктора)
КонецПроцедуры
