// Фикстура сверки с методической рекомендацией «Типизация кода», раздел «Возможности
// типизирующих документирующих комментариев».
// Имя пробы содержит номер пункта рекомендации: «Проба_3_22» это пункт 3.22.

#Область ОписаниеСтруктурыДанныхДокКоммента

// Параметры:
//  Объект - СправочникОбъект.Справочник1
Процедура СекцияПараметровСДвоеточием(Объект)

	Проба_3_2 = Объект;
	Использование(Проба_3_2);

КонецПроцедуры

// Параметры
//  Объект - СправочникОбъект.Справочник1
Процедура СекцияПараметровБезДвоеточия(Объект)

	Проба_3_3 = Объект;
	Использование(Проба_3_3);

КонецПроцедуры

// Параметры:
//  Объект - У параметра может быть описание без декларации типов
Процедура ПараметрБезДекларацииТипов(Объект)

	Проба_3_4 = Объект;
	Использование(Проба_3_4);

КонецПроцедуры

// Параметры:
//  Объект - СправочникОбъект.Справочник1 - Здесь описание для типа
Процедура ОписаниеПослеСекцииТипов(Объект)

	Проба_3_5 = Объект;
	Использование(Проба_3_5);

КонецПроцедуры

// Параметры:
//  Объект - СправочникОбъект.Справочник1 - Здесь описание для типа
//         - ДокументОбъект.Документ1 - Здесь описание для другого типа
Процедура КаждыйТипСНовойСтроки(Объект)

	Проба_3_6 = Объект;
	Использование(Проба_3_6);

КонецПроцедуры

// Параметры:
//  Объект – СправочникОбъект.Справочник1 – здесь короткое тире вместо дефиса-минуса
Процедура КороткоеТиреВместоДефиса(Объект)

	Проба_3_7 = Объект;
	Использование(Проба_3_7);

КонецПроцедуры

// Параметры:
//  Объект - СправочникОбъект.Справочник1, ДокументОбъект.Документ1 - Описание для списка типов
Процедура НесколькоТиповЧерезЗапятую(Объект)

	Проба_3_8 = Объект;
	Использование(Проба_3_8);

КонецПроцедуры

// Параметры:
//  Объект - СправочникОбъект.Справочник1 - Здесь описание для типа
//         Вторая строка описания параметра
Процедура МногострочноеОписаниеПараметра(Объект)

	Проба_3_9 = Объект;
	Использование(Проба_3_9);

КонецПроцедуры

// Параметры:
//  Список - Массив из СправочникСсылка.Справочник1 - Здесь единственный тип элементов
Процедура ЕдинственныйТипЭлементовКоллекции(Список)

	Для Каждого Элемент Из Список Цикл
		Проба_3_10 = Элемент;
		Использование(Проба_3_10);
	КонецЦикла;

КонецПроцедуры

// Параметры:
//  Список - Массив из СправочникСсылка.Справочник1, ДокументСсылка.Документ1 -
Процедура СоставнойТипЭлементовКоллекции(Список)

	Для Каждого Элемент Из Список Цикл
		Проба_3_11 = Элемент;
		Использование(Проба_3_11);
	КонецЦикла;

КонецПроцедуры

// Параметры:
//  Объект - Структура - Здесь нельзя многострочное описание:
//  * ПолеСтруктуры - ТаблицаЗначений - Описание поля структуры, после опять расширение:
//    ** ИмяКолонки - Число - описание колонки таблицы
Процедура РасширениеПолейПослеДвоеточия(Объект)

	Проба_3_12 = Объект.ПолеСтруктуры;
	Использование(Проба_3_12);

	Проба_3_12_ЧленТаблицы = Объект.ПолеСтруктуры.ИмяКолонки;
	Использование(Проба_3_12_ЧленТаблицы);

	Для Каждого СтрокаТаблицы Из Объект.ПолеСтруктуры Цикл
		Проба_3_12_Колонка = СтрокаТаблицы.ИмяКолонки;
		Использование(Проба_3_12_Колонка);
	КонецЦикла;

КонецПроцедуры

// Параметры:
//  Объект - Структура:
//  * ПолеСтруктуры - ТаблицаЗначений:
//    ** ИмяКолонки - Число
Процедура РасширениеПолейБезОписаний(Объект)

	Проба_3_13 = Объект.ПолеСтруктуры;
	Использование(Проба_3_13);

	Для Каждого СтрокаТаблицы Из Объект.ПолеСтруктуры Цикл
		Проба_3_13_Колонка = СтрокаТаблицы.ИмяКолонки;
		Использование(Проба_3_13_Колонка);
	КонецЦикла;

КонецПроцедуры

// Параметры:
//  Объект - Структура, ТаблицаЗначений -
Процедура ЗавершающийДефисОбозначаетСекциюТипов(Объект)

	Проба_3_14 = Объект;
	Использование(Проба_3_14);

КонецПроцедуры

// Возвращаемое значение:
//  Структура, ТаблицаЗначений
Функция ВозвратБезЗавершающегоДефиса()

	Возврат Новый Структура;

КонецФункции

// Возвращаемое значение:
//  Структура, ТаблицаЗначений -
Функция ВозвратСЗавершающимДефисом()

	Возврат Новый Структура;

КонецФункции

// Возвращаемое значение:
//  - Структура
//  - ТаблицаЗначений
Функция ВозвратСпискомСНовойСтроки()

	Возврат Новый Структура;

КонецФункции

Процедура ЗаписиВозвращаемогоЗначения()

	Проба_3_15 = ВозвратБезЗавершающегоДефиса();
	Использование(Проба_3_15);

	Проба_3_16 = ВозвратСЗавершающимДефисом();
	Использование(Проба_3_16);

	Проба_3_17 = ВозвратСпискомСНовойСтроки();
	Использование(Проба_3_17);

КонецПроцедуры

// Возвращаемое значение:
//  Структура:
//  * Ссылка - СправочникСсылка.Справочник1
//  * Количество - Число
Функция НовыйОбъектДанных()

	Возврат Новый Структура;

КонецФункции

// Параметры:
//  Объект - ТаблицаЗначений - См. НовыйОбъектДанных
Процедура СсылкаРядомСТипомБесполезна(Объект)

	Проба_3_18 = Объект;
	Использование(Проба_3_18);

	Для Каждого СтрокаТаблицы Из Объект Цикл
		Проба_3_18_Колонка = СтрокаТаблицы.Ссылка;
		Использование(Проба_3_18_Колонка);
	КонецЦикла;

КонецПроцедуры

// Параметры:
//  Объект - См. НовыйОбъектДанных
Процедура СсылкаВместоТипа(Объект)

	Проба_3_19 = Объект;
	Использование(Проба_3_19);

КонецПроцедуры

// Возвращаемое значение:
//  См. Справочник.Справочник1.ТабличнаяЧасть1
Функция ВозвратСоСсылкойНаТип()

	Возврат Справочники.Справочник1.СоздатьЭлемент().ТабличнаяЧасть1;

КонецФункции

// Возвращаемое значение:
//  См. НовыйОбъектДанных
Функция ВозвратСоСсылкойНаЛокальныйКонструктор() Экспорт

	Возврат НовыйОбъектДанных();

КонецФункции

Процедура СсылкиВВозвращаемомЗначении()

	Проба_3_20 = ВозвратСоСсылкойНаТип();
	Использование(Проба_3_20);

	Для Каждого СтрокаТЧ Из ВозвратСоСсылкойНаТип() Цикл
		Проба_3_20_Реквизит = СтрокаТЧ.Реквизит1;
		Использование(Проба_3_20_Реквизит);
	КонецЦикла;

	Проба_3_21 = ВозвратСоСсылкойНаЛокальныйКонструктор();
	Использование(Проба_3_21);

КонецПроцедуры

#КонецОбласти

#Область СсылкиНаТипыИзОбъектовМетаданных

// Параметры:
//  Объект - См. Справочник.Справочник1.ТабличнаяЧасть1
Процедура СсылкаНаТабличнуюЧасть(Объект)

	Проба_3_22 = Объект;
	Использование(Проба_3_22);

	Для Каждого СтрокаТЧ Из Объект Цикл
		Проба_3_22_Реквизит = СтрокаТЧ.Реквизит1;
		Использование(Проба_3_22_Реквизит);
	КонецЦикла;

КонецПроцедуры

// Параметры:
//  Объект - СтрокаТабличнойЧасти: См. Справочник.Справочник1.ТабличнаяЧасть1
Процедура СсылкаНаСтрокуТабличнойЧасти(Объект)

	Проба_3_23 = Объект;
	Использование(Проба_3_23);

	Проба_3_23_Реквизит = Объект.Реквизит1;
	Использование(Проба_3_23_Реквизит);

КонецПроцедуры

// Параметры:
//  Реквизит1 - См. Справочник.Справочник1.Реквизит1
Процедура СсылкаНаРеквизитОбъекта(Реквизит1)

	Проба_3_24 = Реквизит1;
	Использование(Проба_3_24);

КонецПроцедуры

// Параметры:
//  РеквизитТЧ - См. Справочник.Справочник1.ТабличнаяЧасть1.Реквизит1
Процедура СсылкаНаРеквизитТабличнойЧасти(РеквизитТЧ)

	Проба_3_25 = РеквизитТЧ;
	Использование(Проба_3_25);

КонецПроцедуры

// Параметры:
//  Объект - См. XDTOПакет.ПакетТест.Адрес
Процедура СсылкаНаОбъектПакетаXDTO(Объект)

	Проба_3_26 = Объект;
	Использование(Проба_3_26);

	Проба_3_26_Свойство = Объект.Страна;
	Использование(Проба_3_26_Свойство);

КонецПроцедуры

Процедура ЯвноеСозданиеТипаXDTO()

	ТипАдрес = ФабрикаXDTO.Тип("http://www.example.org/test-package", "Адрес");
	Адрес = ФабрикаXDTO.Создать(ТипАдрес);
	Проба_3_27 = Адрес;
	Использование(Проба_3_27);

	Проба_3_27_Свойство = Адрес.Страна;
	Использование(Проба_3_27_Свойство);

	ПространствоИмен = ПолучитьПространствоИмен();
	ДругойТип = ФабрикаXDTO.Тип(ПространствоИмен, "Адрес");
	ДругойАдрес = ФабрикаXDTO.Создать(ДругойТип); // См. XDTOПакет.ПакетТест.Адрес
	Проба_3_28 = ДругойАдрес;
	Использование(Проба_3_28);

	Проба_3_28_Свойство = ДругойАдрес.Страна;
	Использование(Проба_3_28_Свойство);

КонецПроцедуры

Функция ПолучитьПространствоИмен()

	Возврат "http://www.example.org/test-package";

КонецФункции

// Параметры:
//  Форма - См. Справочник.Справочник1.Форма.ФормаЭлемента
Процедура СсылкаНаФорму(Форма)

	Проба_3_29 = Форма;
	Использование(Проба_3_29);

	Проба_3_29_Ссылка = Форма.Объект.Ссылка;
	Использование(Проба_3_29_Ссылка);

	Проба_3_29_Элемент = Форма.Элементы.Наименование;
	Использование(Проба_3_29_Элемент);

КонецПроцедуры

// Параметры:
//  Объект - См. Справочник.Справочник1.Форма.ФормаЭлемента.Объект
Процедура СсылкаНаРеквизитФормы(Объект)

	Проба_3_30 = Объект;
	Использование(Проба_3_30);

	Проба_3_30_Реквизит = Объект.Реквизит1;
	Использование(Проба_3_30_Реквизит);

КонецПроцедуры

// Параметры:
//  Список - См. Справочник.Справочник1.Форма.ФормаСписка.Элементы.Список
Процедура СсылкаНаЭлементФормы(Список)

	Проба_3_31 = Список;
	Использование(Проба_3_31);

	Проба_3_31_ТекущиеДанные = Список.ТекущиеДанные.Реквизит1;
	Использование(Проба_3_31_ТекущиеДанные);

КонецПроцедуры

// Параметры:
//  Список - ТаблицаФормы - элемент формы с динамическим списком
Процедура ТекущиеДанныеДинамическогоСписка(Список)

	Проба_3_32 = Список.ТекущиеДанные;
	Использование(Проба_3_32);

	Проба_3_32_Реквизит = Список.ТекущиеДанные.Реквизит1;
	Использование(Проба_3_32_Реквизит);

КонецПроцедуры

// Параметры:
//  СтрокаТЗ - ДанныеФормыЭлементКоллекции: См. Справочник.Справочник1.Форма.ФормаСписка.Элементы.Список
Процедура СсылкаНаСтрокуТаблицыФормы(СтрокаТЗ)

	Проба_3_33 = СтрокаТЗ;
	Использование(Проба_3_33);

	Проба_3_33_Реквизит = СтрокаТЗ.Реквизит1;
	Использование(Проба_3_33_Реквизит);

КонецПроцедуры

#КонецОбласти

#Область СсылкиНаТипыОбъектовКода

// Параметры:
//  Значение - См. Справочники.СправочникСМенеджером.НоваяТаблицаТоваров.ВидТовара
Процедура СсылкаНаПараметрМетодаМодуляМенеджера(Значение)

	Проба_3_34 = Значение;
	Использование(Проба_3_34);

КонецПроцедуры

// Параметры:
//  Строки - См. СправочникОбъект.СправочникСМенеджером.МетодМодуляОбъекта.Строки
Процедура СсылкаНаПараметрМетодаМодуляОбъекта(Строки)

	Проба_3_35 = Строки;
	Использование(Проба_3_35);

	Для Каждого Элемент Из Строки Цикл
		Проба_3_35_Элемент = Элемент;
		Использование(Проба_3_35_Элемент);
	КонецЦикла;

КонецПроцедуры

// См. ОбщегоНазначения.ОбщийМодуль
Процедура НаследованиеСигнатурыОтДругогоМодуля(ИмяМодуля)

	Проба_3_36 = ИмяМодуля;
	Использование(Проба_3_36);

КонецПроцедуры

#КонецОбласти

#Область ТипизацияЛокальнойПеременнойВСтроке

Процедура ТипИСсылкаВСтрокеПрисваивания(Форма, ИмяРеквизита)

	Проба_3_37 = Форма[ИмяРеквизита]; // ПолеФормы -
	Использование(Проба_3_37);

	Проба_3_38 = ПолучитьИзВременногоХранилища("адрес"); // См. НовыйОбъектДанных
	Использование(Проба_3_38);

КонецПроцедуры

#КонецОбласти

Процедура Использование(Значение)

	Возврат;

КонецПроцедуры
