Процедура ПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

КонецПроцедуры

Процедура ОбработчикОписаниеОповещения(Ответ, ДопПараметры) Экспорт

    // Тут какой-то код

КонецПроцедуры

Процедура ОшибкаОписаниеОповещения(Ответ, ДопПараметры) Экспорт

    // Тут какой-то код

КонецПроцедуры

Процедура ОбработчикОписаниеОповещенияВПеременной(Ответ, ДопПараметры) Экспорт

    // Тут какой-то код

КонецПроцедуры

Процедура ОшибкаОписаниеОповещенияВПеременной(Ответ, ДопПараметры) Экспорт

    // Тут какой-то код

КонецПроцедуры